
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберете Excel - файл";
	Диалог.ПолноеИмяФайла = "C:\";
	Диалог.Фильтр = "Таблицы (*.xls, *.xlsx)|*.xls; *.xlsx;|Microsoft Excel 97/2000/XP/2003 (*.xls)|*.xls|Microsoft Excel 2007/2010(*.xlsx)|*.xlsx";
	Если Диалог.Выбрать() Тогда
	    Объект.ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура  НайтиФИО(ФИО,Адрес,Категория,ДатаРождения,Паспорт,ИНН)
	ФИО_Поиск = Справочники.ФизическиеЛица.НайтиПоНаименованию(ФИО);
	
	Если  ФИО_Поиск.Пустая() Тогда
	     НовыйСправочник = Справочники.ФизическиеЛица.СоздатьЭлемент();
		 НовыйСправочник.Наименование  = ФИО;
		 НовыйСправочник.ИНН = ИНН;
		 НовыйСправочник.АдресФактическогоПроживания = Адрес;
		 НовыйСправочник.АдресПрописка = Адрес;
		 НовыйСправочник.ДатаРождения = ДатаРождения;
		 НоваяСтрокаКатегории = НовыйСправочник.ЛьготныеКатегории.Добавить();
		 ЛьготнаяКатегория = Справочники.ЛьготныеКатегории.НайтиПоНаименованию(Категория);
		 НоваяСтрокаКатегории.Категория =   ЛьготнаяКатегория.Ссылка;
		 НоваяСтрокаПаспорт = НовыйСправочник.Документы.Добавить();
		 ПоискДок = Справочники.ДокументыПоВидам.НайтиПоНаименованию("Паспорт");
		 НоваяСтрокаПаспорт.Наименование = ПоискДок;
		 НоваяСтрокаПаспорт.Серия = Паспорт;
		 НоваяСтрокаПаспорт.Номер = Паспорт;
		 //НоваяСтрокаПаспорт.Паспорт = Истина;
		 НовыйСправочник.СельскийСовет = Объект.СельскийСовет;
		 НовыйСправочник.Записать();
		 Сообщить("Сорздан Справочник "+ НовыйСправочник.Наименование);
	 
	КонецЕсли;
	 
	КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Объект.ДанныеНаУголь.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		ExcelКнига =Excel.Application.WorkBooks.Open(Объект.ПутьКФайлу);
		ExcelЛист = ExcelКнига.WorkSheets(1);
	Исключение
		//ОбщееНазначение.СообщитьПользователю("Ошибка. Возможно не установлен Excel.");
		Возврат;
	КонецПопытки;
	//vExcel = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	//Если vExcel = "8" Тогда
	    КоличествоСтрок = ExcelЛист.Cells.CurrentRegion.Rows.Count;
		КоличествоКолонок = Макс(ExcelЛист.Cells.CurrentRegion.Columns.Count,13);
	//Иначе	
	//    КоличествоСтрок = ExcelЛист.Cells(1,1).SpecialCells(1,1).Rows.Count;
	//	КоличествоКолонок = ExcelЛист.Cells(1,1).SpecialCells(1,1).Column;
	//КонецЕсли;
	
	Для ТекСтрока = Начать По Закончить Цикл
		Адрес  = СокрЛП(ExcelЛист.Cells(ТекСтрока,3).Value);
		Категория  = СокрЛП(ExcelЛист.Cells(ТекСтрока,4).Value);
		ДатаРождения =  СокрЛП(ExcelЛист.Cells(ТекСтрока,5).Value);
		Паспорт = СокрЛП(ExcelЛист.Cells(ТекСтрока,6).Value);
		ИНН =  СтрЗаменить(СокрЛП(ExcelЛист.Cells(ТекСтрока,7).Value),Символы.НПП,"");
		ФИО = СокрЛП(ExcelЛист.Cells(ТекСтрока,2).Value);
		
		НайтиФИО(ФИО,Адрес,Категория,ДатаРождения,Паспорт,ИНН);
		
		НоваяСтрока = Объект.ДанныеНаУголь.Добавить();
		НоваяСтрока.ФИО   = ФИО;
		НоваяСтрока.Адрес  = Адрес;
		НоваяСтрока.Категория = Категория;
		НоваяСтрока.ДатаРождения = ДатаРождения;
		НоваяСтрока.ПаспортныеДанные = Паспорт;
		НоваяСтрока.ИНН  = ИНН;
		
	
	КонецЦикла;
		
	Excel.Application.Quit();
	Excel = 0;
	
  
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументНаСервере()
	Для каждого ТекСтрока Из Объект.ДанныеНаУголь Цикл
	     Док = Документы.ЛичноеДело.СоздатьДокумент();
		 Если ЗначениеЗаполнено(Объект.ДатаДок) Тогда
		    Док.Дата = Объект.ДатаДок; 
		 Иначе	
		 	Док.Дата = ТекущаяДата();
		 КонецЕсли;
		 
		 Заявитель = Справочники.ФизическиеЛица.НайтиПоНаименованию(ТекСтрока.ФИО);
		 Док.Заявитель = Заявитель;
		 Док.Организация = Объект.Организация;
		 Док.АдресПрописка = Заявитель.АдресПрописка;
		 Док.АдресФактическогоПроживания = Заявитель.АдресФактическогоПроживания;
		 Док.АдресФактПроживанияИПропискаСовпадают = Заявитель.АдресФактПроживанияИПропискаСовпадают;
		 ЛьготнаяКатегория = Справочники.ЛьготныеКатегории.НайтиПоНаименованию(ТекСтрока.Категория);
		 Док.ЛьготнаяКатегория = ЛьготнаяКатегория;
		 Док.Льгота = Истина;
		 НовЛьгота = Док.ВидыЛьготы.Добавить();
		 НовЛьгота.ЛьготнаяКатегория = ЛьготнаяКатегория;
		 НовЛьгота.Наименование =  Объект.ВидЛьготы;
		 НовЛьгота.ПредметЛьготы = Объект.ПредметЛьготы;
		 НовЛьгота.Показатель = 2;
		 Док.Принял = Объект.Сотрудник;
		 Док.СельскийСовет = Объект.СельскийСовет;
		 Док.Записать();
		 		

		 Сообщить("Документ создан "+ Строка(Док))
	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	СоздатьДокументНаСервере();
КонецПроцедуры
