
Процедура ПриложениеКАкту(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПриложениеКАкту)
	Макет = Документы.ПолученопоПоТалонам.ПолучитьМакет("ПриложениеКАкту");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ПолученопоПоТалонам.Дата, ДЕНЬ) КАК Дата,
	|	ПолученопоПоТалонам.Номер КАК Номер,
	|	ПолученопоПоТалонам.Организация КАК Организация,
	|	ПолученопоПоТалонам.Склад.Адрес КАК Склад,
	|	ПолученопоПоТалонам.Расход.(
	|		НомерСтроки КАК НомерСтроки,
	|		Заявитель КАК Заявитель,
	|		НомерТалона КАК НомерТалона,
	|		НАЧАЛОПЕРИОДА(ПолученопоПоТалонам.Расход.ДатаТалона, ДЕНЬ) КАК ДатаТалона,
	|		ПредметЛьготы КАК ПредметЛьготы,
	|		ЕденицаИзмерения КАК ЕденицаИзмерения,
	|		ОтметкаОполучении КАК ОтметкаОполучении,
	|		Количество КАК Количество,
	|		ДокументОснование.ЛьготнаяКатегория КАК Категория
	|	) КАК Расход
	|ИЗ
	|	Документ.ПолученопоПоТалонам КАК ПолученопоПоТалонам
	|ГДЕ
	|	ПолученопоПоТалонам.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРасходШапка = Макет.ПолучитьОбласть("РасходШапка");
	ОбластьРасход = Макет.ПолучитьОбласть("Расход");
	
	ТабДок.Очистить();
	КолТалон   = 0;
	КолУголь   = 0;
	КолДрова   = 0;
	КолПеллеты = 0;
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРасходШапка);
		ВыборкаРасход = Выборка.Расход.Выбрать();
		Пока ВыборкаРасход.Следующий() Цикл
			ОбластьРасход.Параметры.Заполнить(ВыборкаРасход);
			ТабДок.Вывести(ОбластьРасход, ВыборкаРасход.Уровень());
			КолТалон = КолТалон+1;
			
			Если ВыборкаРасход.ПредметЛьготы = Справочники.ПредметЛьготы.НайтиПоНаименованию("Уголь") Тогда 
				КолУголь = КолУголь+ВыборкаРасход.Количество;
			КонецЕсли;	
			Если ВыборкаРасход.ПредметЛьготы = Справочники.ПредметЛьготы.НайтиПоНаименованию("Дрова") Тогда 
				КолДрова = КолДрова+ВыборкаРасход.Количество;
			КонецЕсли;	
			Если ВыборкаРасход.ПредметЛьготы = Справочники.ПредметЛьготы.НайтиПоНаименованию("Пеллеты") Тогда 
				КолПеллеты = КолПеллеты+ВыборкаРасход.Количество;
			КонецЕсли;	
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	Подвал = Макет.ПолучитьОбласть("Подвал"); 
	Подвал.Параметры.ИтогоТалонов = КолТалон;
	Подвал.Параметры.ИтогоКоличествоУголь 	= КолУголь;
	Подвал.Параметры.ИтогоКоличествоДрова   = КолДрова;
	Подвал.Параметры.ИтогоКоличествоПеллеты = КолПеллеты;
	Подвал.Параметры.Сотрудник =  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Ссылка[0].Сотрудник) ;      
	ТабДок.Вывести(Подвал);
	//}}
КонецПроцедуры
