Процедура ДвижениеПоРегиструНакопленияПолученоПредметЛьгот()
	// регистр ПолученоПредметЛьгот 
	Движения.ПолученоПредметЛьгот.Записывать = Истина;
	Для Каждого ТекСтрокаРасход Из Расход Цикл
		Движение = Движения.ПолученоПредметЛьгот.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ВидЛьготы = ВидЛьготы;
		Движение.ЛьготнаяКатегория = ТекСтрокаРасход.ЛьготнаяКатегория;
		Движение.СельскийСовет = ТекСтрокаРасход.СельскийСовет;
		Движение.Заявитель = ТекСтрокаРасход.Заявитель;
		Движение.Количество = ТекСтрокаРасход.Количество;
		Движение.НомерТалона = ТекСтрокаРасход.НомерТалона;
		Движение.ДатаТалона = ТекСтрокаРасход.ДатаТалона;
		Движение.НомерРеестра = ТекСтрокаРасход.НомерРеестра;
		Движение.ДокументОснование = ТекСтрокаРасход.ДокументОснование;
		Движение.ЕденицаИзмерения = ТекСтрокаРасход.ЕденицаИзмерения;
	КонецЦикла;


КонецПроцедуры	

Процедура ДвижениеПоРегиструНакопленияОстаткиНаСкладах()
	
	Если ПроходРасход = Истина Тогда
		// регистр ОстаткиНаСкладах Приход
		Движения.ОстаткиНаСкладах.Записывать = Истина;
		Для Каждого ТекСтрокаПриход Из Приход Цикл
			Движение = Движения.ОстаткиНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Склад = Склад;
			Движение.ПредметЛьготы = ТекСтрокаПриход.ПредметЛьготы;
			Движение.Количество = ТекСтрокаПриход.Количество;
			Движение.ЕденицаИзмерения = ТекСтрокаПриход.ЕденицаИзмерения;
		КонецЦикла;
	Иначе
		// регистр ОстаткиНаСкладах Расход
		// нужно прописать контроль остатков
		Движения.ОстаткиНаСкладах.Записывать = Истина;
		Для Каждого ТекСтрокаРасход Из Расход Цикл
			Движение = Движения.ОстаткиНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Склад = Склад;
			Движение.ПредметЛьготы = ТекСтрокаРасход.ПредметЛьготы;
			Движение.Количество = ТекСтрокаРасход.Количество;
			Движение.ЕденицаИзмерения = ТекСтрокаРасход.ЕденицаИзмерения;
		КонецЦикла;
		
	КонецЕсли;	
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, Режим)
	ДвижениеПоРегиструНакопленияОстаткиНаСкладах();
	ДвижениеПоРегиструНакопленияПолученоПредметЛьгот();
КонецПроцедуры
