&НаСервере
Функция ПолучитьТабличныеДокументы(МассивДокументов)
	Возврат  Документы.ЛичноеДело.СформироватьПечатьСправкиМСРебенок(МассивДокументов);
КонецФункции	

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабличныйДокумент = ПолучитьТабличныеДокументы(ПараметрКоманды);
	Если ТабличныйДокумент = Неопределено тогда
		Возврат;
	КонецЕсли;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.Защита = Ложь;
	ТабличныйДокумент.ТолькоПросмотр = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.Показать("Справка ребенок из многодетной семьи");
КонецПроцедуры
