&НаСервереБезКонтекста
Функция ВернутьДанныеИзДокТалоны(ЭлементыПодстановки,ВидЛьготы,ПериодНачало, ПериодОкончания)
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.ДокументОснование КАК ДокументОснование,
		|	ТалоныТалоныТЧ.Заявитель КАК Заявитель,
		|	ТалоныТалоныТЧ.Ссылка КАК Ведомость,
		|	ТалоныТалоныТЧ.Номер КАК НомерТалона,
		|	ТалоныТалоныТЧ.ДатаВыдачи КАК ДатаВыдачиТалона,
		|	ТалоныТалоныТЧ.АдресДомовладельца КАК АдресДомовладельца,
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.НомерПолучателя КАК НомерПолучателя,
		|	ТалоныТалоныТЧ.ПредметЛьготы КАК ПредметЛьготы,
		|	ТалоныТалоныТЧ.НормаОтпуска КАК НормаОтпуска,
		|	ТалоныТалоныТЧ.ПериодДействияТалона КАК ПериодДействияТалона,
		|	ТалоныТалоныТЧ.Ссылка.Организация КАК Организация,
		|	ТалоныТалоныТЧ.ЕденицыИзмерения КАК ЕденицыИзмерения,
		|	ТалоныТалоныТЧ.СельскийСовет КАК СельскийСовет
		|ИЗ
		|	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.ДатаВыдачи МЕЖДУ &ДатаВыдачи1 И &ДатаВыдачи2
		|	И ТалоныТалоныТЧ.Ссылка.ВидЛьготы = &ВидЛьготы
		|	И ТалоныТалоныТЧ.ДокументОснование В(&ДокументОснование)";
	
	Запрос.УстановитьПараметр("ВидЛьготы", ВидЛьготы);
	Запрос.УстановитьПараметр("ДатаВыдачи1", ПериодНачало);
	Запрос.УстановитьПараметр("ДатаВыдачи2", ПериодОкончания);
	Запрос.УстановитьПараметр("ДокументОснование", ЭлементыПодстановки);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);

	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции	

&НаСервере
Функция ЛичноеДелоВырнутьЗаявителя(ВыбранныйЭлемент)
	Возврат   ВыбранныйЭлемент.Заявитель;
КонецФункции

&НаКлиенте
Процедура ПодборЛД(Команда)
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	ОткрытьФорму("Документ.ЛичноеДело.ФормаВыбора",ПараметрыФормы,Элементы.ТаблицаДляЗаполнения);
КонецПроцедуры

&НаСервере
Процедура ВидЛьготыПриИзмененииНаСервере()
	ПериодНачало = ВидЛьготы.ДатаНачала;
	ПериодОкончания = ВидЛьготы.ДатаОкончания;
КонецПроцедуры


&НаКлиенте
Процедура ВидЛьготыПриИзменении(Элемент)
	ВидЛьготыПриИзмененииНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура ТаблицаДляЗаполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивДляВыбора  = Новый Массив;
	
	
	
	Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
		  МассивДляВыбора.Добавить(ВыбранныйЭлемент);
	КонецЦикла;
	
	МассивВыбора = ВернутьДанныеИзДокТалоны(МассивДляВыбора,ВидЛьготы,ПериодНачало, ПериодОкончания);

	Для Каждого ЭлементМассива из МассивВыбора Цикл
			НС = ТаблицаДляЗаполнения.Добавить();
			НС.ДокументОснование 			= ЭлементМассива.ДокументОснование; 
			НС.Заявитель         			= ЭлементМассива.Заявитель;
			НС.Ведомость         			= ЭлементМассива.Ведомость;
			НС.НомерТалона       			= ЭлементМассива.НомерТалона;
			НС.ДатаВыдачиТалона  			= ЭлементМассива.ДатаВыдачиТалона;
			НС.АдресДомовладельца           = ЭлементМассива.АдресДомовладельца;
			НС.Категория                    = ЭлементМассива.Категория;
			НС.НомерПолучателя              = ЭлементМассива.НомерПолучателя;
			НС.НормаОтпуска                 = ЭлементМассива.НормаОтпуска;
			НС.ПериодДействияТалона         = ЭлементМассива.ПериодДействияТалона;
			НС.Организация                  = ЭлементМассива.Организация;
			НС.ЕденицыИзмерения             = ЭлементМассива.ЕденицыИзмерения;
			НС.СельскийСовет                = ЭлементМассива.СельскийСовет;
			НС.ПредметЛьготы                = ЭлементМассива.ПредметЛьготы;
			
	КонецЦикла;	
	
	

	  
КонецПроцедуры

// Печать////
&НаСервере
Функция ПечатьТалоновНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.Талоны.ПолучитьМакет("ПФ_MXL_МакетТалоныГоризонталь");
	ПервыйДокумент = Истина;
	Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
    КонецЕсли;
    ПервыйДокумент = Ложь;
    // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		КолТалоновНаЛисте = 1;
		КолНаЛисте = 1;

	Для Каждого СтрокаТЧ из ТаблицаДляЗаполнения Цикл
		   Если КолНаЛисте = 7 Тогда 
				 КолНаЛисте =1;
				 ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			Область = Макет.ПолучитьОбласть("Талон|Горизонталь");
			Область.Параметры.Заявитель = СтрокаТЧ.Заявитель;
		    Область.Параметры.Номер   =  СтрокаТЧ.НомерТалона;
			Область.Параметры.АдресДомовладельца  = СтрокаТЧ.АдресДомовладельца;                        
			Область.Параметры.СтатусПолучателя = СтрокаТЧ.Категория;
		    Область.Параметры.НомерПолучателя  = СтрокаТЧ.НомерПолучателя;
			Область.Параметры.ПредметЛьготы   = СтрокаТЧ.ПредметЛьготы;
			Область.Параметры.НормаОтпуска  = СтрокаТЧ.НормаОтпуска;
			Область.Параметры.ЕденицаИзмерения  = СтрокаТЧ.ЕденицыИзмерения;
			Область.Параметры.ДатаВыдачи    =Формат(СтрокаТЧ.ДатаВыдачиТалона,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			Область.Параметры.ПериодДействияТалона  = Формат(СтрокаТЧ.ПериодДействияТалона,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			//Область.Параметры.ДатаОтпускаУгля  = Формат(СтрокаТЧ.ДатаОтпускаУгля,"ДФ=dd.MM.yyyy; ДЛФ=DD");
		    Область.Параметры.ЗаявительИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрокаТЧ.Заявитель);
			ТекущийНачальник = ПараметрыСеанса.ТекущийНачальникУправления;
		    Область.Параметры.СотрудникДляРосписиИнициалы  = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ТекущийНачальник); 
			Область.Параметры.ДолжностьДляРосписи  =  ТекущийНачальник.Должность;
			Область.Параметры.Организация   =  СтрокаТЧ.Организация.ПолноеНаименование;
			Если КолТалоновНаЛисте > 3 Тогда
				ТабДок.ВывестиВертикальныйРазделительСтраниц();
				ТабДок.Вывести(Область);
				КолТалоновНаЛисте = 1;
				
			Иначе
				ТабДок.Присоединить(Область);
			КонецЕсли;	
			КолТалоновНаЛисте = КолТалоновНаЛисте +1;
			КолНаЛисте = КолНаЛисте+1;	

	КонецЦикла;	
	//Конец вывода документа
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.АвтоМасштаб=Истина;

	
    Возврат ТабДок;
КонецФункции


&НаКлиенте
Процедура ПечатьТалонов(Команда)
	ТабДок = ПечатьТалоновНаСервере();
	ТабДок.Показать("печать талонов");
КонецПроцедуры

&НаСервере
Функция  ПечатьВедомостиНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.Талоны.ПолучитьМакет("ПФ_MXL_РеестрТалоны");
		Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(СельскийСовет) Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.НомерСтроки КАК НомерСтроки,
		|	ТалоныТалоныТЧ.Заявитель КАК Заявитель,
		|	ТалоныТалоныТЧ.АдресДомовладельца КАК АдресДомовладельца,
		|	ТалоныТалоныТЧ.Номер КАК Номер,
		|	ТалоныТалоныТЧ.ДатаВыдачи КАК ДатаВыдачи,
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.Заявитель.ДатаРождения КАК ЗаявительДатаРождения,
		|	ТалоныТалоныТЧ.Заявитель.ПаспортСерия + ТалоныТалоныТЧ.Заявитель.ПаспортНомер КАК ПаспортныеДанные,
		|	ТалоныТалоныТЧ.Заявитель.ИНН КАК ЗаявительИНН,
		|	"""" КАК ДатаПолучения,
		|	"""" КАК ПодписьЗаявителя
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.СельскийСовет = &СельскийСовет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.НомерСтроки КАК НомерСтроки,
		|	ВТ.Заявитель КАК Заявитель,
		|	ВТ.АдресДомовладельца КАК АдресДомовладельца,
		|	ВТ.Номер КАК Номер,
		|	ВТ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ.Категория КАК Категория,
		|	ВТ.ЗаявительДатаРождения КАК ЗаявительДатаРождения,
		|	ВТ.ПаспортныеДанные КАК ПаспортныеДанные,
		|	ВТ.ЗаявительИНН КАК ЗаявительИНН,
		|	ВТ.ДатаПолучения КАК ДатаПолучения,
		|	ВТ.ПодписьЗаявителя КАК ПодписьЗаявителя
		|ИЗ
		|	ВТ КАК ВТ";
	
		Запрос.УстановитьПараметр("СельскийСовет",СельскийСовет);	
		Запрос.УстановитьПараметр("ТалоныТЧ",ТаблицаДляЗаполнения);	
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.НомерСтроки КАК НомерСтроки,
		|	ТалоныТалоныТЧ.Заявитель КАК Заявитель,
		|	ТалоныТалоныТЧ.АдресДомовладельца КАК АдресДомовладельца,
		|	ТалоныТалоныТЧ.Номер КАК Номер,
		|	ТалоныТалоныТЧ.ДатаВыдачи КАК ДатаВыдачи,
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.Заявитель.ДатаРождения КАК ЗаявительДатаРождения,
		|	ТалоныТалоныТЧ.Заявитель.ПаспортСерия + ТалоныТалоныТЧ.Заявитель.ПаспортНомер КАК ПаспортныеДанные,
		|	ТалоныТалоныТЧ.Заявитель.ИНН КАК ЗаявительИНН,
		|	"""" КАК ДатаПолучения,
		|	"""" КАК ПодписьЗаявителя
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТалоныТЧ КАК ТалоныТалоныТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.НомерСтроки КАК НомерСтроки,
		|	ВТ.Заявитель КАК Заявитель,
		|	ВТ.АдресДомовладельца КАК АдресДомовладельца,
		|	ВТ.Номер КАК Номер,
		|	ВТ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ.Категория КАК Категория,
		|	ВТ.ЗаявительДатаРождения КАК ЗаявительДатаРождения,
		|	ВТ.ПаспортныеДанные КАК ПаспортныеДанные,
		|	ВТ.ЗаявительИНН КАК ЗаявительИНН,
		|	ВТ.ДатаПолучения КАК ДатаПолучения,
		|	ВТ.ПодписьЗаявителя КАК ПодписьЗаявителя
		|ИЗ
		|	ВТ КАК ВТ";
		Запрос.УстановитьПараметр("ТалоныТЧ",ТаблицаДляЗаполнения);
	КонецЕсли;	
		

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Шапка);
	Счетчик = 1;
	Пока Выборка.Следующий() Цикл
		Строка = Макет.ПолучитьОбласть("Строка");
		Строка.Параметры.НомерСтроки = Счетчик;
		Строка.Параметры.Заявитель = Выборка.Заявитель;
		Строка.Параметры.Номер = Выборка.Номер;
		Строка.Параметры.АдресДомовладельца = Выборка.АдресДомовладельца;
		Строка.Параметры.Категория = Выборка.Категория;
		Строка.Параметры.ДатаРождения = Формат(Выборка.ЗаявительДатаРождения,"ДФ=dd.MM.yyyy");
		Строка.Параметры.ПаспортныеДанные = Выборка.ПаспортныеДанные;
		Строка.Параметры.ИНН = Выборка.ЗаявительИНН;
		Строка.Параметры.ДатаВыдачи = Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy");

		ТабДок.Вывести(Строка);
		Счетчик = Счетчик+1;
		
		
	КонецЦикла;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");	
	Подвал.Параметры.КоличествоТалонов = Счетчик-1;
	ТабДок.Вывести(Подвал);


	Возврат ТабДок;

КонецФункции

&НаКлиенте
Процедура ПечатьВедомости(Команда)
	ТабДок = ПечатьВедомостиНаСервере();
	ТабДок.Показать("Печать ведомости по сельским советам");

КонецПроцедуры


