&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


//*****************************************************
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

//*****************************************************
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


//*****************************************************

//4. Добавить в процедуру "ПослеЗаписи"
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
	


//*****************************************************


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОСНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеСредстваСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредстваСрезПоследних.ОсновноеСредство.ДокументРегистрации КАК ДокументРегистрации,
		|	ОсновныеСредстваСрезПоследних.ОсновноеСредство.НомерДокументРегистрации КАК НомерДокументРегистрации,
		|	ОсновныеСредстваСрезПоследних.ОсновноеСредство.ДатаДокументРегистрации КАК ДатаДокументРегистрации,
		|	ОсновныеСредстваСрезПоследних.ОсновноеСредство.ЗаводскойНомер КАК ЗаводскойНомер,
		|	ОсновныеСредстваСрезПоследних.ОсновноеСредство.Паспорт КАК Паспорт,
		|	ОсновныеСредстваСрезПоследних.ОсновноеСредство.ДатаПоступленияНаУчет КАК ДатаПоступленияНаУчет,
		|	ОсновныеСредстваСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ОсновныеСредстваСрезПоследних.КоличествоФакт КАК КоличествоФакт,
		|	ОсновныеСредстваСрезПоследних.СтоимостьФакт КАК СтоимостьФакт
		|ИЗ
		|	РегистрСведений.ОсновныеСредства.СрезПоследних(
		|			&Период,
		|			ВЭксплуатации = ИСТИНА
		|				И Организация = &Организация) КАК ОсновныеСредстваСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Объект.ДатаНачало);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ОС.Добавить();
		НоваяСтрока.Наименование    			=    Выборка.ОсновноеСредство;
		НоваяСтрока.ДокуметРегистрация          =	 Выборка.ДокументРегистрации;
		НоваяСтрока.ДокуметРегистрацияНомер     =    Выборка.НомерДокументРегистрации;
		НоваяСтрока.ДокуметРегистрацияДата      =    Выборка.ДатаДокументРегистрации;
		НоваяСтрока.ИнвентарныйНомер            =    Выборка.ИнвентарныйНомер;
		НоваяСтрока.Паспорт                     =    Выборка.Паспорт;
		НоваяСтрока.ЗаводскойНомер              =    Выборка.ЗаводскойНомер;
		НоваяСтрока.ДатаПоступленияНаУчет       =    Выборка.ДатаПоступленияНаУчет;
		НоваяСтрока.СтоимостьФакт               =    Выборка.СтоимостьФакт;
		НоваяСтрока.КоличествоФакт		        =    Выборка.КоличествоФакт;
		НоваяСтрока.СтоимостьБУ                 =    Выборка.СтоимостьФакт;
		НоваяСтрока.КоличествоБУ                =    Выборка.КоличествоФакт;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОС(Команда)
	Объект.ОС.Очистить();
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачало) Тогда
		 // сюда писать код
	КонецЕсли;	
	ЗаполнитьОСНаСервере();
КонецПроцедуры


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//*****************************************************
