&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыРазмещения = Новый Структура;
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.ЛичноеДело"));
	Источники = Новый ОписаниеТипов(Массив);
	ПараметрыРазмещения.Вставить("Источники",Источники);
	ПараметрыРазмещения.Вставить("ПрефиксГрупп", "");
    ПараметрыРазмещения.Вставить("КоманднаяПанель", ЭтаФорма.КоманднаяПанель);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект,ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


//*****************************************************
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

//*****************************************************
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ПериодНачало = НачалоГода(ТекущаяДата());
	Объект.ПериодОкончания = КонецМесяца(ТекущаяДата());
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


//*****************************************************

//4. Добавить в процедуру "ПослеЗаписи"
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
	


//*****************************************************


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры



// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//***********************************************************

&НаСервере
Функция РешениеКомиссии(ТД)
	  Возврат ТД.РешениеКомиссииТекст;
КонецФункции

&НаСервере
Функция ДатаЗаявления(ТД)
	  Возврат ТД.ДатаЗаявления;
КонецФункции

&НаСервере
Функция Причина(ТД)
	  Возврат ТД.ПричинаКомиссии;
КонецФункции

&НаСервере
Функция ПолучитьАдрес(ТД)
	  Возврат ТД.АдресПрописка;
КонецФункции

&НаСервере
Функция ПолучитьЗаявителя(ТД)
	Возврат  ТД.Заявитель;	
КонецФункции

&НаКлиенте
Процедура СписокКомиссияДокументОснованиеПриИзменении(Элемент)
	ТД = Элементы.ТалоныТЧ.ТекущиеДанные;
	ТД.ФИО = ПолучитьЗаявителя(ТД.ДокументОснование);
	ТД.АдресРегистрации  = ПолучитьАдрес(ТД.ДокументОснование);
	ТД.ДатаЗаявления   = ДатаЗаявления(ТД.ДокументОснование);
	ТД.Причина = Причина(ТД.ДокументОснование);
	ТД.РешениеКомиссии = РешениеКомиссии(ТД.ДокументОснование);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКомиссиюНаСервере()
	Объект.СписокКомиссия.Очистить();		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДелоКомиссияСрезПоследних.Заявитель КАК Заявитель,
		|	ЛичноеДелоКомиссияСрезПоследних.АдресРегистрации КАК АдресРегистрации,
		|	ЛичноеДелоКомиссияСрезПоследних.ДатаОткрытияДела КАК ДатаОткрытияДела,
		|	ЛичноеДелоКомиссияСрезПоследних.ПричинаКомиссии КАК ПричинаКомиссии,
		|	ЛичноеДелоКомиссияСрезПоследних.РешениеКомиссииТекст КАК РешениеКомиссииТекст,
		|	ЛичноеДелоКомиссияСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛичноеДелоКомиссия.СрезПоследних КАК ЛичноеДелоКомиссияСрезПоследних
		|ГДЕ
		|	ЛичноеДелоКомиссияСрезПоследних.Период МЕЖДУ &ПериодНачало И &ПериодОкончания
		|	И ЛичноеДелоКомиссияСрезПоследних.Закрыто = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПериодНачало", Объект.ПериодНачало);
	Запрос.УстановитьПараметр("ПериодОкончания", Объект.ПериодОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СписокКомиссия.Добавить();
		НоваяСтрока.ДокументОснование  = Выборка.Регистратор;
		НоваяСтрока.ФИО = Выборка.Заявитель;
		НоваяСтрока.АдресРегистрации = Выборка.АдресРегистрации;
		НоваяСтрока.ДатаЗаявления =  Выборка.ДатаОткрытияДела;
		НоваяСтрока.Причина = Выборка.ПричинаКомиссии;
		НоваяСтрока.РешениеКомиссии = Выборка.РешениеКомиссииТекст;
	КонецЦикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКомиссию(Команда)
	ЗагрузитьКомиссиюНаСервере();
КонецПроцедуры

&НаСервере
Функция ПечатьСписокНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	Макет = Обработки.СписокНаКомиссию.ПолучитьМакет("ПФ_MXL_СписокНаКомиссию");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Шапка);
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
	Для Каждого СтрСписок из Объект.СписокКомиссия Цикл
		ОбластьСтрокаТаблицы.Параметры.ПП = СтрСписок.НомерСтроки;
		ОбластьСтрокаТаблицы.Параметры.ФИО = СтрСписок.ФИО;
		ОбластьСтрокаТаблицы.Параметры.Адрес = СтрСписок.АдресРегистрации;
		ОбластьСтрокаТаблицы.Параметры.ДатаЗаявления =Формат(СтрСписок.ДатаЗаявления,"ДФ=dd.MM.yyyy");
		ОбластьСтрокаТаблицы.Параметры.Причина = СтрСписок.Причина;
		ОбластьСтрокаТаблицы.Параметры.Решение = СтрСписок.РешениеКомиссии;
		ТабДок.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПечатьСписок(Команда)
	ТабДок = ПечатьСписокНаСервере();
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать("Список на комиссию");
КонецПроцедуры
