
&НаСервере
Процедура ЗаполнитьНаСервере()
	 Объект = ФИОРодственник.ПолучитьОбъект();
	 Для Каждого СтрокаСемьи из СоставСемьи Цикл
	 НоваяСтрока = Объект.СоставСемьи.Добавить();
	 НоваяСтрока.ФИО = СтрокаСемьи.ФИО;
	 НоваяСтрока.Родство = СтрокаСемьи.Родство;
	 КонецЦикла;
	 Объект.Записать();	 
	 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	Ответ = Вопрос("Закрыть форму. Продолжить?",РежимДиалогаВопрос.ДаНет);
 	Если Ответ = КодВозвратаДиалога.Да Тогда
		 ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ключ") Тогда
		  ФИОРодственник = Параметры.Ключ;
	КонецЕсли; 	
КонецПроцедуры
