#Область ПрограмныйИтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();	
	КомандаПечати.МенеджерПечати = "Документ.ЛичноеДело";
	КомандаПечати.Идентификатор = "РаспискаУведомления";
	КомандаПечати.МестоРазмещения = "ПодменюПечать";
	КомандаПечати.Представление = НСтр("ru = 'Расписка-Уведомление'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати2 = КомандыПечати.Добавить();	
	КомандаПечати2.МенеджерПечати = "Документ.ЛичноеДело";
	КомандаПечати2.Идентификатор = "КорешокНаКомиссию";
	КомандаПечати2.МестоРазмещения = "ПодменюПечать";
	КомандаПечати2.Представление = НСтр("ru = 'Корешок на комиссию'");
	КомандаПечати2.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати2 = КомандыПечати.Добавить();	
	КомандаПечати2.МенеджерПечати = "Документ.ЛичноеДело";
	КомандаПечати2.Идентификатор = "РешениеКомиссииВыписка";
	КомандаПечати2.МестоРазмещения = "ПодменюПечать";
	КомандаПечати2.Представление = НСтр("ru = 'Решение комиссии (Выписка)'");
	КомандаПечати2.ПроверкаПроведенияПередПечатью = Ложь;

	КомандаПечати3 = КомандыПечати.Добавить();	
	КомандаПечати3.МенеджерПечати = "Документ.ЛичноеДело";
	КомандаПечати3.Идентификатор = "ТитульныйЛистЛД";
	КомандаПечати3.МестоРазмещения = "ПодменюПечать";
	КомандаПечати3.Представление = НСтр("ru = 'Титульный лист (ЛИЧНОЕ ДЕЛО)'");
	КомандаПечати3.ПроверкаПроведенияПередПечатью = Ложь;
	//
	//КомандаПечати4 = КомандыПечати.Добавить();	
	//КомандаПечати4.МенеджерПечати = "Документ.ЛичноеДело";
	//КомандаПечати4.Идентификатор = "СправкаМС_Ребенок";
	//КомандаПечати4.МестоРазмещения = "ПодменюПечать";
	//КомандаПечати4.Представление = НСтр("ru = 'Справка многодетной семьи (Ребенок)'");
	//КомандаПечати4.ПроверкаПроведенияПередПечатью = Ложь;


КонецПроцедуры

Процедура Печать(МассивОбъектов,ПараметрыПечати,КоллекцияПечатныхФорм,ОбъектыПечати,ПараметрыВывода) Экспорт
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"РаспискаУведомления");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьРаспискаУведомлениеУтвержденная(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Печать расписка уведомления'");
        ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЛичноеДело.ПФ_MXL_Расписка_О_ПолученииДокументов";
	КонецЕсли;	
	
	ПечатнаяФорма2 = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"КорешокНаКомиссию");
	Если ПечатнаяФорма2 <> Неопределено Тогда
		ПечатнаяФорма2.ТабличныйДокумент = ПечатьКорешкаНаКомиссию(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма2.СинонимМакета = НСтр("ru = 'Корешок на комиссию'");
        ПечатнаяФорма2.ПолныйПутьКМакету = "Документ.ЛичноеДело.ПФ_MXL_Комиссия";
	КонецЕсли;

	ПечатнаяФорма3 = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"РешениеКомиссииВыписка");
	Если ПечатнаяФорма3 <> Неопределено Тогда
		ПечатнаяФорма3.ТабличныйДокумент = ПечатьРешениеКомиссииВыписка(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма3.СинонимМакета = НСтр("ru = 'Решение комиссии'");
        ПечатнаяФорма3.ПолныйПутьКМакету = "Документ.ЛичноеДело.ПФ_MXL_ВыпискаПоРешениюКомиссии";
	КонецЕсли;

	ПечатнаяФорма4 = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"ТитульныйЛистЛД");
	Если ПечатнаяФорма4 <> Неопределено Тогда
		ПечатнаяФорма4.ТабличныйДокумент = ПечатьТутильногогоЛистаЛичноеДело(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма4.СинонимМакета = НСтр("ru = 'Титульный лист (ЛИЧНОЕ ДЕЛО)'");
	    ПечатнаяФорма4.ПолныйПутьКМакету = "Документ.ЛичноеДело.ПФ_MXL_ТитульныйЛистЛичноеДело";
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

Функция ПечатьРаспискаУведомлениеУтвержденная(МассивОбъектов,ОбъектыПечати)
	 // Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_РУ";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛичноеДело.ПФ_MXL_Расписка_О_ПолученииДокументов");
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаДокумента.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.ЛичноеДело КАК ТаблицаДокумента
    |ГДЕ
    |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    
    //ПервыйДокумент = Истина;
    
    Пока Выборка.Следующий() Цикл
		
			Область = Макет.ПолучитьОбласть("Шапка");	
			Область.Параметры.Заявитель						 = Выборка.Ссылка.Заявитель;
		    Область.Параметры.НомерЗаявления   				 =  Выборка.Ссылка.НомерЗаявления;
			Область.Параметры.ДатаЗаявления   				 = Формат(Выборка.Ссылка.ДатаЗаявления,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			Область.Параметры.ДолжностноеЛицо 				 =  Выборка.Ссылка.Принял.Должность.Наименование  +" "+ Строка(ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка.Ссылка.Принял));
			Область.Параметры.ЗаявительИнициалы 			 = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка.Ссылка.Заявитель);
			Область.Параметры.КолДокументов 				 =   Выборка.Ссылка.СписокДокументовПредоставлено.Итог("КоличествоДокументов"); 
			Область.Параметры.КолЛистов 					 =   Выборка.Ссылка.СписокДокументовПредоставлено.Итог("КоличествоЛистов");
			ТабличныйДокумент.Вывести(Область);
				
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            , ОбъектыПечати, Выборка.Ссылка); //НомерСтрокиНачало

	КонецЦикла;

	Возврат ТабличныйДокумент;
	

КонецФункции	

// отключен 19.07.23
Функция ПечатьРаспискаУведомление(МассивОбъектов,ОбъектыПечати)
	// Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_РУ";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛичноеДело.ПФ_MXL_РаспискаУведомления");
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаДокумента.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.ЛичноеДело КАК ТаблицаДокумента
    |ГДЕ
    |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    
    //ПервыйДокумент = Истина;
    
    Пока Выборка.Следующий() Цикл
		
		//Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            //ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
       // КонецЕсли;
        //ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
      // НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		//Начало вывода документа
		//Для Каждого СтрокаТЧ Из  Выборка.Ссылка  Цикл
			Если Выборка.Ссылка.МногодетнаяСемья = Истина Тогда
				Область = Макет.ПолучитьОбласть("ШапкаМС");
			Иначе
				Область = Макет.ПолучитьОбласть("Шапка");
			КонецЕсли;	
			Область.Параметры.Заявитель = Выборка.Ссылка.Заявитель;
		    Область.Параметры.НомерЗаявления   =  Выборка.Ссылка.НомерЗаявления;
			Область.Параметры.ДатаЗаявления    =Формат(Выборка.Ссылка.ДатаЗаявления,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			ТабличныйДокумент.Вывести(Область);
		//КонецЦикла;
		//Конец вывода документа
		
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            , ОбъектыПечати, Выборка.Ссылка); //НомерСтрокиНачало

	КонецЦикла;

	Возврат ТабличныйДокумент;
	

КонецФункции

Функция ПечатьКорешкаНаКомиссию(МассивОбъектов,ОбъектыПечати)
	// Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Комиссия";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛичноеДело.ПФ_MXL_Комиссия");
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаДокумента.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.ЛичноеДело КАК ТаблицаДокумента
    |ГДЕ
    |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    
    ПервыйДокумент = Истина;
    
    Пока Выборка.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

				
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Специалист = Выборка.Ссылка.СпециалистКомиссия;
		Если   Выборка.Ссылка.Льгота = Истина Тогда
			Область.Параметры.ВидЛьготыВыплаты   =  Выборка.Ссылка.ВидыЛьготыШапка;
		КонецЕсли;
		Если   Выборка.Ссылка.Выплата = Истина Тогда
			Область.Параметры.ВидЛьготыВыплаты   =  Выборка.Ссылка.ВидыВыплатШапка;
		КонецЕсли;
		
		Область.Параметры.ПричинаКомиссии    = Выборка.Ссылка.ПричинаКомиссии;
		СписокДок = "";
		Для Каждого СтрокаДок из   Выборка.Ссылка.СписокДокументовПредоставлено  Цикл
			   СписокДок = СписокДок  + Строка(СтрокаДок.Документ) + "-"+Строка(СтрокаДок.КоличествоДокументов)+ "кол; ";
		КонецЦикла;	
		Область.Параметры.ПереченьДокументов = СписокДок;
		ТабличныйДокумент.Вывести(Область);
		
		СписокДокКомиссия = ""; 
		Если Выборка.Ссылка.ДокументыКомиссия.Количество()>0 Тогда 
			Для Каждого СтрокаДокКомиссия из   Выборка.Ссылка.ДокументыКомиссия Цикл
				СписокДокКомиссия = СписокДокКомиссия + Строка(СтрокаДокКомиссия.Документ) + "-"+Строка(СтрокаДокКомиссия.КоличествоДокументов) + "кол; ";
			КонецЦикла;
			Подвал1 =  Макет.ПолучитьОбласть("Подвал1");
			Подвал1.Параметры.ДокументыКомиссия = СписокДокКомиссия;
			ТабличныйДокумент.Вывести(Подвал1);
		Иначе	
			Подвал2 =  Макет.ПолучитьОбласть("Подвал2");
			ТабличныйДокумент.Вывести(Подвал2);

		КонецЕсли;
		
		
						
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            , ОбъектыПечати, Выборка.Ссылка); //НомерСтрокиНачало

	КонецЦикла;

	Возврат ТабличныйДокумент;
	

КонецФункции

Функция ПечатьРешениеКомиссииВыписка(МассивОбъектов,ОбъектыПечати)
	// Создаем табличный документ и устанавливаем имя параметров печати.
	Перем Секретарь;
	ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_КомиссияРешениеВыписка";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛичноеДело.ПФ_MXL_ВыпискаПоРешениюКомиссии");
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаСрезПоследних.ФИОСекретарьКомиссии КАК ФИОСекретарьКомиссии
		|ИЗ
		|	РегистрСведений.УчетнаяПолитика.СрезПоследних( ) КАК УчетнаяПолитикаСрезПоследних";
	
	//Запрос.УстановитьПараметр("ДатаЗаявления", ДатаЗаявления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Секретарь =  ВыборкаДетальныеЗаписи.ФИОСекретарьКомиссии;
	КонецЕсли;
	
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаДокумента.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.ЛичноеДело КАК ТаблицаДокумента
    |ГДЕ
    |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    
    ПервыйДокумент = Истина;
    
    Пока Выборка.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

				
		Область = Макет.ПолучитьОбласть("Выписка");
		Область.Параметры.НомерПротокола = Выборка.Ссылка.НомерПротокола;
				
		Область.Параметры.ДатаКомиссии    = Формат(Выборка.Ссылка.ДатаКомиссии,"ДФ=dd.MM.yyyy");
		Область.Параметры.РешениеКомиссииТекст = Выборка.Ссылка.РешениеКомиссииТекст;
		Область.Параметры.ДолжностьСекретаря  =  Секретарь.Должность;
		Область.Параметры.ФИОСекреларя = Секретарь;
		ТабличныйДокумент.Вывести(Область);
				
		
						
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            , ОбъектыПечати, Выборка.Ссылка); //НомерСтрокиНачало

	КонецЦикла;

	Возврат ТабличныйДокумент;
	

КонецФункции

Функция СформироватьПечатьСправкиМСРодители(МассивОбъектов)    Экспорт
	Перем ФИОРебенкаДР_1;
	Перем ФИОРебенкаДР_2;
	Перем ФИОРебенкаДР_3;
	Перем ФИОРебенкаДР_4;
	Перем ФИОРебенкаДР_5;
	Перем ФИОРебенкаДР_6;
	// Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_СМСР";
	
	Макет = ПолучитьОбщийМакет("ПФ_MXL_СправкаРодителейМногодетнойСемьи");// УправлениеПечатью.МакетПечатнойФормы("ОбщиеМакеты.ПФ_MXL_СправкаРодителейМногодетнойСемьи");
	
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаДокумента.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.ЛичноеДело КАК ТаблицаДокумента
    |ГДЕ
    |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    КолДети = 1;
    //ПервыйДокумент = Истина;
	Пока Выборка.Следующий() Цикл
		//ФамилияОтца = = "";
		//ИмяОтца = "";
		//ОтчествоОтца = "";

	    Для Каждого СтрокаТЧ Из  Выборка.Ссылка.ДокументыМС Цикл

			//Если (СтрокаТЧ.Родство  <> Справочники.Родство.супруг) ИЛИ  (СтрокаТЧ.Родство  <> Справочники.Родство.супруга) Тогда
			//	Продолжить;
			//КонецЕсли;	
			Область = Макет.ПолучитьОбласть("Лист1");
			Область.Параметры.Организация = Выборка.Ссылка.Организация.ПолноеНаименование;	
			//Область.Параметры.НомерСправки   =  СтрокаТЧ.СерияМС + " " +СтрокаТЧ.НомерМС;
			Если(СтрокаТЧ.Родство  = Справочники.Родство.супруга) ИЛИ (СтрокаТЧ.Родство  = Справочники.Родство.мать) Тогда
		    	ФамилияМатери    = СтрокаТЧ.ФизическоеЛицоМС.Фамилия;
				ИмяМатери     =   СтрокаТЧ.ФизическоеЛицоМС.Имя;
				ОтчествоМатери =  СтрокаТЧ.ФизическоеЛицоМС.Отчество;
				ДатаВывдачи   =  Формат(СтрокаТЧ.ДатаВыдачиМС,"ДФ='d MMMM yyyy ''г.'''"); 
			    СрокДействияПо = Формат(СтрокаТЧ.ДатаОкончанияМС,"ДЛФ=DD");
				НомерСправки   =  СтрокаТЧ.СерияМС + " " +СтрокаТЧ.НомерМС;
			КонецЕсли;
			Если (СтрокаТЧ.Родство  = Справочники.Родство.супруг) ИЛИ (СтрокаТЧ.Родство  = Справочники.Родство.отец) Тогда
				ФамилияОтца  = СтрокаТЧ.ФизическоеЛицоМС.Фамилия;
				ИмяОтца  = СтрокаТЧ.ФизическоеЛицоМС.Имя;
				ОтчествоОтца = СтрокаТЧ.ФизическоеЛицоМС.Отчество;
				ДатаВывдачи   =  Формат(СтрокаТЧ.ДатаВыдачиМС,"ДФ='d MMMM yyyy ''г.'''"); 
			    СрокДействияПо = Формат(СтрокаТЧ.ДатаОкончанияМС,"ДЛФ=DD");
				НомерСправки   =  СтрокаТЧ.СерияМС + " " +СтрокаТЧ.НомерМС;
			КонецЕсли;
						
		КонецЦикла;
			Область.Параметры.НомерСправки = НомерСправки;
		    Область.Параметры.ФамилияМатери   =  ФамилияМатери ;
			Область.Параметры.ИмяМатери       =  ИмяМатери;
			Область.Параметры.ОтчествоМатери  =  ОтчествоМатери;
			
			Область.Параметры.ФамилияОтца  = ФамилияОтца ;
			Область.Параметры.ИмяОтца  = ИмяОтца;
			Область.Параметры.ОтчествоОтца = ОтчествоОтца;
			
//			Область.Параметры.ДатаВывдачи   =  ДатаВывдачи; 
//			Область.Параметры.СрокДействияПо = СрокДействияПо;

			
		    ТабличныйДокумент.Вывести(Область);
   
			
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
	
	Для Каждого СтрокаТЧ Из  Выборка.Ссылка.ДокументыМС Цикл
		//Если (СтрокаТЧ.Родство  <> Справочники.Родство.дочь) ИЛИ  (СтрокаТЧ.Родство  <> Справочники.Родство.сын) Тогда
		//		Продолжить;
		//КонецЕсли;
		Область1 = Макет.ПолучитьОбласть("Лист2");
		Если (СтрокаТЧ.Родство  = Справочники.Родство.дочь) ИЛИ (СтрокаТЧ.Родство  = Справочники.Родство.сын) Тогда
			Если КолДети = 1 Тогда
				ФИОРебенкаДР_1 = Строка(СтрокаТЧ.ФизическоеЛицоМС) +" " +Строка(Формат(СтрокаТЧ.ДеньРожденияМС,"ДФ=dd.MM.yyyy"));
				КолДети = КолДети+1;
			ИначеЕсли КолДети = 2 Тогда 
				ФИОРебенкаДР_2 = Строка(СтрокаТЧ.ФизическоеЛицоМС) +" " + Строка(Формат(СтрокаТЧ.ДеньРожденияМС,"ДФ=dd.MM.yyyy"));
				КолДети = КолДети+1;
			ИначеЕсли КолДети = 3 Тогда
				ФИОРебенкаДР_3 = Строка(СтрокаТЧ.ФизическоеЛицоМС) +" " + Строка(Формат(СтрокаТЧ.ДеньРожденияМС,"ДФ=dd.MM.yyyy"));
				КолДети = КолДети+1;
			ИначеЕсли КолДети = 4 Тогда
				ФИОРебенкаДР_4 = Строка(СтрокаТЧ.ФизическоеЛицоМС) +" " + Строка(Формат(СтрокаТЧ.ДеньРожденияМС,"ДФ=dd.MM.yyyy"));
				КолДети = КолДети+1;
			ИначеЕсли КолДети = 5 Тогда
				ФИОРебенкаДР_5 = Строка(СтрокаТЧ.ФизическоеЛицоМС) + " " +Строка(Формат(СтрокаТЧ.ДеньРожденияМС,"ДФ=dd.MM.yyyy"));
				КолДети = КолДети+1;
			ИначеЕсли КолДети = 6 Тогда
				ФИОРебенкаДР_6 = Строка(СтрокаТЧ.ФизическоеЛицоМС) + " " +Строка(Формат(СтрокаТЧ.ДеньРожденияМС,"ДФ=dd.MM.yyyy"));
				КолДети = КолДети+1;
			КонецЕсли;	
		КонецЕсли;
			КонецЦикла;	
		
				Область1.Параметры.ФИОРебенкаДР_1 = ФИОРебенкаДР_1;
				Область1.Параметры.ФИОРебенкаДР_2 = ФИОРебенкаДР_2;
				Область1.Параметры.ФИОРебенкаДР_3 = ФИОРебенкаДР_3;
				Область1.Параметры.ФИОРебенкаДР_4 = ФИОРебенкаДР_4;
				Область1.Параметры.ФИОРебенкаДР_5 = ФИОРебенкаДР_5;
				Область1.Параметры.ФИОРебенкаДР_6 = ФИОРебенкаДР_6;
			
		ТабличныйДокумент.Вывести(Область1);

    КонецЦикла;
	//ТабличныйДокумент.РазмерСтраницы = "A5";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;

	ЕстьПечать = ТабличныйДокумент.Области.Количество()> 0;
	Возврат ?(ЕстьПечать,ТабличныйДокумент,Неопределено);
    //Возврат  ТабличныйДокумент;
КонецФункции


Функция СформироватьПечатьСправкиМСРебенок(МассивОбъектов)    Экспорт
	  ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_СМР";
	
	Макет = ПолучитьОбщийМакет("ПФ_MXL_СправкаРебенокМногодетнойСемьи");
	
	Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаДокумента.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.ЛичноеДело КАК ТаблицаДокумента
    |ГДЕ
    |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    КолДети = 1;
    //ПервыйДокумент = Истина;
	Пока Выборка.Следующий() Цикл
	    Для Каждого СтрокаТЧ Из  Выборка.Ссылка.ДокументыМС Цикл
			Область = Макет.ПолучитьОбласть("Лист1");
			Область.Параметры.Организация = Выборка.Ссылка.Организация.ПолноеНаименование;	
			Если((СтрокаТЧ.Родство  = Справочники.Родство.дочь) ИЛИ (СтрокаТЧ.Родство  = Справочники.Родство.сын)) И (ОбщегоНазначенияКлиентСервер.ВычислитьВозраст(СтрокаТЧ.ДеньРожденияМС) >= 6) Тогда
		    	Фамилия    = СтрокаТЧ.ФизическоеЛицоМС.Фамилия;
				Имя     =   СтрокаТЧ.ФизическоеЛицоМС.Имя;
				Отчество =  СтрокаТЧ.ФизическоеЛицоМС.Отчество;
				ДатаВывдачи   =  Формат(СтрокаТЧ.ДатаВыдачиМС,"ДФ='d MM yyyy ''г.'''"); 
			    СрокДействияПо = Формат(СтрокаТЧ.ДатаОкончанияМС,"ДЛФ=DD");
				НомерСправки   =  СтрокаТЧ.СерияМС + " " +СтрокаТЧ.НомерМС;
				Область.Параметры.НомерСправки = НомерСправки;
		    	Область.Параметры.Фамилия   =  Фамилия ;
				Область.Параметры.Имя       =  Имя;
				Область.Параметры.Отчество  =  Отчество;			
				//Область.Параметры.ДатаВывдачи     =  ДатаВывдачи; 
				//Область.Параметры.СрокДействияПо  = СрокДействияПо;

			
		    	ТабличныйДокумент.Вывести(Область);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				Область1 = Макет.ПолучитьОбласть("Лист2");
				ТабличныйДокумент.Вывести(Область1);
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	//ТабличныйДокумент.РазмерСтраницы = "A5";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабличныйДокумент.АвтоМасштаб = Истина;
	ЕстьПечать = ТабличныйДокумент.Области.Количество()> 0;
	Возврат ?(ЕстьПечать,ТабличныйДокумент,Неопределено);

 КонецФункции	
 
Функция ПечатьТутильногогоЛистаЛичноеДело(МассивОбъектов,ОбъектыПечати) Экспорт
	   // Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ТЛ";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛичноеДело.ПФ_MXL_ТитульныйЛистЛичноеДело");
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаДокумента.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.ЛичноеДело КАК ТаблицаДокумента
    |ГДЕ
    |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    
    //ПервыйДокумент = Истина;
    
    Пока Выборка.Следующий() Цикл
		
			Область = Макет.ПолучитьОбласть("Шапка");	
			Область.Параметры.Заявитель						 = Выборка.Ссылка.Заявитель;
		    Область.Параметры.НаименованиеОрганизации   	 =  Выборка.Ссылка.Организация;
			Область.Параметры.ДатаЗаявления   				 = Формат(Выборка.Ссылка.ДатаЗаявления,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			Область.Параметры.ДатаЗакрытияДела   			 = Формат(Выборка.Ссылка.ДатаЗакрытияДела,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			Если Выборка.Ссылка.АдресФактПроживанияИПропискаСовпадают Тогда 
				Область.Параметры.АдресРегистрации 				 =  Выборка.Ссылка.АдресПрописка ;
			Иначе
				Область.Параметры.АдресРегистрации 				 =  Выборка.Ссылка.АдресПрописка +" ("+Выборка.Ссылка.АдресФактическогоПроживания+")";
			КонецЕсли;	
			Если (Выборка.Ссылка.МногодетнаяСемья)   Тогда
				Область.Параметры.МераСоциальнойПодержки	 = Выборка.Ссылка.ЛьготнаяКатегория;
			Иначе	
				Область.Параметры.МераСоциальнойПодержки	 = Выборка.Ссылка.ВидыЛьготыШапка;
			КонецЕсли;
			Область.Параметры.НомерТелефона 				 =  Выборка.Ссылка.НомерТелефона;
			ТабличныйДокумент.Вывести(Область);
				
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            , ОбъектыПечати, Выборка.Ссылка); //НомерСтрокиНачало

	КонецЦикла;

	Возврат ТабличныйДокумент;
	

КонецФункции 	

Функция СформироватьПечатьОписьДокументов(МассивОбъектов) Экспорт
	// Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ОД";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛичноеДело.ПФ_MXL_ОписьДокументов");	
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаДокумента.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.ЛичноеДело КАК ТаблицаДокумента
    |ГДЕ
    |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    Область = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(Область);
	Пока Выборка.Следующий() Цикл
		 Для Каждого СтрокаТЧ Из  Выборка.Ссылка.СписокДокументовПредоставлено Цикл
			  Область2 = Макет.ПолучитьОбласть("Строка");
			  Область2.Параметры.П_П = СтрокаТЧ.НомерСтроки; 
			  Если ЗначениеЗаполнено( СтрокаТЧ.Описание) Тогда
				  Область2.Параметры.НаименованиеДокументов = Строка(СтрокаТЧ.Документ)+" ("+Строка(СтрокаТЧ.Описание)+")";	  
			  Иначе	  
				  Область2.Параметры.НаименованиеДокументов = СтрокаТЧ.Документ;
			  КонецЕсли;
			  Область2.Параметры.КоличествоЛистов = СтрокаТЧ.КоличествоЛистов;
			  ТабличныйДокумент.Вывести(Область2);
		 КонецЦикла;	 
	КонецЦикла;
	Область3 = Макет.ПолучитьОбласть("Подвал");
	Область3.Параметры.ВсегоКолДокументов  = Выборка.Ссылка.СписокДокументовПредоставлено.Итог("КоличествоДокументов");	
	Область3.Параметры.ВсегоКоличествоЛистов  = Выборка.Ссылка.СписокДокументовПредоставлено.Итог("КоличествоЛистов");
	ТабличныйДокумент.Вывести(Область3);
	
	
	ЕстьПечать = ТабличныйДокумент.Области.Количество()> 0; 
	Возврат ?(ЕстьПечать,ТабличныйДокумент,Неопределено);
КонецФункции	

Функция СформироватьПечатьДниРожденияДетей(МассивОбъектов) Экспорт
	ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ДРД";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛичноеДело.ПФ_MXL_ДниРожденияДетейСписок");	
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаДокумента.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.ЛичноеДело КАК ТаблицаДокумента
    |ГДЕ
    |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	Пока Выборка.Следующий() Цикл
		Для Каждого СтрокаТЧ Из  Выборка.Ссылка.ДокументыМС Цикл
			  Если (СтрокаТЧ.Родство = ПредопределенноеЗначение("Справочник.Родство.сын"))ИЛИ (СтрокаТЧ.Родство = ПредопределенноеЗначение("Справочник.Родство.дочь"))Тогда
			  	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	          	ОбластьСтрока.Параметры.ФизическоеЛицоМС  =  СтрокаТЧ.ФизическоеЛицоМС;
			  	ОбластьСтрока.Параметры.Родство = СтрокаТЧ.Родство;
			  	ОбластьСтрока.Параметры.ДеньРожденияМС = Формат(СтрокаТЧ.ДеньРожденияМС,"ДФ=dd.MM.yyyy");
			  	ОбластьСтрока.Параметры.ДеньРожденияМС_6  = Формат(ОбщегоНазначенияКлиентСервер.ДобавитьКолЛетКДате(СтрокаТЧ.ДеньРожденияМС,6),"ДФ=dd.MM.yyyy");
			  	ОбластьСтрока.Параметры.ДеньРожденияМС_14 = Формат(ОбщегоНазначенияКлиентСервер.ДобавитьКолЛетКДате(СтрокаТЧ.ДеньРожденияМС,14),"ДФ=dd.MM.yyyy");
			  	ОбластьСтрока.Параметры.ДеньРожденияМС_18 = Формат(ОбщегоНазначенияКлиентСервер.ДобавитьКолЛетКДате(СтрокаТЧ.ДеньРожденияМС,18),"ДФ=dd.MM.yyyy");
			  	Если СтрокаТЧ.Отметка Тогда
			  		ОбластьСтрока.Параметры.Отметка = СтрокаТЧ.Отметка;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьСтрока);
		  	  КонецЕсли;
		 
		КонецЦикла;
	КонецЦикла;	
	ЕстьПечать = ТабличныйДокумент.Области.Количество()> 0; 
	Возврат ?(ЕстьПечать,ТабличныйДокумент,Неопределено);

КонецФункции	

