Функция ПроверкаНаНаличияДокументаМногодетнойСемьи()
	  		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ФИО
		|ИЗ
		|	Документ.ЛичноеДело КАК ЛичноеДело
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Документы КАК ФизическиеЛицаДокументы
		|		ПО ЛичноеДело.Заявитель = ФизическиеЛицаДокументы.Ссылка
		|ГДЕ
		|	ЛичноеДело.Ссылка = &Ссылка
		|	И ФизическиеЛицаДокументы.Наименование = ЗНАЧЕНИЕ(Справочник.ДокументыПоВидам.УдостоверениеМногодетнойМатери)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если  Выборка.Следующий() Тогда
		Возврат Выборка.ФИО;
	КонецЕсли;
	
	Возврат Ложь;
	

КонецФункции	
Функция ПроверкаНаСупругов()
	 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ФИО
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Документы КАК ФизическиеЛицаДокументы
		|		ПО ЛичноеДелоСоставСемьи.ФИО = ФизическиеЛицаДокументы.Ссылка
		|ГДЕ
		|	ФизическиеЛицаДокументы.Наименование = ЗНАЧЕНИЕ(Справочник.ДокументыПоВидам.УдостоверениеМногодетнойМатери)
		|	И ЛичноеДелоСоставСемьи.Ссылка = &Ссылка
		|	И (ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.Супруга)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.супруг))";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ФИО;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		// Заполнение шапки
			
			КолСемья = 1; 
			АдресПрописка = ДанныеЗаполнения.АдресПрописка;
			АдресФактическогоПроживания = ДанныеЗаполнения.АдресФактическогоПроживания;
			АдресФактПроживанияИПропискаСовпадают = ДанныеЗаполнения.АдресФактПроживанияИПропискаСовпадают;
			СельскийСовет = ДанныеЗаполнения.СельскийСовет;
			Заявитель = ДанныеЗаполнения.Ссылка;
			НомерТелефона = ДанныеЗаполнения.НомерТелефона;
		Для Каждого ТекСтрокаСоставСемьи Из ДанныеЗаполнения.СоставСемьи Цикл
			НоваяСтрока = СоставСемьи.Добавить();
			НоваяСтрока.Родство = ТекСтрокаСоставСемьи.Родство;
			НоваяСтрока.ФИО = ТекСтрокаСоставСемьи.ФИО;
			КолСемья = КолСемья + 1;
		КонецЦикла;
		Для Каждого ТекСтрока Из ДанныеЗаполнения.ЛьготныеКатегории Цикл
			ЛьготнаяКатегория = ТекСтрока.Категория;
			Группа = ТекСтрока.Группа;
		КонецЦикла;
			 
		    СоставСемьиКоличество = КолСемья;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроводимКомиссияРегистрСведений();
	// регистр ЛичноеДелоКомиссия
	Движения.ЛичноеДелоКомиссия.Записывать = Истина;
	Движение = Движения.ЛичноеДелоКомиссия.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.ВидЛьготы = ВидыЛьготыШапка;
	Движение.ВидВыплаты = ВидыВыплатШапка;
	Движение.Сотрудник = СпециалистКомиссия;
	Движение.Заявитель = Заявитель;
	Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
	Движение.СельскийСовет = СельскийСовет;
	Движение.НомерДела = НомерЗаявления;
	Движение.ДатаОткрытияДела = ДатаЗаявления;
	Движение.ПричинаКомиссии = ПричинаКомиссии;
	Движение.ДатаКомиссии = ДатаКомиссии;
	Движение.НомерПротокола = НомерПротокола;
	Движение.ДатаИсполненияРешенияКомиссии = ДатаИсполненияРешенияКомиссии;
	Движение.РешениеКомиссииТекст = РешениеКомиссииТекст;
	Движение.Решение = Решение;
	Если  ЗначениеЗаполнено(Решение) Тогда
		Движение.Закрыто = Истина;
	КонецЕсли;
	Движение.АдресРегистрации = АдресПрописка;
	
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, Режим)
	Если ДокПроводить Тогда  
		ДвижениеПоРегистрамСведений();
		Если  ЗначениеЗаполнено(Решение) И ЗначениеЗаполнено(РешениеКомиссииТекст) Тогда
			ПроводимКомиссияРегистрСведений();		
		КонецЕсли;
	
	Иначе
		Если  ЗначениеЗаполнено(Решение) И ЗначениеЗаполнено(РешениеКомиссииТекст) Тогда
			ПроводимКомиссияРегистрСведений();		
		КонецЕсли;	
		Если Решение = Перечисления.Решение.Отказ Тогда
			Если Льгота = Истина Тогда 
				ПроводимОтказЛьгота();
			КонецЕсли;		
		ИначеЕсли (Комиссия = Истина) И (Льгота = Истина) Тогда
			ПроводимКомиссияЛьготы();
			ПроводимКомиссияРегистрСведений();
		
		Иначе	
		Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерТалона) Тогда
		ЗаписьНомераТалонаВРегистр();
	КонецЕсли;
КонецПроцедуры

	
Процедура МногодетнаяСемьяСтарое()
	
	ДокументМС = ПроверкаНаНаличияДокументаМногодетнойСемьи();
	СупругМС = ПроверкаНаСупругов();
	//Отказ = Ложь;
	Движения.МногодетныеСемьиУчет.Записывать=Истина;
	Если ДокументМС И СупругМС Тогда 
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДело.Заявитель 																		КАК ФИО,
		|	ВЫБОР
		|		КОГДА ЛичноеДело.Заявитель.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
		|			ТОГДА ""отец""
		|		ИНАЧЕ ""мать""
		|	КОНЕЦ 																						КАК Родство,
		|	ФизическиеЛицаДокументы.Наименование 														КАК Наименование,
		|	ФизическиеЛицаДокументы.Серия 																КАК Серия,
		|	ФизическиеЛицаДокументы.Номер 																КАК Номер,
		|	ФизическиеЛицаДокументы.ДатаВыдачи 															КАК ДатаВыдачи,
		|	ФизическиеЛицаДокументы.ДатаОкончания 														КАК ДатаОкончания
		|ПОМЕСТИТЬ Заявитель
		|ИЗ
		|	Документ.ЛичноеДело КАК ЛичноеДело
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Документы КАК ФизическиеЛицаДокументы
		|		ПО ЛичноеДело.Заявитель = ФизическиеЛицаДокументы.Ссылка
		|ГДЕ
		|	ЛичноеДело.Ссылка = &Ссылка
		|	И ФизическиеЛицаДокументы.Наименование = ЗНАЧЕНИЕ(Справочник.ДокументыПоВидам.УдостоверениеМногодетнойМатери)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичноеДелоСоставСемьи.ФИО КАК ФИО,
		|	ВЫБОР
		|		КОГДА ЛичноеДелоСоставСемьи.ФИО.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
		|			ТОГДА ""отец""
		|		ИНАЧЕ ""мать""
		|	КОНЕЦ КАК Родство,
		|	ФизическиеЛицаДокументы.Наименование КАК Наименование,
		|	ФизическиеЛицаДокументы.Серия КАК Серия,
		|	ФизическиеЛицаДокументы.Номер КАК Номер,
		|	ФизическиеЛицаДокументы.ДатаВыдачи КАК ДатаВыдачи,
		|	ФизическиеЛицаДокументы.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ Супруг
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Документы КАК ФизическиеЛицаДокументы
		|		ПО ЛичноеДелоСоставСемьи.ФИО = ФизическиеЛицаДокументы.Ссылка
		|ГДЕ
		|	ФизическиеЛицаДокументы.Наименование = ЗНАЧЕНИЕ(Справочник.ДокументыПоВидам.УдостоверениеМногодетнойМатери)
		|	И ЛичноеДелоСоставСемьи.Ссылка = &Ссылка
		|	И (ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.Супруга)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.супруг))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичноеДелоСоставСемьи.ФИО КАК ФИО,
		|	ЛичноеДелоСоставСемьи.Родство КАК Родство,
		|	ФизическиеЛицаДокументы.Наименование КАК Наименование,
		|	ФизическиеЛицаДокументы.Серия КАК Серия,
		|	ФизическиеЛицаДокументы.Номер КАК Номер,
		|	ФизическиеЛицаДокументы.ДатаВыдачи КАК ДатаВыдачи,
		|	ФизическиеЛицаДокументы.ДатаОкончания КАК ДатаОкончания,
		|	Заявитель.ФИО КАК РодительФИО1,
		|	Заявитель.Родство КАК РодительРодство1,
		|	Заявитель.Наименование КАК РодствоНаименование1,
		|	Заявитель.Серия КАК РодительСерия1,
		|	Заявитель.Номер КАК РодительНомер1,
		|	Заявитель.ДатаВыдачи КАК РодительДатаВыдачи1,
		|	Заявитель.ДатаОкончания КАК РодительДатаОкончания1,
		|	Супруг.ФИО КАК РодительФИО2,
		|	Супруг.Родство КАК РодительРодство2,
		|	Супруг.Наименование КАК РодительНаименование2,
		|	Супруг.Серия КАК РодительСерия2,
		|	Супруг.Номер КАК РодительНомер2,
		|	Супруг.ДатаВыдачи КАК РодительДатаВыдачи2,
		|	Супруг.ДатаОкончания КАК РодительДатаОкончания2
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Документы КАК ФизическиеЛицаДокументы
		|		ПО ЛичноеДелоСоставСемьи.ФИО = ФизическиеЛицаДокументы.Ссылка,
		|	Заявитель КАК Заявитель,
		|	Супруг КАК Супруг
		|ГДЕ
		|	ФизическиеЛицаДокументы.Наименование = ЗНАЧЕНИЕ(Справочник.ДокументыПоВидам.УдостоверениеМногодетнойМатери)
		|	И ЛичноеДелоСоставСемьи.Ссылка = &Ссылка
		|	И НЕ(ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.Супруга)
		|				ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.супруг))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛичноеДелоСоставСемьи.ФИО,
		|	ЛичноеДелоСоставСемьи.Родство,
		|	"""",
		|	"""",
		|	"""",
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
		|	Заявитель.ФИО,
		|	Заявитель.Родство,
		|	Заявитель.Наименование,
		|	Заявитель.Серия,
		|	Заявитель.Номер,
		|	Заявитель.ДатаВыдачи,
		|	Заявитель.ДатаОкончания,
		|	Супруг.ФИО,
		|	Супруг.Родство,
		|	Супруг.Наименование,
		|	Супруг.Серия,
		|	Супруг.Номер,
		|	Супруг.ДатаВыдачи,
		|	Супруг.ДатаОкончания
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи,
		|	Заявитель КАК Заявитель,
		|	Супруг КАК Супруг
		|ГДЕ
		|	ЛичноеДелоСоставСемьи.Ссылка = &Ссылка
		|	И НЕ ЛичноеДелоСоставСемьи.ФИО В
		|				(ВЫБРАТЬ
		|					ЛичноеДелоСоставСемьи.ФИО КАК ФИО
		|				ИЗ
		|					Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Документы КАК ФизическиеЛицаДокументы
		|						ПО
		|							ЛичноеДелоСоставСемьи.ФИО = ФизическиеЛицаДокументы.Ссылка
		|				ГДЕ
		|					ФизическиеЛицаДокументы.Наименование = ЗНАЧЕНИЕ(Справочник.ДокументыПоВидам.УдостоверениеМногодетнойМатери)
		|					И ЛичноеДелоСоставСемьи.Ссылка = &Ссылка)
		|	И (ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.дочь)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.сын))";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
				
		Выборка = РезультатЗапроса.Выбрать();
		Движения.МногодетныеСемьиУчет.Записывать=Истина;		
		Секунда = 1;
		Пока Выборка.Следующий() Цикл
			     
				Движение = Движения.МногодетныеСемьиУчет.Добавить();
				
				Движение.Период = ДатаЗаявления+Секунда;
				Движение.Регистратор = Ссылка;
				Движение.Организация = Организация;
				Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
				Движение.Заявитель = Выборка.РодительФИО1;
				Движение.РебенокФИО = Выборка.ФИО;
				Движение.РебенокДатаРождения = Выборка.ФИО.ДатаРождения;
				Движение.РебенокИНН =  Выборка.ФИО.ИНН;
				Движение.РебенокНаличиеФункциональныхОграничений = Выборка.ФИО.НаличиеФункциональныхОграничений;
				Движение.РебенокУдостоверениеСерия   = Выборка.Серия;
				Движение.РебенокУдостоверениеНомер = Выборка.Номер;
				Движение.РебенокУдостоверениеДатаВыдачи = Выборка.ДатаВыдачи;
				Движение.РебенокУдостоверениеДатаНачалоДействия = Выборка.ДатаВыдачи;
				Движение.РебенокУдостоверениеДатаОкончанияДействия = Выборка.ДатаОкончания;
				
				Если Выборка.РодительРодство1 = "отец"  Тогда
					Движение.ОтецФИО = Выборка.РодительФИО1;
					Движение.ОтецИНН = Выборка.РодительФИО1.ИНН;
					Движение.ОтецКонтактныйТелефон = Выборка.РодительФИО1.НомерТелефона;
					Движение.ОтецДатаРождения = Выборка.РодительФИО1.ДатаРождения;
					Движение.ОтецМестоПроживания = Выборка.РодительФИО1.АдресФактическогоПроживания;
					Движение.ОтецМестоРегистрации = Выборка.РодительФИО1.АдресПрописка;
					Движение.ОтецНаличиеФункциональныхОграничений = Выборка.РодительФИО1.НаличиеФункциональныхОграничений;
					Движение.ОтецСемейноеПоложение =Выборка.РодительФИО1.СемейноеПоложение;
					Движение.ОтецГдеРаботает = Выборка.РодительФИО1.ГдеРаботает;
					Движение.ОтецДокумент = Выборка.РодствоНаименование1;
					Движение.ОтецДокументСерия =Выборка.РодительСерия1;
					Движение.ОтецДокументНомер =Выборка.РодительНомер1;
					Движение.ОтецДокументДатаВыдачи =Выборка.РодительДатаВыдачи1;
					Движение.ОтецДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи1;
					Движение.ОтецДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания1;
					
					Движение.МатьФИО = Выборка.РодительФИО2;
					Движение.МатьИНН = Выборка.РодительФИО2.ИНН;
					Движение.МатьКонтактныйТелефон = Выборка.РодительФИО2.НомерТелефона;
					Движение.МатьДатаРождения = Выборка.РодительФИО2.ДатаРождения;
					Движение.МатьМестоПроживания = Выборка.РодительФИО2.АдресФактическогоПроживания;
					Движение.МатьМестоРегистрации = Выборка.РодительФИО2.АдресПрописка;
					Движение.МатьНаличиеФункциональныхОграничений = Выборка.РодительФИО2.НаличиеФункциональныхОграничений;
					Движение.МатьСемейноеПоложение =Выборка.РодительФИО2.СемейноеПоложение;
					Движение.МатьГдеРаботает = Выборка.РодительФИО2.ГдеРаботает;
					Движение.МатьДокумент = Выборка.РодительНаименование2;
					Движение.МатьДокументСерия =Выборка.РодительСерия2;
					Движение.МатьДокументНомер =Выборка.РодительНомер2;
					Движение.МатьДокументДатаВыдачи =Выборка.РодительДатаВыдачи2;
					Движение.МатьДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи2;
					Движение.МатьДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания2;

				КонецЕсли;
				Если Выборка.РодительРодство1 = "мать"  Тогда

					Движение.МатьФИО = Выборка.РодительФИО1;
					Движение.МатьИНН = Выборка.РодительФИО1.ИНН;
					Движение.МатьКонтактныйТелефон = Выборка.РодительФИО1.НомерТелефона;
					Движение.МатьДатаРождения = Выборка.РодительФИО1.ДатаРождения;
					Движение.МатьМестоПроживания = Выборка.РодительФИО1.АдресФактическогоПроживания;
					Движение.МатьМестоРегистрации = Выборка.РодительФИО1.АдресПрописка;
					Движение.МатьНаличиеФункциональныхОграничений = Выборка.РодительФИО1.НаличиеФункциональныхОграничений;
					Движение.МатьСемейноеПоложение =Выборка.РодительФИО1.СемейноеПоложение;
					Движение.МатьГдеРаботает = Выборка.РодительФИО1.ГдеРаботает;
					Движение.МатьДокумент = Выборка.РодствоНаименование1;
					Движение.МатьДокументСерия =Выборка.РодительСерия1;
					Движение.МатьДокументНомер =Выборка.РодительНомер1;
					Движение.МатьДокументДатаВыдачи =Выборка.РодительДатаВыдачи1;
					Движение.МатьДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи1;
					Движение.МатьДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания1;

					
					Движение.ОтецФИО = Выборка.РодительФИО2;
					Движение.ОтецИНН = Выборка.РодительФИО2.ИНН;
					Движение.ОтецКонтактныйТелефон = Выборка.РодительФИО2.НомерТелефона;
					Движение.ОтецДатаРождения = Выборка.РодительФИО2.ДатаРождения;
					Движение.ОтецМестоПроживания = Выборка.РодительФИО2.АдресФактическогоПроживания;
					Движение.ОтецМестоРегистрации = Выборка.РодительФИО2.АдресПрописка;	
					Движение.ОтецНаличиеФункциональныхОграничений = Выборка.РодительФИО2.НаличиеФункциональныхОграничений;
					Движение.ОтецСемейноеПоложение =Выборка.РодительФИО2.СемейноеПоложение;
					Движение.ОтецГдеРаботает = Выборка.РодительФИО2.ГдеРаботает;
					Движение.ОтецДокумент = Выборка.РодительНаименование2;
					Движение.ОтецДокументСерия =Выборка.РодительСерия2;
					Движение.ОтецДокументНомер =Выборка.РодительНомер2;
					Движение.ОтецДокументДатаВыдачи =Выборка.РодительДатаВыдачи2;
					Движение.ОтецДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи2;
					Движение.ОтецДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания2;
				КонецЕсли;
				Секунда = Секунда + 1;
		КонецЦикла;

	КонецЕсли;
	
	Если ДокументМС = ИСТИНА И СупругМС = ЛОЖЬ Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДело.Заявитель КАК ФИО,
		|	ВЫБОР
		|		КОГДА ЛичноеДело.Заявитель.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
		|			ТОГДА ""отец""
		|		ИНАЧЕ ""мать""
		|	КОНЕЦ КАК Родство,
		|	ФизическиеЛицаДокументы.Наименование КАК Наименование,
		|	ФизическиеЛицаДокументы.Серия КАК Серия,
		|	ФизическиеЛицаДокументы.Номер КАК Номер,
		|	ФизическиеЛицаДокументы.ДатаВыдачи КАК ДатаВыдачи,
		|	ФизическиеЛицаДокументы.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ Заявитель
		|ИЗ
		|	Документ.ЛичноеДело КАК ЛичноеДело
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Документы КАК ФизическиеЛицаДокументы
		|		ПО ЛичноеДело.Заявитель = ФизическиеЛицаДокументы.Ссылка
		|ГДЕ
		|	ЛичноеДело.Ссылка = &Ссылка
		|	И ФизическиеЛицаДокументы.Наименование = ЗНАЧЕНИЕ(Справочник.ДокументыПоВидам.УдостоверениеМногодетнойМатери)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичноеДелоСоставСемьи.ФИО КАК ФИО,
		|	ЛичноеДелоСоставСемьи.Родство КАК Родство,
		|	ФизическиеЛицаДокументы.Наименование КАК Наименование,
		|	ФизическиеЛицаДокументы.Серия КАК Серия,
		|	ФизическиеЛицаДокументы.Номер КАК Номер,
		|	ФизическиеЛицаДокументы.ДатаВыдачи КАК ДатаВыдачи,
		|	ФизическиеЛицаДокументы.ДатаОкончания КАК ДатаОкончания,
		|	Заявитель.ФИО КАК РодительФИО1,
		|	Заявитель.Родство КАК РодительРодство1,
		|	Заявитель.Наименование КАК РодствоНаименование1,
		|	Заявитель.Серия КАК РодительСерия1,
		|	Заявитель.Номер КАК РодительНомер1,
		|	Заявитель.ДатаВыдачи КАК РодительДатаВыдачи1,
		|	Заявитель.ДатаОкончания КАК РодительДатаОкончания1
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Документы КАК ФизическиеЛицаДокументы
		|		ПО ЛичноеДелоСоставСемьи.ФИО = ФизическиеЛицаДокументы.Ссылка,
		|	Заявитель КАК Заявитель
		|ГДЕ
		|	ФизическиеЛицаДокументы.Наименование = ЗНАЧЕНИЕ(Справочник.ДокументыПоВидам.УдостоверениеМногодетнойМатери)
		|	И ЛичноеДелоСоставСемьи.Ссылка = &Ссылка
		|	И (ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.дочь)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.сын))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛичноеДелоСоставСемьи.ФИО,
		|	ЛичноеДелоСоставСемьи.Родство,
		|	"""",
		|	"""",
		|	"""",
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
		|	Заявитель.ФИО,
		|	Заявитель.Родство,
		|	Заявитель.Наименование,
		|	Заявитель.Серия,
		|	Заявитель.Номер,
		|	Заявитель.ДатаВыдачи,
		|	Заявитель.ДатаОкончания
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи,
		|	Заявитель КАК Заявитель
		|ГДЕ
		|	ЛичноеДелоСоставСемьи.Ссылка = &Ссылка
		|	И НЕ ЛичноеДелоСоставСемьи.ФИО В
		|				(ВЫБРАТЬ
		|					ЛичноеДелоСоставСемьи.ФИО КАК ФИО
		|				ИЗ
		|					Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Документы КАК ФизическиеЛицаДокументы
		|						ПО
		|							ЛичноеДелоСоставСемьи.ФИО = ФизическиеЛицаДокументы.Ссылка
		|				ГДЕ
		|					ФизическиеЛицаДокументы.Наименование = ЗНАЧЕНИЕ(Справочник.ДокументыПоВидам.УдостоверениеМногодетнойМатери)
		|					И ЛичноеДелоСоставСемьи.Ссылка = &Ссылка)
		|	И (ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.дочь)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.сын))";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Секунда = 1;
		Пока Выборка.Следующий() Цикл
			Движение = Движения.МногодетныеСемьиУчет.Добавить();
			
			Движение.Период = ДатаЗаявления+Секунда;
			Движение.Регистратор = Ссылка;
			Движение.Организация = Организация;
			Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
			Движение.Заявитель = Выборка.РодительФИО1;
			Движение.РебенокФИО = Выборка.ФИО;
			Движение.РебенокДатаРождения = Выборка.ФИО.ДатаРождения;
			Движение.РебенокИНН =  Выборка.ФИО.ИНН;
			Движение.РебенокНаличиеФункциональныхОграничений = Выборка.ФИО.НаличиеФункциональныхОграничений;
			Движение.РебенокУдостоверениеСерия   = Выборка.Серия;
			Движение.РебенокУдостоверениеНомер = Выборка.Номер;
			Движение.РебенокУдостоверениеДатаВыдачи = Выборка.ДатаВыдачи;
			Движение.РебенокУдостоверениеДатаНачалоДействия = Выборка.ДатаВыдачи;
			Движение.РебенокУдостоверениеДатаОкончанияДействия = Выборка.ДатаОкончания;
			
			Если Выборка.РодительРодство1 = "отец"  Тогда
				Движение.ОтецФИО = Выборка.РодительФИО1;
				Движение.ОтецИНН = Выборка.РодительФИО1.ИНН;
				Движение.ОтецКонтактныйТелефон = Выборка.РодительФИО1.НомерТелефона;
				Движение.ОтецДатаРождения = Выборка.РодительФИО1.ДатаРождения;
				Движение.ОтецМестоПроживания = Выборка.РодительФИО1.АдресФактическогоПроживания;
				Движение.ОтецМестоРегистрации = Выборка.РодительФИО1.АдресПрописка;
				Движение.ОтецНаличиеФункциональныхОграничений = Выборка.РодительФИО1.НаличиеФункциональныхОграничений;
				Движение.ОтецСемейноеПоложение =Выборка.РодительФИО1.СемейноеПоложение;
				Движение.ОтецГдеРаботает = Выборка.РодительФИО1.ГдеРаботает;
				Движение.ОтецДокумент = Выборка.РодствоНаименование1;
				Движение.ОтецДокументСерия =Выборка.РодительСерия1;
				Движение.ОтецДокументНомер =Выборка.РодительНомер1;
				Движение.ОтецДокументДатаВыдачи =Выборка.РодительДатаВыдачи1;
				Движение.ОтецДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи1;
				Движение.ОтецДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания1;
				
				Движение.МатьФИО = Выборка.РодительФИО2;
				Движение.МатьИНН = Выборка.РодительФИО2.ИНН;
				Движение.МатьКонтактныйТелефон = Выборка.РодительФИО2.НомерТелефона;
				Движение.МатьДатаРождения = Выборка.РодительФИО2.ДатаРождения;
				Движение.МатьМестоПроживания = Выборка.РодительФИО2.АдресФактическогоПроживания;
				Движение.МатьМестоРегистрации = Выборка.РодительФИО2.АдресПрописка;
				Движение.МатьНаличиеФункциональныхОграничений = Выборка.РодительФИО2.НаличиеФункциональныхОграничений;
				Движение.МатьСемейноеПоложение =Выборка.РодительФИО2.СемейноеПоложение;
				Движение.МатьГдеРаботает = Выборка.РодительФИО2.ГдеРаботает;
				Движение.МатьДокумент = Выборка.РодительНаименование2;
				Движение.МатьДокументСерия =Выборка.РодительСерия2;
				Движение.МатьДокументНомер =Выборка.РодительНомер2;
				Движение.МатьДокументДатаВыдачи =Выборка.РодительДатаВыдачи2;
				Движение.МатьДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи2;
				Движение.МатьДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания2;
				
			КонецЕсли;
			Если Выборка.РодительРодство1 = "мать"  Тогда
				
				Движение.МатьФИО = Выборка.РодительФИО1;
				Движение.МатьИНН = Выборка.РодительФИО1.ИНН;
				Движение.МатьКонтактныйТелефон = Выборка.РодительФИО1.НомерТелефона;
				Движение.МатьДатаРождения = Выборка.РодительФИО1.ДатаРождения;
				Движение.МатьМестоПроживания = Выборка.РодительФИО1.АдресФактическогоПроживания;
				Движение.МатьМестоРегистрации = Выборка.РодительФИО1.АдресПрописка;
				Движение.МатьНаличиеФункциональныхОграничений = Выборка.РодительФИО1.НаличиеФункциональныхОграничений;
				Движение.МатьСемейноеПоложение =Выборка.РодительФИО1.СемейноеПоложение;
				Движение.МатьГдеРаботает = Выборка.РодительФИО1.ГдеРаботает;
				Движение.МатьДокумент = Выборка.РодствоНаименование1;
				Движение.МатьДокументСерия =Выборка.РодительСерия1;
				Движение.МатьДокументНомер =Выборка.РодительНомер1;
				Движение.МатьДокументДатаВыдачи =Выборка.РодительДатаВыдачи1;
				Движение.МатьДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи1;
				Движение.МатьДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания1;
				
				
				//Движение.ОтецФИО = Выборка.РодительФИО2;
				//Движение.ОтецИНН = Выборка.РодительФИО2.ИНН;
				//Движение.ОтецКонтактныйТелефон = Выборка.РодительФИО2.НомерТелефона;
				//Движение.ОтецДатаРождения = Выборка.РодительФИО2.ДатаРождения;
				//Движение.ОтецМестоПроживания = Выборка.РодительФИО2.АдресФактическогоПроживания;
				//Движение.ОтецМестоРегистрации = Выборка.РодительФИО2.АдресПрописка;	
				//Движение.ОтецНаличиеФункциональныхОграничений = Выборка.РодительФИО2.НаличиеФункциональныхОграничений;
				//Движение.ОтецСемейноеПоложение =Выборка.РодительФИО2.СемейноеПоложение;
				//Движение.ОтецГдеРаботает = Выборка.РодительФИО2.ГдеРаботает;
				//Движение.ОтецДокумент = Выборка.РодительНаименование2;
				//Движение.ОтецДокументСерия =Выборка.РодительСерия2;
				//Движение.ОтецДокументНомер =Выборка.РодительНомер2;
				//Движение.ОтецДокументДатаВыдачи =Выборка.РодительДатаВыдачи2;
				//Движение.ОтецДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи2;
				//Движение.ОтецДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания2;
			КонецЕсли;
			Секунда = Секунда + 1;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	Если ДокументМС  = ЛОЖЬ И СупругМС = ИСТИНА Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДело.Заявитель КАК ФИО,
		|	ВЫБОР
		|		КОГДА ЛичноеДело.Заявитель.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
		|			ТОГДА ""отец""
		|		ИНАЧЕ ""мать""
		|	КОНЕЦ КАК Родство
		|ПОМЕСТИТЬ Заявитель
		|ИЗ
		|	Документ.ЛичноеДело КАК ЛичноеДело
		|ГДЕ
		|	ЛичноеДело.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичноеДелоСоставСемьи.ФИО КАК ФИО,
		|	ВЫБОР
		|		КОГДА ЛичноеДелоСоставСемьи.ФИО.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
		|			ТОГДА ""отец""
		|		ИНАЧЕ ""мать""
		|	КОНЕЦ КАК Родство
		|ПОМЕСТИТЬ Супруг
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|ГДЕ
		|	ЛичноеДелоСоставСемьи.Ссылка = &Ссылка
		|	И (ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.Супруга)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.супруг))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичноеДелоСоставСемьи.ФИО 				КАК ФИО,
		|	ЛичноеДелоСоставСемьи.Родство 			КАК Родство,
		|	Заявитель.ФИО 							КАК РодительФИО1,
		|	Заявитель.Родство 						КАК РодительРодство1,
		|	Супруг.ФИО 								КАК РодительФИО2,
		|	Супруг.Родство 							КАК РодительРодство2
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи,
		|	Заявитель КАК Заявитель,
		|	Супруг КАК Супруг
		|ГДЕ
		|	ЛичноеДелоСоставСемьи.Ссылка = &Ссылка
		|	И НЕ(ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.Супруга)
		|				ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.супруг))";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Секунда = 1;
		
		Пока Выборка.Следующий() Цикл
			Движение = Движения.МногодетныеСемьиУчет.Добавить();
			Движение.Период = ДатаЗаявления+Секунда;
			Движение.Регистратор = Ссылка;
			Движение.Организация = Организация;
			Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
			Движение.Заявитель = Выборка.РодительФИО1;
			Движение.РебенокФИО = Выборка.ФИО;
			Движение.РебенокДатаРождения = Выборка.ФИО.ДатаРождения;
			Движение.РебенокИНН =  Выборка.ФИО.ИНН;
			Движение.РебенокНаличиеФункциональныхОграничений = Выборка.ФИО.НаличиеФункциональныхОграничений;
			//Движение.РебенокУдостоверениеСерия   = Выборка.Серия;
			//Движение.РебенокУдостоверениеНомер = Выборка.Номер;
			//Движение.РебенокУдостоверениеДатаВыдачи = Выборка.ДатаВыдачи;
			//Движение.РебенокУдостоверениеДатаНачалоДействия = Выборка.ДатаВыдачи;
			//Движение.РебенокУдостоверениеДатаОкончанияДействия = Выборка.ДатаОкончания;
			
			Если Выборка.РодительРодство1 = "отец"  Тогда
				Движение.ОтецФИО = Выборка.РодительФИО1;
				Движение.ОтецИНН = Выборка.РодительФИО1.ИНН;
				Движение.ОтецКонтактныйТелефон = Выборка.РодительФИО1.НомерТелефона;
				Движение.ОтецДатаРождения = Выборка.РодительФИО1.ДатаРождения;
				Движение.ОтецМестоПроживания = Выборка.РодительФИО1.АдресФактическогоПроживания;
				Движение.ОтецМестоРегистрации = Выборка.РодительФИО1.АдресПрописка;
				Движение.ОтецНаличиеФункциональныхОграничений = Выборка.РодительФИО1.НаличиеФункциональныхОграничений;
				Движение.ОтецСемейноеПоложение =Выборка.РодительФИО1.СемейноеПоложение;
				Движение.ОтецГдеРаботает = Выборка.РодительФИО1.ГдеРаботает;
				//Движение.ОтецДокумент = Выборка.РодствоНаименование1;
				//Движение.ОтецДокументСерия =Выборка.РодительСерия1;
				//Движение.ОтецДокументНомер =Выборка.РодительНомер1;
				//Движение.ОтецДокументДатаВыдачи =Выборка.РодительДатаВыдачи1;
				//Движение.ОтецДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи1;
				//Движение.ОтецДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания1;
				
				Движение.МатьФИО = Выборка.РодительФИО2;
				Движение.МатьИНН = Выборка.РодительФИО2.ИНН;
				Движение.МатьКонтактныйТелефон = Выборка.РодительФИО2.НомерТелефона;
				Движение.МатьДатаРождения = Выборка.РодительФИО2.ДатаРождения;
				Движение.МатьМестоПроживания = Выборка.РодительФИО2.АдресФактическогоПроживания;
				Движение.МатьМестоРегистрации = Выборка.РодительФИО2.АдресПрописка;
				Движение.МатьНаличиеФункциональныхОграничений = Выборка.РодительФИО2.НаличиеФункциональныхОграничений;
				Движение.МатьСемейноеПоложение =Выборка.РодительФИО2.СемейноеПоложение;
				Движение.МатьГдеРаботает = Выборка.РодительФИО2.ГдеРаботает;
				//Движение.МатьДокумент = Выборка.РодительНаименование2;
				//Движение.МатьДокументСерия =Выборка.РодительСерия2;
				//Движение.МатьДокументНомер =Выборка.РодительНомер2;
				//Движение.МатьДокументДатаВыдачи =Выборка.РодительДатаВыдачи2;
				//Движение.МатьДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи2;
				//Движение.МатьДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания2;
				
			КонецЕсли;
			Если Выборка.РодительРодство1 = "мать"  Тогда
				
				Движение.МатьФИО = Выборка.РодительФИО1;
				Движение.МатьИНН = Выборка.РодительФИО1.ИНН;
				Движение.МатьКонтактныйТелефон = Выборка.РодительФИО1.НомерТелефона;
				Движение.МатьДатаРождения = Выборка.РодительФИО1.ДатаРождения;
				Движение.МатьМестоПроживания = Выборка.РодительФИО1.АдресФактическогоПроживания;
				Движение.МатьМестоРегистрации = Выборка.РодительФИО1.АдресПрописка;
				Движение.МатьНаличиеФункциональныхОграничений = Выборка.РодительФИО1.НаличиеФункциональныхОграничений;
				Движение.МатьСемейноеПоложение =Выборка.Выборка.РодительФИО1.СемейноеПоложение;
				Движение.МатьГдеРаботает = Выборка.РодительФИО1.ГдеРаботает;
				//Движение.МатьДокумент = Выборка.РодствоНаименование1;
				//Движение.МатьДокументСерия =Выборка.РодительСерия1;
				//Движение.МатьДокументНомер =Выборка.РодительНомер1;
				//Движение.МатьДокументДатаВыдачи =Выборка.РодительДатаВыдачи1;
				//Движение.МатьДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи1;
				//Движение.МатьДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания1;
				
				
				Движение.ОтецФИО = Выборка.РодительФИО2;
				Движение.ОтецИНН = Выборка.РодительФИО2.ИНН;
				Движение.ОтецКонтактныйТелефон = Выборка.РодительФИО2.НомерТелефона;
				Движение.ОтецДатаРождения = Выборка.РодительФИО2.ДатаРождения;
				Движение.ОтецМестоПроживания = Выборка.РодительФИО2.АдресФактическогоПроживания;
				Движение.ОтецМестоРегистрации = Выборка.РодительФИО2.АдресПрописка;	
				Движение.ОтецНаличиеФункциональныхОграничений = Выборка.РодительФИО2.НаличиеФункциональныхОграничений;
				Движение.ОтецСемейноеПоложение =Выборка.РодительФИО2.СемейноеПоложение;
				Движение.ОтецГдеРаботает = Выборка.РодительФИО2.ГдеРаботает;
				//Движение.ОтецДокумент = Выборка.РодительНаименование2;
				//Движение.ОтецДокументСерия =Выборка.РодительСерия2;
				//Движение.ОтецДокументНомер =Выборка.РодительНомер2;
				//Движение.ОтецДокументДатаВыдачи =Выборка.РодительДатаВыдачи2;
				//Движение.ОтецДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи2;
				//Движение.ОтецДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания2;
			КонецЕсли;
			Секунда = Секунда + 1;
			
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	Если ДокументМС  = ЛОЖЬ И СупругМС = ЛОЖЬ Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДело.Заявитель КАК ФИО,
		|	ВЫБОР
		|		КОГДА ЛичноеДело.Заявитель.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
		|			ТОГДА ""отец""
		|		ИНАЧЕ ""мать""
		|	КОНЕЦ КАК Родство,
		|	ЛичноеДело.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Заявитель
		|ИЗ
		|	Документ.ЛичноеДело КАК ЛичноеДело
		|ГДЕ
		|	ЛичноеДело.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичноеДелоСоставСемьи.ФИО КАК ФИО,
		|	ЛичноеДелоСоставСемьи.Родство КАК Родство,
		|	Заявитель.ФИО КАК РодительФИО1,
		|	Заявитель.Родство КАК РодительРодство1
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Заявитель КАК Заявитель
		|		ПО ЛичноеДелоСоставСемьи.Ссылка = Заявитель.Ссылка
		|ГДЕ
		|	ЛичноеДелоСоставСемьи.Ссылка = &Ссылка
		|	И (ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.дочь)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.сын))";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Секунда = 1;
		Пока Выборка.Следующий() Цикл
			Движение = Движения.МногодетныеСемьиУчет.Добавить();
			Движение.Период = ДатаЗаявления+Секунда;
			Движение.Регистратор = Ссылка;
			Движение.Организация = Организация;
			Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
			Движение.Заявитель = Выборка.РодительФИО1;
			Движение.РебенокФИО = Выборка.ФИО;
			Движение.РебенокДатаРождения = Выборка.ФИО.ДатаРождения;
			Движение.РебенокИНН =  Выборка.ФИО.ИНН;
			Движение.РебенокНаличиеФункциональныхОграничений = Выборка.ФИО.НаличиеФункциональныхОграничений;
			//Движение.РебенокУдостоверениеСерия   = Выборка.Серия;
			//Движение.РебенокУдостоверениеНомер = Выборка.Номер;
			//Движение.РебенокУдостоверениеДатаВыдачи = Выборка.ДатаВыдачи;
			//Движение.РебенокУдостоверениеДатаНачалоДействия = Выборка.ДатаВыдачи;
			//Движение.РебенокУдостоверениеДатаОкончанияДействия = Выборка.ДатаОкончания;
			
			Если Выборка.РодительРодство1 = "отец"  Тогда
				Движение.ОтецФИО = Выборка.РодительФИО1;
				Движение.ОтецИНН = Выборка.РодительФИО1.ИНН;
				Движение.ОтецКонтактныйТелефон = Выборка.РодительФИО1.НомерТелефона;
				Движение.ОтецДатаРождения = Выборка.РодительФИО1.ДатаРождения;
				Движение.ОтецМестоПроживания = Выборка.РодительФИО1.АдресФактическогоПроживания;
				Движение.ОтецМестоРегистрации = Выборка.РодительФИО1.АдресПрописка;
				Движение.ОтецНаличиеФункциональныхОграничений = Выборка.РодительФИО1.НаличиеФункциональныхОграничений;
				Движение.ОтецСемейноеПоложение =Выборка.РодительФИО1.СемейноеПоложение;
				Движение.ОтецГдеРаботает = Выборка.РодительФИО1.ГдеРаботает;
				//Движение.ОтецДокумент = Выборка.РодствоНаименование1;
				//Движение.ОтецДокументСерия =Выборка.РодительСерия1;
				//Движение.ОтецДокументНомер =Выборка.РодительНомер1;
				//Движение.ОтецДокументДатаВыдачи =Выборка.РодительДатаВыдачи1;
				//Движение.ОтецДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи1;
				//Движение.ОтецДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания1;
				
				//Движение.МатьФИО = Выборка.РодительФИО2;
				//Движение.МатьИНН = Выборка.РодительФИО2.ИНН;
				//Движение.МатьКонтактныйТелефон = Выборка.РодительФИО2.НомерТелефона;
				//Движение.МатьДатаРождения = Выборка.РодительФИО2.ДатаРождения;
				//Движение.МатьМестоПроживания = Выборка.РодительФИО2.АдресФактическогоПроживания;
				//Движение.МатьМестоРегистрации = Выборка.РодительФИО2.АдресПрописка;
				//Движение.МатьНаличиеФункциональныхОграничений = Выборка.РодительФИО2.НаличиеФункциональныхОграничений;
				//Движение.МатьСемейноеПоложение =Выборка.РодительФИО2.СемейноеПоложение;
				//Движение.МатьГдеРаботает = Выборка.РодительФИО2.ГдеРаботает;
				//Движение.МатьДокумент = Выборка.РодительНаименование2;
				//Движение.МатьДокументСерия =Выборка.РодительСерия2;
				//Движение.МатьДокументНомер =Выборка.РодительНомер2;
				//Движение.МатьДокументДатаВыдачи =Выборка.РодительДатаВыдачи2;
				//Движение.МатьДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи2;
				//Движение.МатьДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания2;
				
			КонецЕсли;
			Если Выборка.РодительРодство1 = "мать"  Тогда
				
				Движение.МатьФИО = Выборка.РодительФИО1;
				Движение.МатьИНН = Выборка.РодительФИО1.ИНН;
				Движение.МатьКонтактныйТелефон = Выборка.РодительФИО1.НомерТелефона;
				Движение.МатьДатаРождения = Выборка.РодительФИО1.ДатаРождения;
				Движение.МатьМестоПроживания = Выборка.РодительФИО1.АдресФактическогоПроживания;
				Движение.МатьМестоРегистрации = Выборка.РодительФИО1.АдресПрописка;
				Движение.МатьНаличиеФункциональныхОграничений = Выборка.РодительФИО1.НаличиеФункциональныхОграничений;
				Движение.МатьСемейноеПоложение =Выборка.РодительФИО1.СемейноеПоложение;
				Движение.МатьГдеРаботает = Выборка.РодительФИО1.ГдеРаботает;
				//Движение.МатьДокумент = Выборка.РодствоНаименование1;
				//Движение.МатьДокументСерия =Выборка.РодительСерия1;
				//Движение.МатьДокументНомер =Выборка.РодительНомер1;
				//Движение.МатьДокументДатаВыдачи =Выборка.РодительДатаВыдачи1;
				//Движение.МатьДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи1;
				//Движение.МатьДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания1;
				
				
				//Движение.ОтецФИО = Выборка.РодительФИО2;
				//Движение.ОтецИНН = Выборка.РодительФИО2.ИНН;
				//Движение.ОтецКонтактныйТелефон = Выборка.РодительФИО2.НомерТелефона;
				//Движение.ОтецДатаРождения = Выборка.РодительФИО2.ДатаРождения;
				//Движение.ОтецМестоПроживания = Выборка.РодительФИО2.АдресФактическогоПроживания;
				//Движение.ОтецМестоРегистрации = Выборка.РодительФИО2.АдресПрописка;	
				//Движение.ОтецНаличиеФункциональныхОграничений = Выборка.РодительФИО2.НаличиеФункциональныхОграничений;
				//Движение.ОтецСемейноеПоложение =Выборка.РодительФИО2.СемейноеПоложение;
				//Движение.ОтецГдеРаботает = Выборка.РодительФИО2.ГдеРаботает;
				//Движение.ОтецДокумент = Выборка.РодительНаименование2;
				//Движение.ОтецДокументСерия =Выборка.РодительСерия2;
				//Движение.ОтецДокументНомер =Выборка.РодительНомер2;
				//Движение.ОтецДокументДатаВыдачи =Выборка.РодительДатаВыдачи2;
				//Движение.ОтецДокументДатаНачалоДействия =Выборка.РодительДатаВыдачи2;
				//Движение.ОтецДокументДатаОкончанияДействия =Выборка.РодительДатаОкончания2;
			КонецЕсли;
			Секунда = Секунда + 1;
			
		КонецЦикла;
		
		
		
	КонецЕсли;

	
КонецПроцедуры

Процедура  МногодетнаяСемья()
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДелоДокументыМС.ФизическоеЛицоМС 				КАК ФизическоеЛицоМС,
		|	ЛичноеДелоДокументыМС.ДеньРожденияМС 				КАК ДеньРожденияМС,
		|	ЛичноеДелоДокументыМС.НаименованиеМС 				КАК НаименованиеМС,
		|	ЛичноеДелоДокументыМС.СерияМС 						КАК СерияМС,
		|	ЛичноеДелоДокументыМС.НомерМС 						КАК НомерМС,
		|	ЛичноеДелоДокументыМС.ДатаВыдачиМС 					КАК ДатаВыдачиМС,
		|	ЛичноеДелоДокументыМС.ДатаОкончанияМС 				КАК ДатаОкончанияМС,
		|	ЛичноеДелоДокументыМС.Ссылка 						КАК Ссылка
		|ПОМЕСТИТЬ мать
		|ИЗ
		|	Документ.ЛичноеДело.ДокументыМС 					КАК ЛичноеДелоДокументыМС
		|ГДЕ
		|	ЛичноеДелоДокументыМС.Родство = ЗНАЧЕНИЕ(Справочник.Родство.мать)
		|	И ЛичноеДелоДокументыМС.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичноеДелоДокументыМС.ФизическоеЛицоМС 				КАК ФизическоеЛицоМС,
		|	ЛичноеДелоДокументыМС.ДеньРожденияМС 				КАК ДеньРожденияМС,
		|	ЛичноеДелоДокументыМС.НаименованиеМС 				КАК НаименованиеМС,
		|	ЛичноеДелоДокументыМС.СерияМС 						КАК СерияМС,
		|	ЛичноеДелоДокументыМС.НомерМС 						КАК НомерМС,
		|	ЛичноеДелоДокументыМС.ДатаВыдачиМС 					КАК ДатаВыдачиМС,
		|	ЛичноеДелоДокументыМС.ДатаОкончанияМС 				КАК ДатаОкончанияМС,
		|	ЛичноеДелоДокументыМС.Ссылка 						КАК Ссылка
		|ПОМЕСТИТЬ Отец
		|ИЗ
		|	Документ.ЛичноеДело.ДокументыМС КАК ЛичноеДелоДокументыМС
		|ГДЕ
		|	ЛичноеДелоДокументыМС.Родство = ЗНАЧЕНИЕ(Справочник.Родство.отец)
		|	И ЛичноеДелоДокументыМС.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичноеДелоДокументыМС.ФизическоеЛицоМС 							КАК РебенокФИО,
		|	ЛичноеДелоДокументыМС.Родство 									КАК РебенокРодство,
		|	ЛичноеДелоДокументыМС.ДеньРожденияМС 							КАК РебенокДеньРождения,
		|	ЛичноеДелоДокументыМС.НаименованиеМС 							КАК РебенокНаименование,
		|	ЛичноеДелоДокументыМС.СерияМС 									КАК РебенокСерия,
		|	ЛичноеДелоДокументыМС.НомерМС 									КАК РебенокНомер,
		|	ЛичноеДелоДокументыМС.ДатаВыдачиМС 								КАК РебенокДатаВыдачи,
		|	ЛичноеДелоДокументыМС.ДатаОкончанияМС 							КАК РебенокДатаОкончания,
		|	мать.ФизическоеЛицоМС 											КАК МатьФИО,
		|	мать.ДеньРожденияМС												КАК МатьДеньРождения,
		|	мать.НаименованиеМС 											КАК МатьНаименование,
		|	мать.СерияМС 													КАК МатьСерия,
		|	мать.НомерМС 													КАК МатьНомер,
		|	мать.ДатаВыдачиМС 												КАК МатьДатаВыдачи,
		|	мать.ДатаОкончанияМС 											КАК МатьДатаОкончания,
		|	Отец.ФизическоеЛицоМС 											КАК ОтецФИО,
		|	Отец.ДеньРожденияМС 											КАК ОтецДеньРождения,
		|	Отец.НаименованиеМС 											КАК ОтецНаименование,
		|	Отец.СерияМС 													КАК ОтецСерия,
		|	Отец.НомерМС 													КАК ОтецНомер,
		|	Отец.ДатаВыдачиМС 												КАК ОтецДатаВыдачи,
		|	Отец.ДатаОкончанияМС 											КАК ОтецДатаОкончания
		|ИЗ
		|	Документ.ЛичноеДело.ДокументыМС КАК ЛичноеДелоДокументыМС
		|		ЛЕВОЕ СОЕДИНЕНИЕ мать КАК мать
		|		ПО ЛичноеДелоДокументыМС.Ссылка = мать.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Отец КАК Отец
		|		ПО ЛичноеДелоДокументыМС.Ссылка = Отец.Ссылка
		|ГДЕ
		|	(ЛичноеДелоДокументыМС.Родство = ЗНАЧЕНИЕ(Справочник.Родство.дочь)
		|			ИЛИ ЛичноеДелоДокументыМС.Родство = ЗНАЧЕНИЕ(Справочник.Родство.сын))
		|	И ЛичноеДелоДокументыМС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Движения.МногодетныеСемьиУчет.Записывать=Истина;		
	Секунда = 1;

	Пока Выборка.Следующий() Цикл
		Движение = Движения.МногодетныеСемьиУчет.Добавить();
				
				Движение.Период 											= ДатаЗаявления+Секунда;
				Движение.Регистратор 										= Ссылка;
				Движение.Организация 										= Организация;
				Движение.ЛьготнаяКатегория 									= ЛьготнаяКатегория;
				Движение.Заявитель 											= Заявитель;
				Движение.РебенокФИО 										= Выборка.РебенокФИО;
				Движение.РебенокДатаРождения 								= Выборка.РебенокДеньРождения;
				Движение.РебенокДокумент									= Выборка.РебенокНаименование;
				Движение.РебенокИНН 										= Выборка.РебенокФИО.ИНН;
				Движение.РебенокНаличиеФункциональныхОграничений 			= Выборка.РебенокФИО.НаличиеФункциональныхОграничений;
				Движение.РебенокУдостоверениеСерия  						= Выборка.РебенокСерия;
				Движение.РебенокУдостоверениеНомер 							= Выборка.РебенокНомер;
				Движение.РебенокУдостоверениеДатаВыдачи 					= Выборка.РебенокДатаВыдачи;
				Движение.РебенокУдостоверениеДатаНачалоДействия 			= Выборка.РебенокДатаВыдачи;
				Движение.РебенокУдостоверениеДатаОкончанияДействия 			= Выборка.РебенокДатаОкончания;
				Если Не ТипЗнч(Выборка.МатьФИО)= Тип("Null") тогда
					Движение.МатьФИО 											= Выборка.МатьФИО;
					Движение.МатьИНН 											= Выборка.МатьФИО.ИНН;
					Движение.МатьКонтактныйТелефон 								= Выборка.МатьФИО.НомерТелефона;
					Движение.МатьДатаРождения 									= Выборка.МатьДеньРождения;
					Движение.МатьМестоПроживания 								= Выборка.МатьФИО.АдресФактическогоПроживания;
					Движение.МатьМестоРегистрации 								= Выборка.МатьФИО.АдресПрописка;
					Движение.МатьНаличиеФункциональныхОграничений 				= Выборка.МатьФИО.НаличиеФункциональныхОграничений;
					Движение.МатьСемейноеПоложение 								= Выборка.МатьФИО.СемейноеПоложение;
					Движение.МатьГдеРаботает 									= Выборка.МатьФИО.ГдеРаботает;
					Движение.МатьДокумент 										= Выборка.МатьНаименование;
					Движение.МатьДокументСерия 									= Выборка.МатьСерия;
					Движение.МатьДокументНомер 									= Выборка.МатьНомер;
					Движение.МатьДокументДатаВыдачи 							= Выборка.МатьДатаВыдачи;
					Движение.МатьДокументДатаНачалоДействия 					= Выборка.МатьДатаВыдачи;
					Движение.МатьДокументДатаОкончанияДействия 					= Выборка.ОтецДатаОкончания;
				КонецЕсли;
				Если Не  ТипЗнч(Выборка.ОтецФИО)= Тип("Null") тогда
					Движение.ОтецФИО 											= Выборка.ОтецФИО;
					Движение.ОтецИНН 											= Выборка.ОтецФИО.ИНН;
					Движение.ОтецКонтактныйТелефон 								= Выборка.ОтецФИО.НомерТелефона;
					Движение.ОтецДатаРождения 									= Выборка.ОтецДеньРождения;
					Движение.ОтецМестоПроживания 								= Выборка.ОтецФИО.АдресФактическогоПроживания;
					Движение.ОтецМестоРегистрации 								= Выборка.ОтецФИО.АдресПрописка;
					Движение.ОтецНаличиеФункциональныхОграничений 				= Выборка.ОтецФИО.НаличиеФункциональныхОграничений;
					Движение.ОтецСемейноеПоложение 								= Выборка.ОтецФИО.СемейноеПоложение;
					Движение.ОтецГдеРаботает 									= Выборка.ОтецФИО.ГдеРаботает;
					Движение.ОтецДокумент 										= Выборка.ОтецНаименование;
					Движение.ОтецДокументСерия 									= Выборка.ОтецСерия;
					Движение.ОтецДокументНомер 									= Выборка.ОтецНомер;
					Движение.ОтецДокументДатаВыдачи 							= Выборка.ОтецДатаВыдачи;
					Движение.ОтецДокументДатаНачалоДействия 					= Выборка.ОтецДатаВыдачи;
					Движение.ОтецДокументДатаОкончанияДействия 					= Выборка.ОтецДатаОкончания;
				КонецЕсли;
				Секунда = Секунда + 1;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПроводимОтказЛьгота()
	Движения.ОтказыЛьгота.Записывать=Истина;
	Для Каждого ТекСтрока Из ВидыЛьготы Цикл
		Движение = Движения.ОтказыЛьгота.Добавить();
		Движение.Период = ДатаЗаявления;
		Движение.Организация = Организация;
		Движение.ВидЛьготы = ТекСтрока.Наименование;
	    Движение.Заявитель = Заявитель;
		Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
		Движение.СельскийСовет = СельскийСовет;
		Движение.НомерДела = НомерЗаявления;
		Движение.ДатаЗаявления = ДатаЗаявления;
	КонецЦикла;	
	Движения.КоличествоЛьготОтказов.Записывать=Истина;
	Движение = Движения.КоличествоЛьготОтказов.Добавить();
	Движение.Период = ДатаЗаявления;
	Движение.Организация = Организация;
	Движение.Льгота = ВидыЛьготыШапка;
	Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
	Движение.СельскийСовет = СельскийСовет;
	Движение.Группа = Группа;
	Движение.Количество = 1;

КонецПроцедуры
Процедура ПроводимКомиссияЛьготы() 
	Движения.КоличествоЛьготПоКатегориямКомиссия.Записывать=Истина;
	Движение = Движения.КоличествоЛьготПоКатегориямКомиссия.Добавить();
	Движение.Период = ДатаЗаявления;
	Движение.Организация = Организация;
	Движение.Льгота = ВидыЛьготыШапка;
	Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
	Движение.СельскийСовет = СельскийСовет;
	Движение.Группа = Группа;
	Движение.Количество = 1;
	ДвиженияПоРегистрамНакопления();
КонецПроцедуры	
Процедура ДвиженияПоРегистрамНакопления()
	Движения.КоличествоЛьготПоКатегориямЗаявления.Записывать=Истина;
	Движение = Движения.КоличествоЛьготПоКатегориямЗаявления.Добавить();
	Движение.Период = ДатаЗаявления;
	Движение.Организация = Организация;
	Движение.Льгота = ВидыЛьготыШапка;
	Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
	Движение.СельскийСовет = СельскийСовет;
	Движение.Группа = Группа;
	Движение.Количество = 1;

КонецПроцедуры	
Процедура ДвижениеПоРегистрамСведений()
	Перем Родитель;
	 // регистр ЛичноеДелоЛьготы
	Движения.ЛичноеДелоЛьготы.Записывать = Истина;
	Для Каждого ТекСтрокаВидыЛьготы Из ВидыЛьготы Цикл
		Движение = Движения.ЛичноеДелоЛьготы.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ВидЛьготы = ТекСтрокаВидыЛьготы.Наименование;
		Движение.Сотрудник = Принял;
		Движение.Заявитель = Заявитель;
		Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
		Движение.НомерДела = НомерЗаявления;
		Движение.ДатаОткрытияДела = Дата;
		Движение.АдресПроживания = АдресФактическогоПроживания;
		Движение.АдресПрописки = АдресПрописка;
		Движение.ПредметЛьготы = ТекСтрокаВидыЛьготы.ПредметЛьготы;
		Движение.Количество = ТекСтрокаВидыЛьготы.Показатель;
		Движение.Сумма = ТекСтрокаВидыЛьготы.Сумма;
		Движение.МестоХраненияЛичногоДела = Отдел;
		Движение.ЕденицаИзмерения = ТекСтрокаВидыЛьготы.Измерение;
		Движение.СельскийСовет = СельскийСовет;
		Движение.ЛицоПодОпекой = ЛицоПодОпекой;
		Движение.НомерТалона = НомерТалона;
	КонецЦикла;
	
	// регистр ЛичноеДелоВыплата
	Движения.ЛичноеДелоВыплата.Записывать = Истина;
	Для Каждого ТекСтрокаВидыВыплат Из ВидыВыплат Цикл
		Движение = Движения.ЛичноеДелоВыплата.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ВидВыплаты = ТекСтрокаВидыВыплат.Наименование;
		Движение.Сотрудник = Принял;
		Движение.Заявитель = Заявитель;
		Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
		Движение.НомерДела = Номер;
		Движение.ДатаОткрытияДела = Дата;
		Движение.АдресПроживания = АдресФактическогоПроживания;
		Движение.АдресПрописки = АдресПрописка;
		Движение.Сумма = ТекСтрокаВидыВыплат.Сумма;
		Движение.ЛицоПодОпекой = ЛицоПодОпекой;
	КонецЦикла;
	
	// регистр  ЛичноеДелоЗакрыть
	Если ДелоЗакрыто=Истина Тогда
		Движения.ЛичноеДелоЗакрыть.Записывать = Истина;
	    Движение = Движения.ЛичноеДелоЗакрыть.Добавить();
		Движение.Период = ДатаЗакрытияДела;
		Движение.Организация = Организация;		
		Движение.Заявитель = Заявитель;
		Движение.ЛьготнаяКатегория = ЛьготнаяКатегория;
		Если Льгота Тогда
			 Движение.ВидЛьготы = ВидыЛьготыШапка;
		КонецЕсли;
		Движение.НомерДела = НомерЗаявления;
		Движение.ДатаОткрытияДела = ДатаЗаявления;
		Движение.ДатаЗакрытияДела = ДатаЗакрытияДела;
	КонецЕсли;
	
	Если МногодетнаяСемья Тогда
		Если ДокументыМС.Количество()>0 Тогда
			МногодетнаяСемья();
		КонецЕсли;	
	КонецЕсли;	
	
	ДвиженияПоРегистрамНакопления();	
	КонецПроцедуры	
Процедура КоличествоДетейМС()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоДетей
		|ИЗ
		|	Документ.ЛичноеДело.ДокументыМС КАК ЛичноеДелоДокументыМС
		|ГДЕ
		|	(ЛичноеДелоДокументыМС.Родство = ЗНАЧЕНИЕ(Справочник.Родство.дочь)
		|			ИЛИ ЛичноеДелоДокументыМС.Родство = ЗНАЧЕНИЕ(Справочник.Родство.сын))
		|	И ЛичноеДелоДокументыМС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		КоличествоДетейМС =   Выборка.КоличествоДетей;
	КонецЕсли;
	
КонецПроцедуры		
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//НомерЗаявления =ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер);
	КоличествоДетейМС();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДело.Заявитель КАК Заявитель,
		|	ЛичноеДело.НомерЗаявления КАК НомерЗаявления,
		|	ЛичноеДело.ДатаЗаявления КАК ДатаЗаявления,
		|	ЛичноеДело.Решение КАК Решение
		|ИЗ
		|	Документ.ЛичноеДело КАК ЛичноеДело
		|ГДЕ
		|	ЛичноеДело.ВидыЛьготыШапка = &ВидыЛьготыШапка
		|	И ЛичноеДело.Заявитель = &Заявитель";
	
	Запрос.УстановитьПараметр("ВидыЛьготыШапка", ВидыЛьготыШапка);
	Запрос.УстановитьПараметр("Заявитель", Заявитель);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщить(Строка(Выборка.Заявитель) + "  Создано дело №" + Строка(НомерЗаявления)+ " от "+ Строка(Выборка.ДатаЗаявления)+ " Решение: "+ Строка(Выборка.Решение));
	КонецЦикла;
	
	

КонецПроцедуры

Процедура ЗаписьНомераТалонаВРегистр()
	
	Движения.НумирацияТалонов.Записывать = Истина;
	Движение =  Движения.НумирацияТалонов.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.ВидЛьготы = ВидыЛьготыШапка;
	Движение.ПоследнийНомерТалона = НомерТалона;
	Движение.Регистратор = Ссылка;
	
КонецПроцедуры	
