#Область ПрограмныйИтерфейс
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();	
	КомандаПечати.МенеджерПечати = "Справочник.ФизическиеЛица";
	КомандаПечати.Идентификатор = "КарточкаМногодетнаяСемья";
	КомандаПечати.МестоРазмещения = "ПодменюПечать";
	КомандаПечати.Представление = НСтр("ru = 'КАРТА УЧЕТА'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
		
	// В формате Microsoft Word.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТестовыйДокументВордНаправлениеСМЭ";  // ид
	КомандаПечати.Представление = НСтр("ru = 'Направление СМЭ'");
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007; // картинка на кнопку
	КомандаПечати.ПроверкаПроведенияПередПечатью = ложь; // проверка проведения

КонецПроцедуры

Процедура Печать(МассивОбъектов,ПараметрыПечати,КоллекцияПечатныхФорм,ОбъектыПечати,ПараметрыВывода) Экспорт
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"КарточкаМногодетнаяСемья");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьКарточкаУчетаМС(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма.СинонимМакета = НСтр("ru = 'КАРТА УЧЕТА МНОГОДЕТНЫХ СЕМЕЙ'");
        ПечатнаяФорма.ПолныйПутьКМакету = "Справочник.ФизическиеЛица.ПФ_MXL_КарточкаУчетаМногодетнойСемьи";
	КонецЕсли;
	
	ПечатнаяФорма2 = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ТестовыйДокументВордНаправлениеСМЭ");
	Если ПечатнаяФорма2 <> Неопределено Тогда
		ПечатнаяФорма2.ОфисныеДокументы = НапечататьНаправлениеСМЭ(МассивОбъектов);
		ПечатнаяФорма2.СинонимМакета    = НСтр("ru = 'Направление СМЭ (документ MS Word)'");
		//ПечатнаяФорма2.ОфисныеДокументы = ОфисныеДокументы;
	КонецЕсли;
КонецПроцедуры	
#КонецОбласти

Функция ПечатьКарточкаУчетаМС(МассивОбъектов,ОбъектыПечати)
	// Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ФЛ";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ФизическиеЛица.ПФ_MXL_КарточкаУчетаМногодетнойСемьи");
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаСправочника.Ссылка КАК Ссылка
    |ИЗ
    |	Справочник.ФизическиеЛица КАК ТаблицаСправочника
    |ГДЕ
    |	ТаблицаСправочника.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    
    ПервыйДокумент = Истина;
    
    Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		//Начало вывода документа
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		Образование_Мать = "";
		Специальность_Мать = "";
		Образование_Отец ="";
		Специальность_Отец =""; 
		Для Каждого СтрокаДок из Выборка.Ссылка.Документы Цикл
			Если  СтрокаДок.Наименование   =   ПредопределенноеЗначение("Справочник.ДокументыПоВидам.УдостоверениеМногодетнойМатери") Тогда
				   Шапка.Параметры.ДокументУдостоверение   = СтрокаДок.Серия+ СтрокаДок.Номер +" от "+Строка(Формат(СтрокаДок.ДатаВыдачи,"ДФ=dd.MM.yyyy")) +" до "+Строка(Формат(СтрокаДок.ДатаОкончания,"ДФ=dd.MM.yyyy"));
			КонецЕсли;	
		КонецЦикла;	
		
		Если Выборка.Ссылка.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской") Тогда
			  //Отец
				Шапка.Параметры.ФИО_Отец = Выборка.Ссылка.Наименование;	
				Шапка.Параметры.ДатаРождения_Отец = Формат(Выборка.Ссылка.ДатаРождения,"ДФ=dd.MM.yyyy");
				Шапка.Параметры.АдресФактическогоПроживания_Отец = Выборка.Ссылка.АдресФактическогоПроживания;
				Шапка.Параметры.АдресПрописка_Отец = Выборка.Ссылка.АдресПрописка;
				Шапка.Параметры.Паспорт_Отец = Выборка.Ссылка.ПаспортСерия + Выборка.Ссылка.ПаспортНомер;
				Шапка.Параметры.ИНН_Отец =Выборка.Ссылка.ИНН;
				Шапка.Параметры.СемейноеПоложение_Отец =Выборка.Ссылка.СемейноеПоложение;
				Шапка.Параметры.ГдеРаботает_Отец =Выборка.Ссылка.ГдеРаботает;
				Шапка.Параметры.НаличиеФункциональныхОграничений_Отец = Выборка.Ссылка.НаличиеФункциональныхОграничений;
				Шапка.Параметры.НомерТелефона_Отец = Выборка.Ссылка.НомерТелефона;
				Для Каждого СтрокаОбучения  Из  Выборка.Ссылка.Учеба  Цикл
					Образование_Отец = Образование_Отец + "; "+ СтрокаОбучения.Образование;
					Специальность_Отец = Специальность_Отец +"; "+ СтрокаОбучения.Специальность;
				КонецЦикла;
				Шапка.Параметры.Образование_Отец =  Образование_Отец;
				Шапка.Параметры.Специальность_Отец = Специальность_Отец;
		Иначе
				//мать
				Шапка.Параметры.ФИО_Мать = Выборка.Ссылка.Наименование;	
				Шапка.Параметры.ДатаРождения_Мать = Формат(Выборка.Ссылка.ДатаРождения,"ДФ=dd.MM.yyyy");
				Шапка.Параметры.АдресФактическогоПроживания_Мать = Выборка.Ссылка.АдресФактическогоПроживания;
				Шапка.Параметры.АдресПрописка_Мать = Выборка.Ссылка.АдресПрописка;
				Шапка.Параметры.Паспорт_Мать = Выборка.Ссылка.ПаспортСерия + Выборка.Ссылка.ПаспортНомер;
				Шапка.Параметры.ИНН_Мать =Выборка.Ссылка.ИНН;
				Шапка.Параметры.СемейноеПоложение_Мать =Выборка.Ссылка.СемейноеПоложение;
				Шапка.Параметры.ГдеРаботает_Мать =Выборка.Ссылка.ГдеРаботает;
				Шапка.Параметры.НаличиеФункциональныхОграничений_Мать = Выборка.Ссылка.НаличиеФункциональныхОграничений;
				Шапка.Параметры.НомерТелефона_Мать = Выборка.Ссылка.НомерТелефона;
				Для Каждого СтрокаОбучения  Из  Выборка.Ссылка.Учеба  Цикл
					Образование_Мать = Образование_Мать + СтрокаОбучения.Образование+ "; ";
					Специальность_Мать = Специальность_Мать + СтрокаОбучения.Специальность+"; ";
				КонецЦикла;
				Шапка.Параметры.Образование_Мать = Образование_Мать;
				Шапка.Параметры.Специальность_Мать =Специальность_Мать;

		КонецЕсли;	
		
		Для Каждого СтрокаТЧ Из  Выборка.Ссылка.СоставСемьи  Цикл
			Если СтрокаТЧ.Родство  = ПредопределенноеЗначение("Справочник.Родство.супруга")  Тогда
				//мать
				Шапка.Параметры.ФИО_Мать = СтрокаТЧ.ФИО.Наименование;	
				Шапка.Параметры.ДатаРождения_Мать = Формат(СтрокаТЧ.ФИО.ДатаРождения,"ДФ=dd.MM.yyyy");
				Шапка.Параметры.АдресФактическогоПроживания_Мать = СтрокаТЧ.ФИО.АдресФактическогоПроживания;
				Шапка.Параметры.АдресПрописка_Мать = СтрокаТЧ.ФИО.АдресПрописка;
				Шапка.Параметры.Паспорт_Мать = СтрокаТЧ.ФИО.ПаспортСерия + СтрокаТЧ.ФИО.ПаспортНомер;
				Шапка.Параметры.ИНН_Мать =СтрокаТЧ.ФИО.ИНН;
				Шапка.Параметры.СемейноеПоложение_Мать =СтрокаТЧ.ФИО.СемейноеПоложение;
				Шапка.Параметры.ГдеРаботает_Мать =СтрокаТЧ.ФИО.ГдеРаботает;
				Шапка.Параметры.НаличиеФункциональныхОграничений_Мать = СтрокаТЧ.ФИО.НаличиеФункциональныхОграничений;
				Шапка.Параметры.НомерТелефона_Мать = СтрокаТЧ.ФИО.НомерТелефона;
				Для Каждого СтрокаОбучения  Из  СтрокаТЧ.ФИО.Учеба  Цикл
					Образование_Мать = Образование_Мать + СтрокаОбучения.Образование+" ";
					Специальность_Мать = Специальность_Мать + СтрокаОбучения.Специальность+" ";
				КонецЦикла;
				Шапка.Параметры.Образование_Мать = Образование_Мать;
				Шапка.Параметры.Специальность_Мать =Специальность_Мать;
			КонецЕсли;	
			Если СтрокаТЧ.Родство  = ПредопределенноеЗначение("Справочник.Родство.супруг")  Тогда
				//Отец
				Шапка.Параметры.ФИО_Отец = СтрокаТЧ.ФИО.Наименование;	
				Шапка.Параметры.ДатаРождения_Отец = Формат(СтрокаТЧ.ФИО.ДатаРождения,"ДФ=dd.MM.yyyy");
				Шапка.Параметры.АдресФактическогоПроживания_Мать = СтрокаТЧ.ФИО.АдресФактическогоПроживания;
				Шапка.Параметры.АдресПрописка_Отец = СтрокаТЧ.ФИО.АдресПрописка;
				Шапка.Параметры.Паспорт_Отец = СтрокаТЧ.ФИО.ПаспортСерия + СтрокаТЧ.ФИО.ПаспортНомер;
				Шапка.Параметры.ИНН_Отец =СтрокаТЧ.ФИО.ИНН;
				Шапка.Параметры.СемейноеПоложение_Отец =СтрокаТЧ.ФИО.СемейноеПоложение;
				Шапка.Параметры.ГдеРаботает_Отец =СтрокаТЧ.ФИО.ГдеРаботает;
				Шапка.Параметры.НаличиеФункциональныхОграничений_Отец = СтрокаТЧ.ФИО.НаличиеФункциональныхОграничений;
				Шапка.Параметры.НомерТелефона_Отец = СтрокаТЧ.ФИО.НомерТелефона;
				Для Каждого СтрокаОбучения  Из  СтрокаТЧ.ФИО.Учеба  Цикл
					Образование_Мать = Образование_Мать + СтрокаОбучения.Образование+"; ";
					Специальность_Мать = Специальность_Мать + СтрокаОбучения.Специальность+"; ";
				КонецЦикла;
				Шапка.Параметры.Образование_Отец = Образование_Отец;
				Шапка.Параметры.Специальность_Отец =Специальность_Отец;
			КонецЕсли;	
				
		КонецЦикла;	
		ТабличныйДокумент.Вывести(Шапка);
		
		СтрокаШапка = Макет.ПолучитьОбласть("ШапкаСтрока");
		ТабличныйДокумент.Вывести(СтрокаШапка);
		
		Счетчик = 1;
		
		Для Каждого СтрокаТЧ Из  Выборка.Ссылка.СоставСемьи  Цикл
			МестоОбучения = "";
			Если СтрокаТЧ.Родство  = ПредопределенноеЗначение("Справочник.Родство.дочь") ИЛИ 
				СтрокаТЧ.Родство  = ПредопределенноеЗначение("Справочник.Родство.сын")Тогда
				Строка = Макет.ПолучитьОбласть("Строка");
				Строка.Параметры.ПорНом = Счетчик;
				Строка.Параметры.ФИОРебенка  =  СтрокаТЧ.ФИО.Наименование;
				Строка.Параметры.ДатаРожденияРебенка  = Формат(СтрокаТЧ.ФИО.ДатаРождения,"ДФ=dd.MM.yyyy");
				Для Каждого СтрокаОбучения  Из  СтрокаТЧ.ФИО.Учеба  Цикл
				МестоОбучения = МестоОбучения + СтрокаОбучения.МестоОбучения;	
				КонецЦикла;	
				Строка.Параметры.МестоОбученияРебенка  =  МестоОбучения;
				Строка.Параметры.ИННРебенка =  СтрокаТЧ.ФИО.ИНН;
				Строка.Параметры.НаличиеФункциональныйОграниченийРебенка = СтрокаТЧ.ФИО.НаличиеФункциональныхОграничений;
				Для Каждого СтрокаДок из СтрокаТЧ.ФИО.Документы Цикл
					Если  СтрокаДок.Наименование   =   ПредопределенноеЗначение("Справочник.ДокументыПоВидам.УдостоверениеМногодетнойМатери") Тогда
				   		Строка.Параметры.ДокументУдостоверениеРебенка   = СтрокаДок.Серия+ СтрокаДок.Номер +" от "+Формат(СтрокаДок.ДатаВыдачи,"ДФ=dd.MM.yyyy") +" до "+Формат(СтрокаДок.ДатаОкончания,"ДФ=dd.MM.yyyy");
					КонецЕсли;	
				КонецЦикла;	

				
				
				ТабличныйДокумент.Вывести(Строка);
				Счетчик = Счетчик+1;

			КонецЕсли;
		КонецЦикла;	
		
		//Конец вывода документа
		
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;
	

КонецФункции

Функция НапечататьНаправлениеСМЭ(МассивОбъектов) Экспорт
	 	ОфисныеДокументы = Новый Соответствие;
		Шаблон = НСтр("ru = 'НАПРАВЛЕНИЕ № от [Дата] [ФизическоеЛицо] [ДатаРождения] [АдресПрописки] [ФизическоеЛицоИнициалы] [ДолжностьНачальник][ФИОНачальник]'");  //?
		ЗначенияРеквизитов  =  Новый Соответствие;//ОбщегоНазначения.ЗначенияРеквизитовОбъектов(, "Ссылка,ФизическоеЛицо,ДатаРождения,Дата,ДолжностьНачальник,ФИОНачальник");
		//ЗначенияРеквизитов.Вставить("Ссылка");
		//ЗначенияРеквизитов.Вставить("ФизическоеЛицо");
		//ЗначенияРеквизитов.Вставить("ДатаРождения");
		//ЗначенияРеквизитов.Вставить("Дата");
		//ЗначенияРеквизитов.Вставить("ДолжностьНачальник");
		//ЗначенияРеквизитов.Вставить("ФИОНачальник");
		

		
		Для Каждого Ссылка Из МассивОбъектов Цикл
			//РеквезитыСправочников = ЗначенияРеквизитов;
			//РеквезитыСправочников.Дата =  Формат(ТекущаяДата(),"ДЛФ=D");
			//РеквезитыСправочников.ФизическоеЛицо =  РеквезитыСправочников.Наименование;
			//РеквезитыСправочников.ДатаРождения = Формат(РеквезитыСправочников.ДатаРождения,"ДЛФ=D");
			//РеквезитыСправочников.ФизическоеЛицоИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Ссылка); //?
			ЗначенияРеквизитов.Вставить("Ссылка",Ссылка);
			ЗначенияРеквизитов.Вставить("ФизическоеЛицо");
			ЗначенияРеквизитов.Вставить("Ссылка", Ссылка);
			ЗначенияРеквизитов.Вставить("ФизическоеЛицо",Ссылка.Наименование);
			ЗначенияРеквизитов.Вставить("ДатаРождения",Формат(Ссылка.ДатаРождения,"ДФ=dd.MM.yyyy"));
			ЗначенияРеквизитов.Вставить("Дата",Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
			ЗначенияРеквизитов.Вставить("АдресПрописки",Ссылка.АдресПрописка);

			ТекущийНачальник = ПараметрыСеанса.ТекущийНачальникУправления;
			ЗначенияРеквизитов.Вставить("ДолжностьНачальник",ТекущийНачальник.Должность);
			ЗначенияРеквизитов.Вставить("ФИОНачальник",ТекущийНачальник);
			РеквезитыСправочников = ЗначенияРеквизитов;
			ИмяСправочника = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, РеквезитыСправочников);
			АдресСправочника = СформированьНаправлениеСМЭ(Ссылка);
			ОфисныеДокументы.Вставить(АдресСправочника,ИмяСправочника);
		КонецЦикла;	
		
		Возврат ОфисныеДокументы;
КонецФункции	
	
Функция СформированьНаправлениеСМЭ(Ссылка) Экспорт
	    
 	// Подготавливаем макет для формирования печатной формы OpenXML
    МакетДокумента = УправлениеПечатью.МакетПечатнойФормы("Справочник.ФизическиеЛица.ПФ_DOC_НаправлениеСМЭ");
    Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, Неопределено);
	
	// Создаем структуру областей формируемой печатной формы OpenXМL
	ОписаниеОбластей = Новый Структура;
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Основная", "Общая");
	//УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка", "Общая");
	//УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаТаблицы", "Общая");
	//УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СтрокаТаблицы", "СтрокаТаблицы");
	//УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал", "Общая");
	
	// Подготавливаем печатную форму в формате офисного документа
	ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);

	//получаем данные документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФЛ.Представление КАК ФизическоеЛицо,
		|	ФЛ.ДатаРождения КАК ДатаРождения,
		|	&ТекДата КАК Дата,
		|	ФЛ.АдресПрописка КАК АдресПрописки,
		|	&ФизическоеЛицоИнициалы КАК ФизическоеЛицоИнициалы,
		|	&ДолжностьНачальник КАК ДолжностьНачальник,
		|	&ФИОНачальник КАК ФИОНачальник
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФЛ
		|ГДЕ
		|	ФЛ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	Запрос.УстановитьПараметр("ФизическоеЛицоИнициалы",ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Ссылка));
	ТекущийНачальник = ПараметрыСеанса.ТекущийНачальникУправления;
	Запрос.УстановитьПараметр("ДолжностьНачальник",ТекущийНачальник.Должность);
	Запрос.УстановитьПараметр("ФИОНачальник",ТекущийНачальник);

	ДанныеДляПечати = Запрос.ВыполнитьПакет();

	Основная = ДанныеДляПечати[0].Выгрузить();
		
	ДанныеОсновная = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Основная[0]);
	ДанныеОсновная["Дата"] = Формат(ДанныеОсновная["Дата"], "ДФ=dd.MM.yyyy");
	ДанныеОсновная["ФизическоеЛицо"] = ДанныеОсновная["ФизическоеЛицо"];
	ДанныеОсновная["ДатаРождения"] = Формат(ДанныеОсновная["ДатаРождения"],"ДФ=dd.MM.yyyy");
	ДанныеОсновная["АдресПрописки"] = ДанныеОсновная["АдресПрописки"];
	ДанныеОсновная["ФизическоеЛицоИнициалы"] = ДанныеОсновная["ФизическоеЛицоИнициалы"];
	ДанныеОсновная["ДолжностьНачальник"]  = ДанныеОсновная["ДолжностьНачальник"];
	ДанныеОсновная["ФИОНачальник"]  = ДанныеОсновная["ФИОНачальник"];
	
	// Вывод области
	ОбластьОсновная = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Основная"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, ОбластьОсновная, ДанныеОсновная);
		
	
	// Помещаем сформированную печатную форму в соответствие ОфисныеДокументы
	АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	
	//удаление временных файлов
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);	
	УправлениеПечатью.ОчиститьСсылки(Макет);

	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции


