Функция ПроверкаФИОНаПовторение(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Наименование КАК Наименование,
		|	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
		|	ФизическиеЛица.Код КАК Код
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Наименование = &Наименование
		|	И ФизическиеЛица.Код <> &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		Сообщить("Физическое лицо - "+Выборка.Наименование + " День рождения: "+ Формат(Выборка.ДатаРождения,"ДФ=dd.MM.yyyy"));
	КонецЦикла;
	
	Возврат Отказ;
КонецФункции	

Процедура ПередЗаписью(Отказ)
	Отказ = ПроверкаФИОНаПовторение(Ложь);
КонецПроцедуры
