&НаСервере
Функция ПолучитьДниРожденияДетей(МассивДокументов)
	Возврат  Документы.ЛичноеДело.СформироватьПечатьДниРожденияДетей(МассивДокументов);
КонецФункции	

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабличныйДокумент = ПолучитьДниРожденияДетей(ПараметрКоманды);
	Если ТабличныйДокумент = Неопределено тогда
		Возврат;
	КонецЕсли;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.Защита = Ложь;
	ТабличныйДокумент.ТолькоПросмотр = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.Показать("Дни рождения детай");

КонецПроцедуры
