

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
ТекстHTML = "";
	Вложение = Новый Структура();
	ТекстПисьма.ПолучитьHTML(ТекстHTML,Вложение); 
	СтруктураФорматированногоДокумента = Справочники.ШаблоныПисем.ПустаяСтруктураШаблонаПисьма();
	СтруктураФорматированногоДокумента.ТекстHTML = ТекстHTML;
	СтруктураФорматированногоДокумента.Вложения = Вложение;	
	
	ТекущийОбъект.ШаблонХранилище = Новый ХранилищеЗначения(СтруктураФорматированногоДокумента, Новый СжатиеДанных(9));
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если ЗначениеЗаполнено(Объект.ИмяМакета) Тогда
	//	 Элементы.ВосстановитьТиповойШаблон.Видимость = Истина;
	//Иначе	
	//     Элементы.ВосстановитьТиповойШаблон.Видимость = Ложь;
	//КонецЕсли;  
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	    СсылкаНаШаблон = Объект.Ссылка;
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
	    СсылкаНаШаблон = Параметры.ЗначениеКопирования;
	КонецЕсли;                                         
	
	ЦветФонаЗаменяемогоПараметра = ПечатьДоговоров.ЦветФонаЗаменяемогоПараметра();   
	
	ТекстЗагружен = Ложь;
	
	Если ЗначениеЗаполнено(СсылкаНаШаблон) Тогда
	   ДанныеШаблона = Справочники.ШаблоныПисем.ДанныеШаблонаПисьма(СсылкаНаШаблон);
	   Если ЗначениеЗаполнено(ДанныеШаблона.ТекстHTML) Тогда
	   		ТекстПисьма.УстановитьHTML(ДанныеШаблона.ТекстHTML,ДанныеШаблона.Вложения);
			ТекстЗагружен = Истина;
	   КонецЕсли;		
    КонецЕсли; 
	
	// не помню зачем?
	//Если НЕ ТекстЗагружен И ЗначениеЗаполнено(Объект.ИмяМакета) Тогда
	//    // загружен из макета
	//	Макет = Справочники.ШаблоныПисем.ПолучитьМакет(Объект.ИмяМакета);
	//	Вложения = Новый Структура();
	//	ТекстПисьма.УстановитьHTML(Макет.ПолучитьТекст(),Вложения);
	//КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьТиповойШаблон(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВосстановитьТиповойШаблонЗавершение", ЭтотОбъект);

	ТекстВопроса = НСтр("ru = 'Заменить текущий шаблон письма на типовой?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры
