&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);      
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


//*****************************************************
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

//*****************************************************
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ДатаРожденияПриИзмененииНаКлиенте();
КонецПроцедуры


//*****************************************************

//4. Добавить в процедуру "ПослеЗаписи"
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
	


//*****************************************************


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры



// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
 Процедура АдресПропискиРавноФактуПроживания()
	Если Объект.АдресФактПроживанияИПропискаСовпадают = Истина Тогда
		Объект.АдресФактическогоПроживания = Объект.АдресПрописка;
	КонецЕсли;	

 КонецПроцедуры	 
&НаСервере
Процедура ОпределитьПол(Отчество)
	Пол = ФизическиеЛицаКлиентСервер.ПолучитьПол(Отчество);
	Объект.Пол = Пол;
КонецПроцедуры	


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ФИО = СокрЛП(Объект.Наименование);
	Пока СтрНайти(ФИО, "  ") > 0 Цикл
		ФИО = СтрЗаменить(ФИО, "  ", " ");
	КонецЦикла;
	
	СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
	
	Объект.Фамилия = СтруктураФИО.Фамилия;
	Объект.Имя = СтруктураФИО.Имя;
	Объект.Отчество = СтруктураФИО.Отчество;
	ОпределитьПол(СтруктураФИО.Отчество);
	
	

КонецПроцедуры

&НаКлиенте
Процедура АдресФактПроживанияИПропискаСовпадаютПриИзменении(Элемент)
	АдресПропискиРавноФактуПроживания();
КонецПроцедуры

&НаКлиенте
Процедура АдресПропискаПриИзменении(Элемент)
	АдресПропискиРавноФактуПроживания();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПаспортПриИзменении(Элемент)
	ТД =  Элементы.Документы.ТекущиеДанные;
	Если ТД.Паспорт Тогда
	   Объект.ПаспортСерия = ТД.Серия;
	   Объект.ПаспортНомер = ТД.Номер;
	   Объект.ПаспортДатаВыдачи  = ТД.ДатаВыдачи;
	   Объект.ПаспортДатаОкончания = ТД.ДатаОкончания;
	   Объект.ПаспортКемВыдан    = ТД.КемВыдан;
	   Объект.ВидДокумента = ТД.Наименование;
    Иначе
	   
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСоставСемьи(Команда)
	ПараметрыФормы = Новый Структура("Ключ", Объект.Ссылка);
   ОткрытьФорму("ОбщаяФорма.ФормаЗаполненияСоставаСемьи", ПараметрыФормы,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзмененииНаКлиенте()
	Если Объект.ДатаРождения = '00010101' Тогда
		Возраст ="";
		
	Иначе 
		ВозрастЛет = ОбщегоНазначенияКлиент.ВычислитьВозраст(Объект.ДатаРождения);
		Возраст =  Строка(ВозрастЛет)+" лет";
	КонецЕсли;	
	КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	ДатаРожденияПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСоставСемьи(Команда)
	ПараметрыФормы = Новый Структура("Ключ", Объект.Ссылка);
    ОткрытьФорму("ОбщаяФорма.ФормаЗаполненияСоставаСемьиПоОбъектам", ПараметрыФормы,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВыборЧленовСемьи(Команда)
	ПараметрыФормы = Новый Структура("МножественныйВыбор",Истина);
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",ПараметрыФормы,Элементы.СоставСемьи);
КонецПроцедуры

&НаКлиенте
Процедура СоставСемьиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Для Каждого ВыбранныйЭлемент из ВыбранноеЗначение Цикл
		НС = Объект.СоставСемьи.Добавить();
		НС.ФИО  = ВыбранныйЭлемент;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАдресПропискиНаСервере()
	Совпадение = Ложь;		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.АдресПрописка КАК АдресПрописка,
		|	ФизическиеЛица.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.АдресПрописка = &АдресПрописка";
	
	Запрос.УстановитьПараметр("АдресПрописка", Объект.АдресПрописка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщить(Выборка.Наименование +" Прописка - "+Выборка.АдресПрописка);
		Совпадение = Истина;
	КонецЦикла;
	
	Если Совпадение = Ложь Тогда
		Сообщить("Совпадения по адресам не найдено");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАдресПрописки(Команда)
	ПроверитьАдресПропискиНаСервере();
КонецПроцедуры


//&НаКлиенте
//Процедура ПриПовторномОткрытии()
//	 ДатаРожденияПриИзмененииНаСервере();
//КонецПроцедуры


 