Процедура УстановитьПараметрыСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
   
  ОпределитьТекущегоНачальника(ТекущаяДата());  
  
  УстановленныеПараметры.Добавить("ТекущийНачальникУправления");
               
КонецПроцедуры

Процедура ОпределитьТекущегоНачальника(Период) Экспорт
	   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаСрезПоследних.НачальникУправления КАК НачальникУправления
		|ИЗ
		|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Период, ) КАК УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПараметрыСеанса.ТекущийНачальникУправления =  Выборка.НачальникУправления;
	Иначе
		Сообщить("В регистре сведений 'Учетная политика' не указан BOSS всея управления");
	КонецЕсли;
	
	

КонецПроцедуры	
