&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


//*****************************************************
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

//*****************************************************
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


//*****************************************************

//4. Добавить в процедуру "ПослеЗаписи"
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
	


//*****************************************************


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//*****************************************************

&НаСервере
Процедура ЗаявительПриИзмененииНаСервере()
	Если Объект.Решение = Перечисления.Решение.Отказ Тогда
		 Объект.ОписаниеРешения = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявительПриИзменении(Элемент)
	ЗаявительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ШаблонРешенияПриИзмененииНаСервере()
	 ДокОбъект = РеквизитФормыВЗначение("Объект");
	 НомерТалона =  ДокОбъект.ОпределитьНомерТалона(Объект.Заявитель,Объект.ВидЛьготы);
	 Если (Объект.ВидЛьготы.Наименование = "предоставление права на приобретение твердого бытового топлива") И (НЕ НомерТалона = "") Тогда
		 Объект.ОписаниеРешения = Объект.ШаблонРешения.Текст + НомерТалона;
	 Иначе
		 Объект.ОписаниеРешения = Объект.ШаблонРешения.Текст;
	 КонецЕсли;	
	 
	 Если Объект.ДокументОснование.СформированТалон = Истина Тогда
		Объект.ОписаниеРешения = Объект.ШаблонРешения.Текст + НомерТалона;	
	 КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонРешенияПриИзменении(Элемент)
	ШаблонРешенияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()
	Объект.НомерЗаявленияДата = Строка(Объект.ДокументОснование.НомерЗаявления) + " от " + Строка(Формат(Объект.ДокументОснование.ДатаЗаявления,"ДФ=dd.MM.yyyy"));
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ДокументОснованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомиссиюНаСервере()
	Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи1 КАК ФИО1,
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи2 КАК ФИО2,
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи3 КАК ФИО3
			|ИЗ
			|	РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитикаСрезПоследних
			|ГДЕ
			|	УчетнаяПолитикаСрезПоследних.Организация = &Организация";
			
			Запрос.УстановитьПараметр("Организация", Объект.Организация);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Объект.Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО1;
				НоваяСтрока.Должность =  Выборка.ФИО1.Должность;
				НоваяСтрока = Объект.Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО2;
				НоваяСтрока.Должность =  Выборка.ФИО2.Должность;
				НоваяСтрока = Объект.Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО3;
				НоваяСтрока.Должность =  Выборка.ФИО3.Должность;
			КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомиссию(Команда)
	ЗаполнитьКомиссиюНаСервере();
КонецПроцедуры
