Функция ПодготовитьПараметрыПечатиТекстаписьма(ПисьмоОбъект) Экспорт
	РеквезитыПисьма = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПисьмоОбъект,
					"Организация,ВидПисьма,ТемаПисьма,Получатель,
					 |КонтактноеЛицоОрганизации,КонтактноеЛицо,
					 |НомерПисьма,ШаблонПисьма,СписокЛичныхДел,Приложение");
	
	//дополнительные поля
	ТекущийНачальник = ПараметрыСеанса.ТекущийНачальникУправления;
	РеквезитыПисьма.Вставить("РуководительФИО", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ТекущийНачальник)); // Фамилия Имя Отчество
	РеквезитыПисьма.Вставить("ТипОбъекта",ТипЗнч(ПисьмоОбъект));
	Возврат РеквезитыПисьма;
КонецФункции	


Функция ЗначениеПараметра(Знач ИмяПараметра, СведенияОбОбъекте, ЗначенияСоставногоПараметра, Успешно) Экспорт
	  Результат = Неопределено;
	  
	  Возврат Результат;
КонецФункции	