
&НаСервере
Процедура ЗаполнитьНаСервере()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДелоЗакрыть.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ЛДЗакрыто
		|ИЗ
		|	РегистрСведений.ЛичноеДелоЗакрыть КАК ЛичноеДелоЗакрыть
		|ГДЕ
		|	ЛичноеДелоЗакрыть.Период МЕЖДУ &ДатаНачало И &ДатаОкончания
		|	И ЛичноеДелоЗакрыть.Организация = &Организация
		|	И ЛичноеДелоЗакрыть.ВидЛьготы = &ВидЛьготы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичноеДелоЛьготыСрезПоследних.Регистратор 				КАК Регистратор,
		|	ЛичноеДелоЛьготыСрезПоследних.ВидЛьготы.ДатаОкончания 	КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ЛичноеДелоЛьготы.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И ВидЛьготы = &ВидЛьготы) КАК ЛичноеДелоЛьготыСрезПоследних
		|ГДЕ
		|	НЕ ЛичноеДелоЛьготыСрезПоследних.Регистратор В
		|				(ВЫБРАТЬ
		|					ЛДЗакрыто.Регистратор КАК Регистратор
		|				ИЗ
		|					ЛДЗакрыто КАК ЛДЗакрыто)";
	
	Запрос.УстановитьПараметр("ВидЛьготы", ВидЛьготы);
	Запрос.УстановитьПараметр("ДатаНачало", ДатаНачало);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	НомерСтроки = 1; 
	Пока Выборка.Следующий() Цикл
		НС = ТаблицаЛичныхДел.Добавить();
		НС.НомерСтроки = НомерСтроки;
		НС.ДокументСсылка = Выборка.Регистратор;
		НС.ДатаЗакрытия = Выборка.ДатаОкончания;
		НомерСтроки = НомерСтроки +1;
	КонецЦикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ТаблицаЛичныхДел.Очистить();
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьЛичныеДелаНаСервере()
	Для Каждого СтрокаТаб Из ТаблицаЛичныхДел Цикл
		ЛД =  СтрокаТаб.ДокументСсылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(СтрокаТаб.ДатаЗакрытия) Тогда
			Если ЛД.ДокПроводить = 	Истина	Тогда
				Если ЛД.ДелоЗакрыто = Ложь Тогда
					ЛД.ДелоЗакрыто = Истина;
					ЛД.ДатаЗакрытияДела = СтрокаТаб.ДатаЗакрытия;
					ЛД.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЛичныеДела(Команда)
	ЗакрытьЛичныеДелаНаСервере();
КонецПроцедуры
