
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ключ") Тогда
		  ФИОРодственник = Параметры.Ключ;
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура СоздатьНаСервере()
	Для Каждого СтрокаСемьи из СоставСемьи Цикл
		 ПоискФизЛиц = Справочники.ФизическиеЛица.НайтиПоНаименованию(СтрокаСемьи.ФИО);
		 
		 Если ПоискФизЛиц.Пустая() Тогда
			Объект = ФИОРодственник.ПолучитьОбъект(); 
		 	ФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
		 	ФизЛицо.Наименование = СтрокаСемьи.ФИО;
			СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СтрокаСемьи.ФИО);
	
			ФизЛицо.Фамилия = СтруктураФИО.Фамилия;
			ФизЛицо.Имя = СтруктураФИО.Имя;
			ФизЛицо.Отчество = СтруктураФИО.Отчество;
			Пол = ФизическиеЛицаКлиентСервер.ПолучитьПол(ФизЛицо.Отчество);
			ФизЛицо.Пол = Пол;
			ФизЛицо.Студент = СтрокаСемьи.Студент;
			
			ФизЛицо.ИНН = СтрокаСемьи.ИНН;
			ФизЛицо.СНИЛС = СтрокаСемьи.СНИЛС;
			ФизЛицо.АдресФактическогоПроживания = СтрокаСемьи.АдресФактическогоПроживания;
			ФизЛицо.ДатаРождения= СтрокаСемьи.ДатаРождения;
			ФизЛицо.АдресПрописка= СтрокаСемьи.АдресПрописка;
			Если СтрокаСемьи.АдресФактическогоПроживания =  СтрокаСемьи.АдресПрописка Тогда
				ФизЛицо.АдресФактПроживанияИПропискаСовпадают = Истина;
			КонецЕсли;	
			ФизЛицо.Гражданство = СтрокаСемьи.Гражданство;
			ФизЛицо.ВидДокумента = СтрокаСемьи.ВидДокумента;
			ФизЛицо.ПаспортСерия = СтрокаСемьи.ПаспортСерия;
			ФизЛицо.ПаспортНомер= СтрокаСемьи.ПаспортНомер;
			ФизЛицо.ПаспортДатаВыдачи = СтрокаСемьи.ПаспортДатаВыдачи;
			ФизЛицо.ПаспортКемВыдан = СтрокаСемьи.ПаспортКемВыдан;
			Паспорт = ФизЛицо.Документы.Добавить();
			Паспорт.Наименование = СтрокаСемьи.ВидДокумента;
			Паспорт.Серия = СтрокаСемьи.ПаспортСерия;
			Паспорт.Номер = СтрокаСемьи.ПаспортНомер;
			Паспорт.ДатаВыдачи = СтрокаСемьи.ПаспортДатаВыдачи;
			Паспорт.ДатаОкончания = СтрокаСемьи.ПаспортДатаОкончания;
			Паспорт.КемВыдан = СтрокаСемьи.ПаспортКемВыдан; 
			ФизЛицо.СельскийСовет = СтрокаСемьи.СельскийСовет;
		 	ФизЛицо.Записать();
			НоваяСтрока = Объект.СоставСемьи.Добавить();
			НоваяСтрока.ФИО = ФизЛицо.Ссылка;
			НоваяСтрока.Родство = СтрокаСемьи.Родство;
			Объект.Записать();
		 КонецЕсли;
	 КонецЦикла;
	 
	 //Если ФИОРодственник.СоставСемьи.Количество()> 0 Тогда
	 //    
	 //КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	СоздатьНаСервере();
КонецПроцедуры
