
&НаСервереБезКонтекста
Функция ВернутьСписокПодстановкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛьготныеКатегории.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЛьготныеКатегории КАК ЛьготныеКатегории";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	СписокВыбора = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если СписокВыбора.Количество() > 0 Тогда
        Возврат СписокВыбора;
    Иначе
        Возврат Неопределено;
    КонецЕсли;

КонецФункции


&НаКлиенте
Процедура ДокументыДляЛьготыЛьготныеКатегорииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокВыбора = ВернутьСписокПодстановкиНаСервере();
	
	ЭлементыПодстановки = СписокВыбора.ОтметитьЭлементы("Выберите льготные категории");
    КомплектностьСтрока = "";
    
    Если ЭлементыПодстановки = Истина Тогда
        
        ТЧ = Объект.КомплектностьДокумента;
        ТЧ.Очистить();
        
        Для Каждого ЭлементСписка Из СписокВыбора Цикл
            Если ЭлементСписка.Пометка Тогда
                СтрокаТЧ = ТЧ.Добавить();
                СтрокаТЧ.Подстановка = ЭлементСписка.Значение;
                КомплектностьСтрока  = КомплектностьСтрока + ЭлементСписка.Значение + ", ";
            КонецЕсли;
        КонецЦикла;
        
        КомплектностьСтрока  = Лев(КомплектностьСтрока, СтрДлина(КомплектностьСтрока) - 2);
        Элементы.ДокументыДляЛьготы.ТекущиеДанные.ЛьготныеКатегории = КомплектностьСтрока;
        Модифицированность   = Истина;
        
    КонецЕсли;
КонецПроцедуры

