&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


//*****************************************************
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

//*****************************************************
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ВидимостьРеквезитовМногодетнойСемьиПриОткрытии();
	ВидимостьРеквезитовМногодетнойСемьи();
	ВидимостьРеквезитовВыплаты();
	ВидимостьРеквезитовЛьготы();
	ВидимостьРеквезитовКомиссия();
	ВидимостьВсеРеквезиты();
	//Объект.ДатаЗаявления = ТекущаяДата();
КонецПроцедуры


//*****************************************************

//4. Добавить в процедуру "ПослеЗаписи"
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
	


//*****************************************************


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура ВидимостьРеквезитовМногодетнойСемьиПриОткрытии()
	 Элементы.ГруппаРеквезитыСправокСемьи.Видимость=Ложь;
	 Элементы.СоставСемьиДляСправкиМС.Видимость = Ложь;
	 //Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ПодменюПечать.Видимость=Истина;
КонецПроцедуры	
&НаКлиенте
Процедура ВидимостьРеквезитовМногодетнойСемьи()
	Если Объект.МногодетнаяСемья=Истина Тогда
		 Элементы.ГруппаРеквезитыСправокСемьи.Видимость=Истина;
		 Элементы.СоставСемьиДляСправкиМС.Видимость = Истина;
	 Иначе 
		 Элементы.ГруппаРеквезитыСправокСемьи.Видимость=Ложь;
		  Элементы.СоставСемьиДляСправкиМС.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры	
&НаКлиенте
Процедура ВидимостьРеквезитовВыплаты()
	Если Объект.Выплата = Истина Тогда
		Элементы.ВидыВыплатШапка.Видимость= Истина;
		Элементы.ГруппаВыплаты.Видимость = Истина;
	Иначе
		Элементы.ВидыВыплатШапка.Видимость= Ложь;
		Элементы.ГруппаВыплаты.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Процедура ВидимостьРеквезитовЛьготы()
	Если Объект.Льгота = Истина Тогда
		Элементы.ВидыЛьготыШапка.Видимость= Истина;
		Элементы.ГруппаЛьготы.Видимость = Истина;
	Иначе
		
		Элементы.ВидыЛьготыШапка.Видимость= Ложь;
		Элементы.ГруппаЛьготы.Видимость = Ложь;
	КонецЕсли;	

КонецПроцедуры
&НаКлиенте
Процедура ВидимостьРеквезитовКомиссия()
	Если Объект.Комиссия = Истина Тогда
		Элементы.Комиссия.Видимость = Истина;
	Иначе
		Элементы.Комиссия.Видимость = Ложь;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.ПричинаКомиссии) Тогда
		Элементы.Комиссия.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры	
&НаКлиенте
Процедура ВидимостьВсеРеквезиты()
	Если Объект.ОтобразитьВсеРеквезиты=Истина Тогда
		Элементы.ВидыЛьготыШапка.Видимость= Истина;
		Элементы.ГруппаЛьготы.Видимость = Истина;
		
		Элементы.ВидыВыплатШапка.Видимость= Истина;
		Элементы.ГруппаВыплаты.Видимость = Истина;
		
		Элементы.ГруппаРеквезитыСправокСемьи.Видимость=Истина;
		Элементы.СоставСемьиДляСправкиМС.Видимость = Истина;
		
		Элементы.Комиссия.Видимость = Истина

	КонецЕсли;	
	Если Объект.ОтобразитьВсеРеквезиты=Ложь Тогда
		ВидимостьРеквезитовМногодетнойСемьи();
		ВидимостьРеквезитовВыплаты();
		ВидимостьРеквезитовЛьготы();
		ВидимостьРеквезитовКомиссия();
	КонецЕсли;
КонецПроцедуры	
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
&НаКлиенте
Процедура ОпределитьВозрастПриОткрытии()
	Если Объект.ДокументыМС.Количество() > 0 Тогда  
		Для Каждого СтрокаТаб из Объект.ДокументыМС Цикл
			СтрокаТаб.Возраст = ОбщегоНазначенияКлиентСервер.ВычислитьВозраст(СтрокаТаб.ДеньРожденияМС);	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//*****************************************************
&НаСервере
Функция ОпределитьНомерЗаявления()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЛичноеДело.НомерЗаявления ЕСТЬ NULL
		|				ТОГДА 1
		|		КОНЕЦ) КАК НомерЗаявления
		|ИЗ
		|	Документ.ЛичноеДело КАК ЛичноеДело
		|ГДЕ
		|	ЛичноеДело.ДатаЗаявления МЕЖДУ &ДатаЗаявления1 И &ДатаЗаявления2
		|	И ЛичноеДело.Льгота = ИСТИНА
		|	И ЛичноеДело.ВидыЛьготыШапка = &ВидыЛьготыШапка";
	
	Запрос.УстановитьПараметр("ДатаЗаявления1", НачалоГода(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаЗаявления2", КонецГода(Объект.Дата));
	Запрос.УстановитьПараметр("ВидыЛьготыШапка", Объект.ВидыЛьготыШапка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		 Возврат Выборка.НомерЗаявления;
	КонецЕсли;
	Возврат 1;
КонецФункции	

&НаСервере
Функция ОпределяемСовпадениеСтрокВМасситве(МассивСтрок,СтрокаПроверкиНаСовпадение)
	Совпадение = Ложь;
	Для каждого ТекСтр Из МассивСтрок Цикл
	    Если СокрЛП(ТекСтр) = СокрЛП(СтрокаПроверкиНаСовпадение) Тогда
			 Совпадение = Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Совпадение;

КонецФункции // ОпределяемДокумент()
 
&НаСервере
Процедура ВидыЛьготыНаименованиеПриИзмененииНаСервере(Льгота,КатегорияЛьготныхЛиц)
	Для каждого ТекСтрока Из Льгота.ДокументыДляЛьготы Цикл
	     мПодстрокаЛьготты = СтрРазделить(ТекСтрока.ЛьготныеКатегории,",");
		 ДобавитьДокумент = ОпределяемСовпадениеСтрокВМасситве(мПодстрокаЛьготты,КатегорияЛьготныхЛиц);
		 Если ДобавитьДокумент Тогда
		 	НС = Объект.СписокДокументовПредоставлено.Добавить();
			НС.Документ = ТекСтрока.Наименование;
		 КонецЕсли;	 
		
	
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура ДокДляЛьготы()
	
КонецПроцедуры	
&НаКлиенте
Процедура ВидыЛьготыНаименованиеПриИзменении(Элемент)
	 ТД = Элементы.ВидыЛьготы.ТекущиеДанные;
	 ВидыЛьготыНаименованиеПриИзмененииНаСервере(ТД.Наименование,ТД.ЛьготнаяКатегория);
КонецПроцедуры


&НаКлиенте
Процедура АдресФактПроживанияИПропискаСовпадаютПриИзменении(Элемент)
	Если Объект.АдресФактПроживанияИПропискаСовпадают = Истина Тогда
		Объект.АдресПрописка = Объект.АдресФактическогоПроживания;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоставСемьиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Объект.СоставСемьиКоличество = Объект.СоставСемьи.Количество()+1;
КонецПроцедуры

&НаКлиенте
Процедура СоставСемьиПередУдалением(Элемент, Отказ)
	Объект.СоставСемьиКоличество =  Объект.СоставСемьиКоличество - 1;
КонецПроцедуры
&НаКлиенте
Процедура СписокДокументов()



КонецПроцедуры
 
&НаКлиенте
Процедура СписокДокументовПредоставленоКоличествоДокументовПриИзменении(Элемент)
	ТД = Элементы.СписокДокументовПредоставлено.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТД.КоличествоДокументов) Тогда
		ТД.Предоставлен  = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	//СписокДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ВидыЛьготыШапкаПриИзменении(Элемент)
	//ТД = Элементы.ВидыЛьготы.ТекущиеДанные;
	Если Объект.ВидыЛьготы.Количество() =0 Тогда
		НоваяСтрока = Объект.ВидыЛьготы.Добавить();
		НоваяСтрока.Наименование = Объект.ВидыЛьготыШапка;
		НоваяСтрока.ЛьготнаяКатегория = Объект.ЛьготнаяКатегория;
		Объект.Льгота = Истина;
		ВидыЛьготыНаименованиеПриИзмененииНаСервере(НоваяСтрока.Наименование,НоваяСтрока.ЛьготнаяКатегория);
	КонецЕсли;
	Объект.НомерЗаявления = ОпределитьНомерЗаявленияПоВидуЛьготы();
	КонецПроцедуры

&НаСервере
Функция  ВидыЛьготыПредметЛьготыПриИзмененииНаСервере(ПредметЛьготы)
	Льгота = Новый Массив;
	Льгота.Добавить(ПредметЛьготы.Количество);
	Льгота.Добавить( ПредметЛьготы.ЕденицыИзмерения);
	Возврат Льгота;

КонецФункции

&НаКлиенте
Процедура ВидыЛьготыПредметЛьготыПриИзменении(Элемент)
	ТД = Элементы.ВидыЛьготы.ТекущиеДанные;
	Льгота = ВидыЛьготыПредметЛьготыПриИзмененииНаСервере(ТД.ПредметЛьготы);
	ТД.Измерение  = Льгота[1];
	ТД.Показатель = Льгота[0];
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	НомерЗаявления = ОпределитьНомерЗаявления();
	
	Если Не ЗначениеЗаполнено(Объект.НомерЗаявления) Тогда 
		Объект.НомерЗаявления = НомерЗаявления;
		Объект.ДатаЗаявления = Объект.Дата;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыКомиссияКоличествоДокументовПриИзменении(Элемент)
	ТД = Элементы.ДокументыКомиссия.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТД.КоличествоДокументов) Тогда
		ТД.Предоставлен  = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПричинаКомиссииПриИзменении(Элемент)
	//Если ЗначениеЗаполнено(Объект.ПричинаКомиссии) Тогда 
	//	 Объект.Комиссия=Истина; 
	//КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоставСемьиНаСервере()
	Если Объект.Заявитель.СоставСемьи.Количество() > 0 Тогда
		 КоличествоЧленовВСемье = 1;
		 Для каждого Стр Из Объект.Заявитель.СоставСемьи Цикл
		    НоваяСтрока = Объект.СоставСемьи.Добавить();
			НоваяСтрока.ФИО = Стр.ФИО;
		 	НоваяСтрока.Родство = Стр.Родство;
			КоличествоЧленовВСемье = КоличествоЧленовВСемье+1;
		 КонецЦикла;
		 Объект.СоставСемьиКоличество = КоличествоЧленовВСемье;
	 Иначе
		 Сообщить("У Заявителя не заполнен состав семьи");
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСоставСемьи(Команда)
	Объект.СоставСемьи.Очистить();
	ЗаполнитьСоставСемьиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЛьготнаяКатегорияПриИзмененииНаСервере()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛицаЛьготныеКатегории.Группа КАК Группа
		|ИЗ
		|	Справочник.ФизическиеЛица.ЛьготныеКатегории КАК ФизическиеЛицаЛьготныеКатегории,
		|	Документ.ЛичноеДело КАК ЛичноеДело
		|ГДЕ
		|	ФизическиеЛицаЛьготныеКатегории.Ссылка = &СсылкаЗаявитель
		|	И ФизическиеЛицаЛьготныеКатегории.Категория = &Категория";
	
	Запрос.УстановитьПараметр("Категория", Объект.ЛьготнаяКатегория);
	Запрос.УстановитьПараметр("СсылкаЗаявитель", Объект.Заявитель.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		 Объект.Группа = Выборка.Группа;
	КонецЕсли;
	
	

КонецПроцедуры

&НаКлиенте
Процедура ЛьготнаяКатегорияПриИзменении(Элемент)
	ЛьготнаяКатегорияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МногодетнаяСемьяПриИзменении(Элемент)
	ВидимостьРеквезитовМногодетнойСемьи();
	Если Объект.МногодетнаяСемья = Истина Тогда
		 Объект.НомерЗаявления = ОпределитьНомерЗаявленияМногодетнойСемьи();
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ЛьготаПриИзменении(Элемент)
	ВидимостьРеквезитовЛьготы();
КонецПроцедуры
&НаКлиенте
Процедура ВыплатаПриИзменении(Элемент)
	ВидимостьРеквезитовВыплаты();
КонецПроцедуры
&НаКлиенте
Процедура Комиссия1ПриИзменении(Элемент)
	ВидимостьРеквезитовКомиссия();
КонецПроцедуры
&НаКлиенте
Процедура ОтобразитьВсеРеквезитыПриИзменении(Элемент)
	ВидимостьВсеРеквезиты();
КонецПроцедуры

&Насервере
Функция ФИОРебенкаДляОпределенияСрокаСправкиМС()
	ДатаПрисвоениеСтатуса = Дата(1,1,1);
	ДатаСнятияСтатуса     = Дата(1,1,1);
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДелоСоставСемьи.ФИО КАК ФИО,
		|	ЛичноеДелоСоставСемьи.ФИО.ДатаРождения КАК ФИОДатаРождения,
		|	ЛичноеДелоСоставСемьи.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|ГДЕ
		|	ЛичноеДелоСоставСемьи.Ссылка = &Ссылка
		|	И (ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.дочь)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.сын))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИОДатаРождения УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ПоследнийИндекс = РезультатЗапроса.Количество()-1;
	
	ДР_Младший_НачалоМесяца = НачалоМесяца(РезультатЗапроса.Получить(0).ФИОДатаРождения);
	ДР_Старший              = РезультатЗапроса.Получить(ПоследнийИндекс).ФИОДатаРождения;
	ДР_Старший_НачалоМесяца = НачалоМесяца(ДР_Старший);
	Дата_Старший_Исполнится18лет = ДобавитьМесяц(ДР_Старший,12*18);
	
	ДатаЗаявления_НачалоМесяца = НачалоМесяца(Объект.ДатаЗаявления);
	КонтрольнаяДата6_йМесяц = ДобавитьМесяц(ДР_Младший_НачалоМесяца,1); 
	
	Если (ДР_Младший_НачалоМесяца < ДатаЗаявления_НачалоМесяца) И (ДатаЗаявления_НачалоМесяца <КонтрольнаяДата6_йМесяц ) Тогда
		ДатаПрисвоениеСтатуса = ДР_Младший_НачалоМесяца;
	ИначеЕсли КонтрольнаяДата6_йМесяц < ДатаЗаявления_НачалоМесяца 	Тогда 
		ДатаПрисвоениеСтатуса = ДатаЗаявления_НачалоМесяца;
	КонецЕсли;	
	
	ДатаСнятияСтатуса = ДобавитьМесяц(НачалоМесяца(Дата_Старший_Исполнится18лет),1);
	
	СтруктураДатДляСтатусаМС = Новый Структура("ДатаПрисвоениеСтатуса,ДатаСнятияСтатуса");
	СтруктураДатДляСтатусаМС.Вставить("ДатаПрисвоениеСтатуса",ДатаПрисвоениеСтатуса);
	СтруктураДатДляСтатусаМС.Вставить("ДатаСнятияСтатуса",ДатаСнятияСтатуса);
	

	Возврат СтруктураДатДляСтатусаМС;
КонецФункции	

&НаСервере
Функция СформироватьДанныеДляОпределенияПериодаДокумента()
	ДатаКонецПериода = Дата(1,1,1); 
	РебенокДРФИО = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 3
		|	ЛичноеДелоСоставСемьи.ФИО КАК ФИО,
		|	ЛичноеДелоСоставСемьи.ФИО.ДатаРождения КАК ФИОДатаРождения
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|ГДЕ
		|	ЛичноеДелоСоставСемьи.Ссылка = &Ссылка
		|	И (ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.дочь)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.сын))
		|	И РАЗНОСТЬДАТ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения, ЛичноеДелоСоставСемьи.Ссылка.ДатаЗаявления, ГОД) <= 18
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИОДатаРождения УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВременнаяТаблица.ФИО КАК ФИО,
		|	ВременнаяТаблица.ФИОДатаРождения КАК ФИОДатаРождения
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИОДатаРождения";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаКонецПериода =  ОбщегоНазначенияКлиентСервер.ДобавитьКолЛетКДате(Выборка.ФИОДатаРождения,18);
		ФИО = Выборка.ФИО;
		РебенокДРФИО.Добавить(ДатаКонецПериода);
		РебенокДРФИО.Добавить(ФИО); 
	КонецЕсли;	
	
	Возврат РебенокДРФИО ;
КонецФункции	
&НаСервере
Функция ПоискДокумента()
	Возврат Справочники.ДокументыПоВидам.УдостоверениеМногодетнойМатери;
КонецФункции
&НаСервере
Функция ПолучитьОрганизацию()
	ОриентацияВыдавшая = Справочники.ОрганизацииВыдающиеДокументы.НайтиПоКоду("000098").Наименование;
	Возврат  Справочники.ОрганизацииВыдающиеДокументы.НайтиПоНаименованию(ОриентацияВыдавшая);
КонецФункции	
&НаСервере
Функция ПолучитьДеньРождения(ФИО)
	Возврат ФИО.ДатаРождения;
КонецФункции
&НаСервере
Функция ДР_Заявителя()
	 Возврат Объект.Заявитель.ДатаРождения;
КонецФункции
&НаСервере
Функция ОпределитьСтудента(ФИО)
	 Возврат ФИО.Студент;
КонецФункции	
&НаСервере
Функция ОпределитьРодство(ФИО)
	Если ФИО.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
		Возврат Справочники.Родство.мать;
	Иначе
		Возврат Справочники.Родство.отец;
	КонецЕсли;	
КонецФункции	
&НаСервере
Функция ОпределитьМать_Отец_Дети(Родство)
	Перем Родыч;
	Если Родство = Справочники.Родство.супруг Тогда 
		Родыч = Справочники.Родство.отец;
	ИначеЕсли Родство = Справочники.Родство.супруга Тогда 
		Родыч = Справочники.Родство.мать;
	Иначе 
		Родыч = Родство;
	КонецЕсли;	
	Возврат Родыч;
КонецФункции

&НаКлиенте
Процедура ДляСправкиМС(Команда)
	
	Объект.ДокументыМС.Очистить();
	//ДатыДляПрисвоенияСтатуса = ФИОРебенкаДляОпределенияСрокаСправкиМС();
	РебенокДРФИО =  СформироватьДанныеДляОпределенияПериодаДокумента();
	ДатаОкончанияПериодаРодителям  = РебенокДРФИО[0];
	НС = Объект.ДокументыМС.Добавить();
	НС.ФизическоеЛицоМС = Объект.Заявитель;
	НС.НаименованиеМС = ПоискДокумента();
	ДРЗ =   ДР_Заявителя();
	НС.ДеньРожденияМС = ДРЗ;
	НС.Возраст =  ОбщегоНазначенияКлиент.ВычислитьВозраст(ДРЗ);
	НС.Родство = ОпределитьРодство(Объект.Заявитель);
	НС.ДатаВыдачиМС = Объект.ДатаЗаявления;
	НС.ДатаОкончанияМС   = ДатаОкончанияПериодаРодителям;
	НС.КемВыданМС = ПолучитьОрганизацию();
	КоличествоДетей = 0;
	Для каждого Стр из Объект.СоставСемьи Цикл 
		ДР = ПолучитьДеньРождения(Стр.ФИО);
		Возраст = ОбщегоНазначенияКлиент.ВычислитьВозраст(ДР);
		Студент = ОпределитьСтудента(Стр.ФИО);

		//Если Возраст >= 7 Тогда
			//Если (Стр.Родство = ПредопределенноеЗначение("Справочник.Родство.сын"))ИЛИ (Стр.Родство = ПредопределенноеЗначение("Справочник.Родство.дочь"))Тогда
			//	Если Возраст > 18 Тогда 
			//		Продолжить;
			//	КонецЕсли;
			//КонецЕсли; 	  
			НоваяСтрока = Объект.ДокументыМС.Добавить();
			
			
			НоваяСтрока.НаименованиеМС = ПоискДокумента();
			НоваяСтрока.ФизическоеЛицоМС = Стр.ФИО;
			НоваяСтрока.Родство = ОпределитьМать_Отец_Дети(Стр.Родство);
			Если Студент Тогда
				НоваяСтрока.Описание = "Студент";
			КонецЕсли;	
			НоваяСтрока.ДеньРожденияМС  = ДР;
			НоваяСтрока.Возраст = Возраст;
			НоваяСтрока.ДатаВыдачиМС = Объект.ДатаЗаявления;
			ДляОтметки = РебенокДРФИО[1];
			Если Стр.ФИО = ДляОтметки Тогда
				НоваяСтрока.Отметка = Истина;
			КонецЕсли;

			Если (Стр.Родство = ПредопределенноеЗначение("Справочник.Родство.супруг")) ИЛИ (Стр.Родство = ПредопределенноеЗначение("Справочник.Родство.супруга")) 
				ИЛИ (Стр.Родство = ПредопределенноеЗначение("Справочник.Родство.мать")) ИЛИ (Стр.Родство = ПредопределенноеЗначение("Справочник.Родство.отец")) Тогда
				НоваяСтрока.ДатаОкончанияМС = ДатаОкончанияПериодаРодителям;
			Иначе	   
				
				Если Возраст < 14  Тогда
					ДатаОкончанияПериода  = ОбщегоНазначенияКлиент.ДобавитьКолЛетКДате(ДР,14);
					Если ДатаОкончанияПериода > ДатаОкончанияПериодаРодителям Тогда 
						НоваяСтрока.ДатаОкончанияМС = ДатаОкончанияПериодаРодителям;
					Иначе
						НоваяСтрока.ДатаОкончанияМС = ДатаОкончанияПериода;
					КонецЕсли;	
				ИначеЕсли  Возраст >= 14  Тогда
					ДатаОкончанияПериода = ОбщегоНазначенияКлиент.ДобавитьКолЛетКДате(ДР,18);
					Если ДатаОкончанияПериода > ДатаОкончанияПериодаРодителям Тогда
						НоваяСтрока.ДатаОкончанияМС = ДатаОкончанияПериодаРодителям;	
					Иначе
						НоваяСтрока.ДатаОкончанияМС = ДатаОкончанияПериода;
					КонецЕсли;	
					
				КонецЕсли;	
				КоличествоДетей = КоличествоДетей +1;
			КонецЕсли; 
			НоваяСтрока.КемВыданМС = ПолучитьОрганизацию(); 
			Если НоваяСтрока.Отметка = Истина И Студент Тогда
				   //?
			КонецЕсли;	
		//КонецЕсли;
	КонецЦикла;	
	  
	  Объект.ДокументыМС.Сортировать("ДеньРожденияМС Возр");
	  Объект.КоличествоДетейМС = КоличествоДетей;
КонецПроцедуры


&НаСервере
Функция ДокументыМСФизическоеЛицоМСПриИзмененииНаСервере(ФЛ)
	Возврат ФЛ.ДатаРождения;	
КонецФункции


&НаКлиенте
Процедура ДокументыМСФизическоеЛицоМСПриИзменении(Элемент)
	ТД = Элементы.ДокументыМС.ТекущиеДанные;
	ТД.ДеньРожденияМС = ДокументыМСФизическоеЛицоМСПриИзмененииНаСервере(ТД.ФизическоеЛицоМС);
КонецПроцедуры

&НаКлиенте
Процедура ПринялПриИзменении(Элемент)
	Объект.ДатаПринял = Объект.ДатаЗаявления;
КонецПроцедуры

&НаКлиенте
Процедура ПроверилПриИзменении(Элемент)
	Объект.ДатаПроверил = Объект.ДатаЗаявления;
КонецПроцедуры

&НаКлиенте
Процедура РешениеКомиссииРешениеКомиссииТекстПриИзменении(Элемент)
	ТД = Элементы.РешениеКомиссии.ТекущиеДанные;
	Объект.РешениеКомиссииТекст = ТД.РешениеКомиссииТекст;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСправочникФЛНаСервере()
	Для Каждого СтрокаДок из Объект.ДокументыМС Цикл
		 ФЛ  = СтрокаДок.ФизическоеЛицоМС.ПолучитьОбъект();
		 НС 			  =  ФЛ.Документы.Добавить();
		 НС.Наименование  = СтрокаДок.НаименованиеМС;
		 НС.Серия         = СтрокаДок.СерияМС;
		 НС.Номер         = СтрокаДок.НомерМС;
		 НС.ДатаВыдачи    = СтрокаДок.ДатаВыдачиМС;
		 НС.ДатаОкончания = СтрокаДок.ДатаОкончанияМС;
		 НС.КемВыдан      = СтрокаДок.КемВыданМС;
		 ФЛ.Записать();
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСправочникФЛ(Команда)
	ЗаполнитьСправочникФЛНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПричинаЗакрытияДелаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ПричинаЗакрытияДела) тогда
		 Объект.ДатаЗакрытияДела = ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияДелаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаЗакрытияДела) Тогда
		Объект.ДелоЗакрыто=Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДелоЗакрытоПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ДатаЗакрытияДела) Тогда
		 Объект.ДатаЗакрытияДела = ТекущаяДата();
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыМСДатаРегистрацииДокументаМСПриИзменении(Элемент)
	
	ТД = Элементы.ДокументыМС.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТД.ДатаРегистрацииДокументаМС) Тогда 
		ТД.ДатаВыдачиМС = ТД.ДатаРегистрацииДокументаМС;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыМСДеньРожденияМСПриИзменении(Элемент)
	ТД = Элементы.ДокументыМС.ТекущиеДанные;
	ТД.Возраст = ОбщегоНазначенияКлиентСервер.ВычислитьВозраст(ТД.ДеньРожденияМС);
КонецПроцедуры
&НаКлиенте
Процедура ПоследнееЗаявление()
	КоличествоСтрок = Объект.ТаблицаЗаявлений.Количество();
	Объект.НомерЗаявления = Объект.ТаблицаЗаявлений.Получить(КоличествоСтрок-1).НомерЗаявления;
	Объект.ДатаЗаявления = Объект.ТаблицаЗаявлений.Получить(КоличествоСтрок-1).ДатаЗаявления;
КонецПроцедуры	

&НаКлиенте
Процедура ТаблицаЗаявленийДатаЗаявленияПриИзменении(Элемент)
	ПоследнееЗаявление();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьТекущееЗаявление(Команда)
	 ПоследнееЗаявление();
КонецПроцедуры


&НаСервере
Функция  ОпределитьНомерТалона ()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НумирацияТалоновСрезПоследних.ПоследнийНомерТалона 								КАК ПоследнийНомерТалона
		|ИЗ
		|	РегистрСведений.НумирацияТалонов.СрезПоследних(, ВидЛьготы = &ВидЛьготы) КАК НумирацияТалоновСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЛьготы", Объект.ВидыЛьготыШапка);
	//Запрос.УстановитьПараметр("Период", Объект.ДатаЗаявления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПоследнийНомерТалона = Число(Формат(СтрЗаменить(Выборка.ПоследнийНомерТалона," ",""),"ЧГ=0"));
		Возврат Строка(ПоследнийНомерТалона + 1);
	КонецЕсли;
	
	  Возврат "Ой";

КонецФункции	


&НаКлиенте
Процедура ПрисвоитьТалонПриИзменении(Элемент)
		Если Объект.ПрисвоитьТалон = Истина Тогда
			Объект.НомерТалона = ОпределитьНомерТалона();
		Иначе
			Объект.НомерТалона = "";
		КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаявление(Команда)
	НоваяСтрока = Объект.ТаблицаЗаявлений.Добавить();
	НоваяСтрока.НомерЗаявления = Объект.НомерЗаявления;
	НоваяСтрока.ДатаЗаявления  = Объект.ДатаЗаявления;
КонецПроцедуры

&НаСервере
Функция ОпределитьНомерЗаявленияПоВидуЛьготы()
	ДатаНачалоПериода = Объект.ВидыЛьготыШапка.ДатаНачала;
	НумерацияЗаявленийСначалаВНовомГоду = Объект.ВидыЛьготыШапка.НумерацияЗаявленийСначалаВНовомГоду;
	Если ДатаНачалоПериода = Дата(1,1,1) Тогда
		Сообщить("В сравочнике 'Виды льгот' заполните дату начала льготы, хотя бы предлезительно!!!");
		Возврат "";
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫРАЗИТЬ(ЛичноеДело.НомерЗаявления КАК ЧИСЛО(15, 0)) КАК НомерЗаявления
		|ИЗ
		|	Документ.ЛичноеДело КАК ЛичноеДело
		|ГДЕ
		|	ЛичноеДело.ВидыЛьготыШапка = &ВидыЛьготыШапка
		|	И ЛичноеДело.ДатаЗаявления МЕЖДУ &ДатаНачало И &ДатаОкончание
		|	И ЛичноеДело.Проведен = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерЗаявления УБЫВ";
	
	Запрос.УстановитьПараметр("ВидыЛьготыШапка", Объект.ВидыЛьготыШапка);
	Если НумерацияЗаявленийСначалаВНовомГоду Тогда
		Запрос.УстановитьПараметр("ДатаНачало", НачалоГода(Объект.Дата));
	Иначе
		Запрос.УстановитьПараметр("ДатаНачало", НачалоГода(ДатаНачалоПериода));	
	КонецЕсли;	
	Запрос.УстановитьПараметр("ДатаОкончание", КонецГода(Объект.Дата));
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Строка(Выборка.НомерЗаявления+1);
	Иначе
		Возврат 1;
	КонецЕсли;
	
	
	КонецФункции	


&НаСервере
Функция ОпределитьНомерЗаявленияМногодетнойСемьи()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫРАЗИТЬ(ЛичноеДело.НомерЗаявления КАК ЧИСЛО(15, 0)) КАК НомерЗаявления,
		|	ГОД(ЛичноеДело.ДатаЗаявления) КАК ГодВЗаявлении
		|ИЗ
		|	Документ.ЛичноеДело КАК ЛичноеДело
		|ГДЕ
		|	ЛичноеДело.МногодетнаяСемья = ИСТИНА
		|	И ЛичноеДело.Проведен = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛичноеДело.ДатаЗаявления УБЫВ";
	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		//Если Выборка.ГодВЗаявлении < Год(Объект.Дата) Тогда
		//	Возврат "1";
		//Иначе	
			Возврат Строка(Выборка.НомерЗаявления+1);
		//КонецЕсли;	
	Иначе
		Возврат "";
	КонецЕсли;

	
КонецФункции	


&НаКлиенте
Процедура ВидыЛьготыЛьготнаяКатегорияПриИзменении(Элемент)
	ТД = Элементы.ВидыЛьготы.ТекущиеДанные;
	ВидыЛьготыНаименованиеПриИзмененииНаСервере(ТД.Наименование,ТД.ЛьготнаяКатегория);
КонецПроцедуры



