Функция ОпределитьНомерТалона(Заявитель,ВидЛьготы)      Экспорт

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныНаЛьготыСрезПоследних.Номер КАК НомерТалона,
		|	ТалоныНаЛьготыСрезПоследних.ДатаВыдачи КАК ДатаВыдачи
		|ИЗ
		|	РегистрСведений.ТалоныНаЛьготы.СрезПоследних(
		|			,
		|			ВидЛьготы = &ВидЛьготы
		|				И Заявитель = &Заявитель) КАК ТалоныНаЛьготыСрезПоследних";
	
	Запрос.УстановитьПараметр("Заявитель", Заявитель);
	Запрос.УстановитьПараметр("ВидЛьготы", ВидЛьготы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат " Талон №"+Выборка.НомерТалона + " от " + Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy")+"г.";
	КонецЕсли;
	
	Возврат "";


КонецФункции // ОпределитьНомерТалона()
Функция ОпределитьДатыСтатусаМногодетной(ДанныеЗаполнения) Экспорт
	Результат = Неопределено;
	СтруктураДат = Новый Структура("ДатаНачало,ДатаОкончания");   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДелоДокументыМС.ДатаВыдачиМС КАК ДатаВыдачиМС,
		|	ЛичноеДелоДокументыМС.ДатаОкончанияМС КАК ДатаОкончанияМС
		|ИЗ
		|	Документ.ЛичноеДело.ДокументыМС КАК ЛичноеДелоДокументыМС
		|ГДЕ
		|	ЛичноеДелоДокументыМС.ФизическоеЛицоМС = ЛичноеДелоДокументыМС.Ссылка.Заявитель
		|	И ЛичноеДелоДокументыМС.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураДат.Вставить("ДатаНачало",Выборка.ДатаВыдачиМС);
		СтруктураДат.Вставить("ДатаОкончания",Выборка.ДатаОкончанияМС);
		Результат = СтруктураДат;
	КонецЕсли;
	
	 Возврат Результат;

КонецФункции	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛичноеДело") Тогда
		// Заполнение шапки
		Дата = ДанныеЗаполнения.Дата;
		Заявитель = ДанныеЗаполнения.Заявитель;
		ЛьготнаяКатегория = ДанныеЗаполнения.ЛьготнаяКатегория;
		Организация = ДанныеЗаполнения.Организация;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ВидЛьготы = ДанныеЗаполнения.ВидыЛьготыШапка;
		//НомерТалонаДатаВыдачи = ОпределитьНомерТалона(Заявитель);
		НомерЗаявленияДата = Строка(ДокументОснование.НомерЗаявления) +" от " + Строка(Формат(ДокументОснование.ДатаЗаявления,"ДФ=dd.MM.yyyy"))+"г.";
		Если НЕ ЗначениеЗаполнено(ВидЛьготы) И ДанныеЗаполнения.МногодетнаяСемья = Истина Тогда
			 СтруктураДат = ОпределитьДатыСтатусаМногодетной(ДанныеЗаполнения);
			 ДатаНачало = СтруктураДат.ДатаНачало;
			 ДатаОкончания =  СтруктураДат.ДатаОкончания;
		КонецЕсли;	
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Решение) И ЗначениеЗаполнено(ВидЛьготы) Тогда
			Решение = ДанныеЗаполнения.Решение;
			Если Решение = Перечисления.Решение.Утвердить Тогда
				ДатаНачало = Дата;
				ДатаОкончания = ВидЛьготы.ДатаОкончания;
			КонецЕсли;
		Иначе	
			Решение = Перечисления.Решение.Утвердить;
			Если Решение = Перечисления.Решение.Утвердить Тогда
				ОписаниеРешения = "На основании п 3.2.1. Указа от 13.09.2022 №316у в результате положительного расмотрения заявления
							   |выдается талон на льготное приобритение ТБУ(угля) выдан " + ОпределитьНомерТалона(Заявитель,ВидЛьготы);
			КонецЕсли;	
		КонецЕсли;	
		//Если ДанныеЗаполнения.СформированТалон = Истина Тогда
		//	
		//КонецЕсли;	
		Если Решение = Перечисления.Решение.Отказ Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписиОтказ1 КАК ФИО1,
				|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписиОтказ2 КАК ФИО2
				|ИЗ
				|	РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитикаСрезПоследних
				|ГДЕ
				|	УчетнаяПолитикаСрезПоследних.Организация = &Организация";
	
			Запрос.УстановитьПараметр("Организация", Организация);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО1;
				НоваяСтрока.Должность =  Выборка.ФИО1.Должность;
				НоваяСтрока = Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО2;
				НоваяСтрока.Должность =  Выборка.ФИО2.Должность;
			КонецЦикла;

		Иначе	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи1 КАК ФИО1,
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи2 КАК ФИО2,
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи3 КАК ФИО3
			|ИЗ
			|	РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитикаСрезПоследних
			|ГДЕ
			|	УчетнаяПолитикаСрезПоследних.Организация = &Организация";
			
			Запрос.УстановитьПараметр("Организация", Организация);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО1;
				НоваяСтрока.Должность =  Выборка.ФИО1.Должность;
				НоваяСтрока = Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО2;
				НоваяСтрока.Должность =  Выборка.ФИО2.Должность;
				НоваяСтрока = Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО3;
				НоваяСтрока.Должность =  Выборка.ФИО3.Должность;
			КонецЦикла;
		КонецЕсли;
	

	КонецЕсли;	
КонецПроцедуры
