#Область ПрограмныйИтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();	
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризационнаяОпись";
	КомандаПечати.Идентификатор = "ИнвентарнаяОписьИНВ1";
	КомандаПечати.МестоРазмещения = "ПодменюПечать";
	КомандаПечати.Представление = НСтр("ru = 'Печать ИНВ-1'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;

КонецПроцедуры	
Процедура Печать(МассивОбъектов,ПараметрыПечати,КоллекцияПечатныхФорм,ОбъектыПечати,ПараметрыВывода) Экспорт
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"ИнвентарнаяОписьИНВ1");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьИНВ1(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Печать Инвентарную опись ИНВ - 1'");
        ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ИнвентаризационнаяОпись.ПФ_MXL_ИнвентаризационнаяОписьИНВ1";
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

Функция ПечатьИНВ1(МассивОбъектов,ОбъектыПечати) Экспорт
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ИНВ1";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризационнаяОпись.ПФ_MXL_ИнвентаризационнаяОписьИНВ1");

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДокумента.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ИнвентаризационнаяОпись КАК ТаблицаДокумента
	               |ГДЕ
	               |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатЗапроса = Запрос.Выполнить();
	
	СтрокаСПодвалом = Новый Массив; // создадим массив для проверки вывода 
	//СтрокаСПодвалом.Добавить(ОбластьДетальныхЗаписей); 
	//СтрокаСПодвалом.Добавить(ПодвалСтраницы); 

	ИтогПоСтраницеКолФакт 			= 0;
	ИтогПоСтраницеСтоимостьФакт     = 0;
	ИтогПоСтраницеКолБУ             = 0;
	ИтогПоСтраницеСтоимостьБУ       = 0;
	Выборка = РезультатЗапроса.Выбрать();
	ПервыйДокумент = Истина;
	Пока Выборка.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы+1;
		ТитульныйЛист = Макет.ПолучитьОбласть("ТитульныйЛист");
		ТитульныйЛист.Параметры.Организация 	= Выборка.Ссылка.Организация;
		ТитульныйЛист.Параметры.ДатаНачало  	= Формат(Выборка.Ссылка.ДатаНачало,"ДФ=dd.MM.yyyy");
		ТитульныйЛист.Параметры.ДатаОкончание = Формат(Выборка.Ссылка.ДатаОкончание,"ДФ=dd.MM.yyyy");
		ТитульныйЛист.Параметры.НомДок  		= Выборка.Ссылка.Номер;
		ТитульныйЛист.Параметры.ДатаДок       = Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(ТитульныйЛист);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Шапка =  Макет.ПолучитьОбласть("Шапка");
		//СтрокаСПодвалом.Добавить(Шапка);
		ТабличныйДокумент.Вывести(Шапка); 
		КолСтрок = Выборка.Ссылка.Комиссия.Количество();
		Для Каждого СтрокаОС Из  Выборка.Ссылка.ОС  Цикл
			Строка = Макет.ПолучитьОбласть("Строка");
			Строка.Параметры.ПорНом                           =	  СтрокаОС.НомерСтроки;	
			Строка.Параметры.ОсновноеСредствонаименование     =   СтрокаОС.Наименование;
			Строка.Параметры.ДокРегистранииНаименование       =   СтрокаОС.ДокуметРегистрация;
			Строка.Параметры.ДокРегистрацииДата               =   Формат(СтрокаОС.ДокуметРегистрацияДата,"ДФ=dd.MM.yyyy");
			Строка.Параметры.ДокРегистрацииНомер              =   СтрокаОС.ДокуметРегистрацияНомер;
			Строка.Параметры.ДатаПоступленияНаУчет            =   СтрокаОС.ДатаПоступленияНаУчет;
			Строка.Параметры.ИнвентарныйНомер                 =   СтрокаОС.ИнвентарныйНомер;
			Строка.Параметры.ЗаводскойНомер                   =   СтрокаОС.ЗаводскойНомер;
			Строка.Параметры.ПаспортНомер                     =   СтрокаОС.Паспорт;
			Строка.Параметры.КолФакт                          =   СтрокаОС.КоличествоФакт;
			Строка.Параметры.СтоимостьФакт                    =   СтрокаОС.СтоимостьФакт;
			Строка.Параметры.КолБУ                            =   СтрокаОС.КоличествоБУ;
			Строка.Параметры.СтоимостьБухУчет                 =   СтрокаОС.СтоимостьБУ;
			СтрокаСПодвалом.Добавить(Строка);
			Если Не ТабличныйДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда
				//ТабличныйДокумент.Вывести(Строка);
				//ПодвалПоСтранице =  Макет.ПолучитьОбласть("ПодвалПоСтранице");
				//ПодвалПоСтранице.Параметры.КолФактИтог           				=   ИтогПоСтраницеКолФакт;
				//ПодвалПоСтранице.Параметры.СтоимостьФактИтог     				=   ИтогПоСтраницеСтоимостьФакт;
				//ПодвалПоСтранице.Параметры.КолБУИтог             				=   ИтогПоСтраницеКолБУ;
				//ПодвалПоСтранице.Параметры.СтоимостьБухУчетИтог  				=   ИтогПоСтраницеСтоимостьБУ;
				//ПодвалПоСтранице.Параметры.ПорНомПрописьюСтраница				=   ЧислоПрописью(ИтогПоСтраницеКолФакт);
				//ПодвалПоСтранице.Параметры.СтоимостьФактИтогПрописьюСтраница    =   ЧислоПрописью(ИтогПоСтраницеСтоимостьФакт);
				//ТабличныйДокумент.Вывести(ПодвалПоСтранице);
				//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				//ТабличныйДокумент.Вывести(Шапка);
				//ИтогПоСтраницеКолФакт 			= 0;
				//ИтогПоСтраницеСтоимостьФакт     = 0;
				//ИтогПоСтраницеКолБУ             = 0;
				//ИтогПоСтраницеСтоимостьБУ       = 0;

			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(Строка);
			ИтогПоСтраницеКолФакт 			= ИтогПоСтраницеКолФакт + Строка.Параметры.КолФакт;
			ИтогПоСтраницеСтоимостьФакт     = ИтогПоСтраницеСтоимостьФакт + Строка.Параметры.СтоимостьФакт ;
			ИтогПоСтраницеКолБУ             = ИтогПоСтраницеКолБУ + Строка.Параметры.КолБУ ;
			ИтогПоСтраницеСтоимостьБУ       = ИтогПоСтраницеСтоимостьБУ + Строка.Параметры.СтоимостьБухУчет;
			Если СтрокаОС.НомерСтроки = КолСтрок Тогда
				//ПодвалПоСтранице =  Макет.ПолучитьОбласть("ПодвалПоСтранице");
				//ПодвалПоСтранице.Параметры.КолФактИтог           				=   ИтогПоСтраницеКолФакт;
				//ПодвалПоСтранице.Параметры.СтоимостьФактИтог     				=   ИтогПоСтраницеСтоимостьФакт;;
				//ПодвалПоСтранице.Параметры.КолБУИтог             				=   ИтогПоСтраницеКолБУ;
				//ПодвалПоСтранице.Параметры.СтоимостьБухУчетИтог  				=   ИтогПоСтраницеСтоимостьБУ;
				//ПодвалПоСтранице.Параметры.ПорНомПрописьюСтраница				=   ЧислоПрописью(ИтогПоСтраницеКолФакт);
				//ПодвалПоСтранице.Параметры.СтоимостьФактИтогПрописьюСтраница    =   ЧислоПрописью(ИтогПоСтраницеСтоимостьФакт);
				//ТабличныйДокумент.Вывести(ПодвалПоСтранице);
				//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				//ИтогПоСтраницеКолФакт 			= 0;
				//ИтогПоСтраницеСтоимостьФакт     = 0;
				//ИтогПоСтраницеКолБУ             = 0;
				//ИтогПоСтраницеСтоимостьБУ       = 0;
			КонецЕсли;	
		КонецЦикла;	
		Подвал =  Макет.ПолучитьОбласть("Подвал1");
		Подвал.Параметры.ПорНомПрописью 						= ЧислоПрописью(Выборка.Ссылка.ОС.Итог("КоличествоФакт"));
		Подвал.Параметры.СтоимостьФактИтогПрописью				= ЧислоПрописью(Выборка.Ссылка.ОС.Итог("СтоимостьФакт"));
		Подвал.Параметры.ПредседательКомиссииДолжность			= Выборка.Ссылка.ПредседательКомиссииФИО;
		Подвал.Параметры.ПредседательКомиссииФИО 				= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка.Ссылка.ПредседательКомиссииФИО);
		ТабличныйДокумент.Вывести(Подвал);
		Если Выборка.Ссылка.Комиссия.Количество() > 0 Тогда	
			Для Каждого СтрокаК Из  Выборка.Ссылка.Комиссия  Цикл
				Если СтрокаК.НомерСтроки = 1 Тогда
					ПодвалКомиссия1 =  Макет.ПолучитьОбласть("ПодвалКомиссия1");	
					ПодвалКомиссия1.Параметры.КомиссияДолжность1 		= 	СтрокаК.Должность;
					ПодвалКомиссия1.Параметры.КомиссияФИО1 			    =	ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрокаК.Сотрудник);
					ТабличныйДокумент.Вывести(ПодвалКомиссия1);
				Иначе	
					ПодвалКомиссия2 =  Макет.ПолучитьОбласть("ПодвалКомиссия2");	
					ПодвалКомиссия2.Параметры.КомиссияДолжность2 		= 	СтрокаК.Должность;
					ПодвалКомиссия2.Параметры.КомиссияФИО2 				=	ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрокаК.Сотрудник);
					ТабличныйДокумент.Вывести(ПодвалКомиссия2);	
				КонецЕсли
			КонецЦикла;
		КонецЕсли; 
		Подвал2 =  Макет.ПолучитьОбласть("Подвал2");
		Подвал2.Параметры.ПроверилДолжность 			= Выборка.Ссылка.ПроверилДолжность;
		Подвал2.Параметры.ПроверилФИО 					= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка.Ссылка.ПроверилФИО);
		ТабличныйДокумент.Вывести(Подвал2);
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
						
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,НомерСтрокиНачало,
													   ОбъектыПечати,Выборка.Ссылка);
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;

	
КонецФункции	