// Возвращает структуру с пустым значением полей, которая сохраняется 
// в реквизите Шаблон как ХранилищеЗначения.
//
Функция ПустаяСтруктураШаблонаПисьма() Экспорт

	Вложения = Новый Структура();

	Результат = Новый Структура();
	Результат.Вставить("ТекстHTML", "");
	Результат.Вставить("Вложения", 	Вложения);
	
	Возврат Результат;

КонецФункции



// Возвращает данные шаблона из хранилища.
//
Функция ДанныеШаблонаПисьма(ШаблонПисьма) Экспорт

	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ШаблонПисьма) Тогда
		ШаблонХранилище = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонПисьма, "ШаблонХранилище");
		Если ТипЗнч(ШаблонХранилище) = Тип("ХранилищеЗначения") Тогда
			Результат = ШаблонХранилище.Получить();
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Результат = ПустаяСтруктураШаблонаПисьма();
	КонецЕсли;

	Возврат Результат;

КонецФункции
