
&НаСервере
Процедура ЗаполнитьОСНаСервере()
	НаборЗаписей = РегистрыСведений.ОсновныеСредства.СоздатьНаборЗаписей();
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеСредства.Ссылка КАК ОсновноеСредство,
		|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ОсновныеСредства.Стоимость КАК СтоимостьФакт,
		|	1 КАК КоличествоФакт,
		|	ОсновныеСредства.УКого КАК УКого,
		|	ОсновныеСредства.ОтветственноеЛицо КАК ОтветственноеЛицо,
		|	ОсновныеСредства.СтатусОбъекта КАК ВЭксплуатации,
		|	ОсновныеСредства.Примечание КАК Примечание
		|ИЗ
		|	Справочник.ОсновныеСредства КАК ОсновныеСредства
		|ГДЕ
		|	ОсновныеСредства.СтатусОбъекта = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ОсновноеСредство = Выборка.ОсновноеСредство;
		НоваяЗапись.УКого = Выборка.УКого;
		НоваяЗапись.ОтветственноеЛицо =  Выборка.ОтветственноеЛицо;
		НоваяЗапись.ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
		НоваяЗапись.СтоимостьФакт = Выборка.СтоимостьФакт;
		НоваяЗапись.КоличествоФакт = Выборка.КоличествоФакт;
		НоваяЗапись.ВЭксплуатации = Выборка.ВЭксплуатации;
		НоваяЗапись.Примечание = Выборка.Примечание;
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОС(Команда)
	ЗаполнитьОСНаСервере();
	//аналог F5
	ЭтаФорма.Элементы.Список.Обновить();
КонецПроцедуры
