&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры         

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры         

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры         

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
&НаСервере
Функция ПараметрыРазмещения()
	Возврат ПодключаемыеКоманды.ПараметрыРазмещения();
КонецФункции	
&НаКлиенте
Процедура СписокНаКомиссиюНаСервере()
	ПараметрыРазмещения = ПараметрыРазмещения();
	Форма = ПолучитьФорму("Обработка.СписокНаКомиссию.Форма.Форма",ПараметрыРазмещения);
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокНаКомиссию(Команда)
	СписокНаКомиссиюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьДелоНаСервере()
	Форма = ПолучитьФорму("Обработка.ОпределитьИ_ЗакрытьЛичныеДела.Форма.Форма");
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьДело(Команда)
	ЗакрытьДелоНаСервере();
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

