// <Описание функции>
//
// Параметры:
//  <ФИО>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПроверкаНаДвойников(ФИО)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ТалоныНаЛьготыСрезПоследних.Заявитель) КАК Заявитель,
		|	ТалоныНаЛьготыСрезПоследних.Номер КАК Номер,
		|	ТалоныНаЛьготыСрезПоследних.ДатаВыдачи КАК ДатаВыдачи
		|ИЗ
		|	РегистрСведений.ТалоныНаЛьготы.СрезПоследних КАК ТалоныНаЛьготыСрезПоследних
		|ГДЕ
		|	ТалоныНаЛьготыСрезПоследних.Организация = &Организация
		|	И ТалоныНаЛьготыСрезПоследних.Заявитель = &Заявитель";
	
	Запрос.УстановитьПараметр("Заявитель", ФИО);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		//Информация = 
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецФункции // ПроверкаНаДвойников()
 

Процедура ЗаписьНомераТалонаВРегистр()
	
	ПоследняяСтрока = ТалоныТЧ.Количество();
	НомерПоследнейСтроки = ТалоныТЧ[ПоследняяСтрока-1].Номер;
	
	Движения.НумирацияТалонов.Записывать = Истина;
	Движение =  Движения.НумирацияТалонов.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.ВидЛьготы = ВидЛьготы;
	Движение.ПоследнийНомерТалона = НомерПоследнейСтроки;
	Движение.Регистратор = Ссылка;
	
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ ИнформацияПоВыдаче.Количество() > 0 Тогда
		//Отказ=Истина
	КонецЕсли;	
		
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныНаЛьготыСрезПоследних.Заявитель КАК Заявитель,
		|	ТалоныНаЛьготыСрезПоследних.Номер КАК Номер,
		|	ТалоныНаЛьготыСрезПоследних.ДатаВыдачи КАК ДатаВыдачи
		|ИЗ
		|	РегистрСведений.ТалоныНаЛьготы.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Заявитель В
		|					(ВЫБРАТЬ
		|						ТалоныТалоныТЧ.Заявитель КАК Заявитель
		|					ИЗ
		|						Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|					ГДЕ
		|						ТалоныТалоныТЧ.Ссылка = &Ссылка)) КАК ТалоныНаЛьготыСрезПоследних
		|ГДЕ
		|	ТалоныНаЛьготыСрезПоследних.Период МЕЖДУ &Период1 И &Период2
		|	И ТалоныНаЛьготыСрезПоследних.ВидЛьготы = &ВидЛьготы";
	
	Запрос.УстановитьПараметр("ВидЛьготы", ВидЛьготы);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период1", ВидЛьготы.ДатаНачала);
	Запрос.УстановитьПараметр("Период2", ВидЛьготы.ДатаОкончания);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		//Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			Сообщить(Строка(Выборка.Заявитель)+ "Уже получил талон №"+ Строка(Выборка.Номер) + " " + Строка(Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy")));
		КонецЦикла;

	КонецЕсли;	
	
		
	

	
	Движения.КоличествоЛьготПоКатегориям.Записывать = Истина;
	Для Каждого ТекСтрокаИнформация Из Информация Цикл
		Движение = Движения.КоличествоЛьготПоКатегориям.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Льгота = ВидЛьготы;
		Движение.ЛьготнаяКатегория = ТекСтрокаИнформация.Категория;
		Движение.Группа = ТекСтрокаИнформация.Группа;
		Движение.Количество = ТекСтрокаИнформация.Количество;
	КонецЦикла;
	
	
	Движения.КоличествоЛьготВыдано.Записывать = Истина;
		
	Для Каждого ТекСтрока из ИнформацияПоВыдаче Цикл
		Движение = Движения.КоличествоЛьготВыдано.Добавить();
		Движение.Период = ТекСтрока.ДатаВыдачиЗаявителю;
		Движение.Организация = Организация;
		Движение.Льгота = ВидЛьготы;
		Движение.ЛьготнаяКатегория = ТекСтрока.Категория;
		Движение.Группа = ТекСтрока.Группа;
		Движение.Количество =ТекСтрока.Количество;
	КонецЦикла;

	// регистр ТалоныНаЛьготы
	Движения.ТалоныНаЛьготы.Записывать = Истина;
	Для Каждого ТекСтрока Из ТалоныТЧ Цикл
		Движение = Движения.ТалоныНаЛьготы.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Заявитель = ТекСтрока.Заявитель;
		Движение.Сотрудник = СотрудникДляРосписи;
		Движение.АдресДомовладельца = ТекСтрока.АдресДомовладельца;
		Движение.Номер = ТекСтрока.Номер;
		Движение.СтатусПолучателя = ТекСтрока.Категория;
		Движение.НормаОтпуска = ТекСтрока.НормаОтпуска;
		Движение.НомерПолучателя = ТекСтрока.НомерПолучателя;
		Движение.ПериодДействияТалона = ТекСтрока.ПериодДействияТалона;
		Движение.ДатаВыдачи = ТекСтрока.ДатаВыдачи;
		Движение.ДатаВыдачиЗаявителю = ТекСтрока.ДатаВыдачиЗаявителю;
		Движение.ДатаОтпускаУгля = ТекСтрока.ДатаОтпускаУгля;
		Движение.ДокументОснование = ТекСтрока.ДокументОснование;
		Движение.ЛьготнаяКатегория = ТекСтрока.ДокументОснование.ЛьготнаяКатегория;
		Движение.ВидЛьготы = ВидЛьготы; 
		Движение.ПредметЛьготы = ТекСтрока.ПредметЛьготы;
		Если Проведен Тогда
			ТекДок = ТекСтрока.ДокументОснование.ПолучитьОбъект();
			ТекДок.СформированТалон=Истина;
			ТекДок.Записать();
						
		Иначе
			ТекДок = ТекСтрока.ДокументОснование.ПолучитьОбъект();
			ТекДок.СформированТалон=Ложь;
			ТекДок.Записать();
		КонецЕсли;
	КонецЦикла;
	//ЗаписьНомераТалонаВРегистр();
	
КонецПроцедуры
