
&НаКлиенте
Процедура ТекстПисьма(Команда)
	ПараметрыФормы = Новый Структура("ОбъектПечати,ШаблонОбъекта");   
	ПараметрыФормы.Вставить("ОбъектПечати", Объект.Ссылка);
	ПараметрыФормы.Вставить("ШаблонОбъекта",Объект.ШаблонПисьма);
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияТекстаОбъекта",ПараметрыФормы,ЭтаФорма);
КонецПроцедуры
&НаСервере
Функция ПолучитьЗаявителяСтрока(ЛД)
	
	Возврат ЛД.Заявитель.Наименование;
КонецФункции
&НаСервере
Функция КоличествоЛистовПредоставленныхДокументов(Док)
	Возврат Док.СписокДокументовПредоставлено.Итог("КоличествоЛистов");
КонецФункции	

&НаКлиенте
Процедура ЗаполнениеТаблицыПриложение(ТД)
	Если ТипЗнч(ТД.ЛичноеДело)  = Тип("ДокументСсылка.ЛичноеДело") Тогда
		ОписаниеТипов = Новый ОписаниеТипов("ДокументСсылка.ЛичноеДело"); 
		ОписаниеТиповТекст2 = Новый ОписаниеТипов("Число");
		Элементы.ПриложениеТекст1.Заголовок = "Наименование приложения";
		Элементы.ПриложениеТекст2.Заголовок = "Физическое лицо";
		Элементы.ПриложениеТекст3.Заголовок = "Количество листов";
		Элементы.ПриложениеТекст4.Заголовок = "Количество экземпляров";
		НаименованиеПриложения = "Дело";
		
	Иначе	
		ОписаниеТипов = Новый ОписаниеТипов("Строка"); 
	КонецЕсли;
	НоваяСтрока = Объект.Приложение.Добавить();
	НоваяСтрока.Объект = ОписаниеТипов.ПривестиЗначение(НоваяСтрока.Объект);
	НоваяСтрока.Объект = ТД.ЛичноеДело;
	НоваяСтрока.Текст1 = НаименованиеПриложения;
	НоваяСтрока.Текст2 = ПолучитьЗаявителяСтрока(ТД.ЛичноеДело);
	КЛПД = КоличествоЛистовПредоставленныхДокументов(ТД.ЛичноеДело);
	Если КЛПД > 0 Тогда 
		НоваяСтрока.Текст3 =  ОписаниеТиповТекст2.ПривестиЗначение(НоваяСтрока.Текст1);
		НоваяСтрока.Текст4 =  ОписаниеТиповТекст2.ПривестиЗначение(НоваяСтрока.Текст2);
		НоваяСтрока.Текст3 = КЛПД;
		НоваяСтрока.Текст4 = 1;
	КонецЕсли;	
КонецПроцедуры  	
&НаКлиенте
Процедура СписокЛичныхДелЛичноеДелоПриИзменении(Элемент)
	ТД = Элементы.СписокЛичныхДел.ТекущиеДанные;
	ТД.ФизическоеЛицо  = ПолучитьЗаявителяСтрока(ТД.ЛичноеДело);
	Если ЗаполнитьТаблицуПриложения Тогда
		ЗаполнениеТаблицыПриложение(ТД);
	КонецЕсли;	
КонецПроцедуры
