
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПриложениеКАкту)
	ТабДок = Новый ТабличныйДокумент;
	ПриложениеКАкту(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПриложениеКАкту(ТабДок, ПараметрКоманды)
	Документы.ПолученопоПоТалонам.ПриложениеКАкту(ТабДок, ПараметрКоманды);
КонецПроцедуры
