


&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	    // родители
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДелоСоставСемьи.Ссылка КАК Ссылка,
		|	ЛичноеДелоСоставСемьи.ФИО.Наименование КАК ФИО,
		|	ЛичноеДелоСоставСемьи.Ссылка.Заявитель.Наименование КАК Заявитель
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|ГДЕ
		|	(ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.мать)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.отец)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.супруг)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.супруга))
		|	И ЛичноеДелоСоставСемьи.Ссылка В(&Документ)";
	
	Запрос.УстановитьПараметр("Документ",Строки.ПолучитьКлючи());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаСписка = Строки[Выборка.Ссылка];
		СтрокаСписка.Данные["МамаПапа"] = Строка(Выборка.ФИО) +" ; "+ Строка(Выборка.Заявитель);
		
	КонецЦикла;
	
	
	// дети
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДелоСоставСемьи.Ссылка КАК Ссылка,
		|	ЛичноеДелоСоставСемьи.ФИО.Наименование КАК ФИО
		|ИЗ
		|	Документ.ЛичноеДело.СоставСемьи КАК ЛичноеДелоСоставСемьи
		|ГДЕ
		|	(ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.дочь)
		|			ИЛИ ЛичноеДелоСоставСемьи.Родство = ЗНАЧЕНИЕ(Справочник.Родство.сын)
		|				И ЛичноеДелоСоставСемьи.Ссылка В (&Документ))
		|	И ЛичноеДелоСоставСемьи.Ссылка.МногодетнаяСемья = ИСТИНА
		|	И ВЫБОР
		|			КОГДА МЕСЯЦ(ЛичноеДелоСоставСемьи.Ссылка.Дата) < МЕСЯЦ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения)
		|				ТОГДА РАЗНОСТЬДАТ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения, ЛичноеДелоСоставСемьи.Ссылка.Дата, ГОД) - 1
		|			КОГДА МЕСЯЦ(ЛичноеДелоСоставСемьи.Ссылка.Дата) > МЕСЯЦ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения)
		|				ТОГДА РАЗНОСТЬДАТ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения, ЛичноеДелоСоставСемьи.Ссылка.Дата, ГОД)
		|			КОГДА МЕСЯЦ(ЛичноеДелоСоставСемьи.Ссылка.Дата) = МЕСЯЦ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения)
		|				ТОГДА ВЫБОР
		|						КОГДА ДЕНЬ(ЛичноеДелоСоставСемьи.Ссылка.Дата) < ДЕНЬ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения)
		|							ТОГДА РАЗНОСТЬДАТ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения, ЛичноеДелоСоставСемьи.Ссылка.Дата, ГОД) - 1
		|						КОГДА ДЕНЬ(ЛичноеДелоСоставСемьи.Ссылка.Дата) >= ДЕНЬ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения)
		|							ТОГДА РАЗНОСТЬДАТ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения, ЛичноеДелоСоставСемьи.Ссылка.Дата, ГОД)
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ >= 6
		|	И ВЫБОР
		|			КОГДА МЕСЯЦ(ЛичноеДелоСоставСемьи.Ссылка.Дата) < МЕСЯЦ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения)
		|				ТОГДА РАЗНОСТЬДАТ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения, ЛичноеДелоСоставСемьи.Ссылка.Дата, ГОД) - 1
		|			КОГДА МЕСЯЦ(ЛичноеДелоСоставСемьи.Ссылка.Дата) > МЕСЯЦ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения)
		|				ТОГДА РАЗНОСТЬДАТ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения, ЛичноеДелоСоставСемьи.Ссылка.Дата, ГОД)
		|			КОГДА МЕСЯЦ(ЛичноеДелоСоставСемьи.Ссылка.Дата) = МЕСЯЦ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения)
		|				ТОГДА ВЫБОР
		|						КОГДА ДЕНЬ(ЛичноеДелоСоставСемьи.Ссылка.Дата) < ДЕНЬ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения)
		|							ТОГДА РАЗНОСТЬДАТ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения, ЛичноеДелоСоставСемьи.Ссылка.Дата, ГОД) - 1
		|						КОГДА ДЕНЬ(ЛичноеДелоСоставСемьи.Ссылка.Дата) >= ДЕНЬ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения)
		|							ТОГДА РАЗНОСТЬДАТ(ЛичноеДелоСоставСемьи.ФИО.ДатаРождения, ЛичноеДелоСоставСемьи.Ссылка.Дата, ГОД)
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ < 24";
	
	Запрос.УстановитьПараметр("Документ",Строки.ПолучитьКлючи());
	
	Дети = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Дети Цикл
		СсылкаКонтроль = Строка.Ссылка;
		ДетиСтрока = "";
		Для Каждого Строка2 Из Дети Цикл
			
			Если Строка2.Ссылка = СсылкаКонтроль Тогда
				 ДетиСтрока = ДетиСтрока + Строка2.ФИО + "; ";
				 Ссылка = Строка2.Ссылка;
			КонецЕсли;	
			Если Строка2.Ссылка = СсылкаКонтроль Тогда
				 ЧислоСимволов = СтрДлина(ДетиСтрока);
				 ДетиСтрокаНовая = Сред(ДетиСтрока,1,ЧислоСимволов-2);
				 СтрокаСписка = Строки[Ссылка];                  // ошибка тут
				 СтрокаСписка.Данные["Дети"] = ДетиСтрокаНовая;
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
	
	//Выборка = РезультатЗапроса.Выбрать();
	//Дети = Новый Структура("Ссылка,ФИО");
	//
	//Пока Выборка.Следующий() Цикл
	//	Дети.Вставить("Ссылка",Выборка.Ссалка);
	//	Дети.
	//КонецЦикла;

	//СтрокаСписка = Строки[Выборка.Ссылка];
		//СтрокаСписка.Данные["Дети"] = Выборка.ФИО) +" ; " + Строка(Выборка.Заявитель);

КонецПроцедуры

